{"uuid": "100dbfcf-3244-4ff9-80a1-fc99bd479459", "id": 30675, "date": "2021-11-05T04:20:00", "date_gmt": "2021-11-05T11:20:00", "guid": {"rendered": "https://estreetshuffle.com/?p=30675"}, "modified": "2021-11-05T08:57:00", "modified_gmt": "2021-11-05T15:57:00", "slug": "where-the-band-was-tempe-november-5-1980-barry-rebos-story", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2021/11/05/where-the-band-was-tempe-november-5-1980-barry-rebos-story/", "title": {"rendered": "Where the Band Was: Tempe, November 5, 1980 (Barry Rebo&#8217;s story)"}, "content": {"rendered": "<div class=\"su-box su-box-style-default\" id=\"\" style=\"border-color:#000000;border-radius:3px;\"><div class=\"su-box-title\" style=\"background-color:#333333;color:#FFFFFF;border-top-left-radius:1px;border-top-right-radius:1px\">Editor's Note</div><div class=\"su-box-content su-u-clearfix su-u-trim\" style=\"border-bottom-left-radius:1px;border-bottom-right-radius:1px\">\n<p><span style=\"font-size: 12pt;\"><strong>Editor&#8217;s Note:</strong></span> <span style=\"font-size: 16px;\">Today&#8217;s guest blogger is friend of the blog and long-time Springsteen fan Barry Rebo.  Even if you don&#8217;t know his name (and many of you certainly do), if you read this blog I guarantee you&#8217;re familiar with his work. </span></p>\n<p><span style=\"font-size: 16px;\">Having once lived down the Jersey Shore, Barry is one of Bruce&#8217;s earliest fans (since 1969), and more importantly: he&#8217;s pretty mean with a camera. He filmed Bruce and the band in the studio recording &#8220;Jungleland&#8221; in the <em>Wings for Wheels</em> documentary; </span><span style=\"font-size: 12pt;\">the archival footage included in <em>The Promise: Darkness on the Edge of Town</em>; and t</span><span style=\"font-size: 16px;\">he River Tour rehearsal video and multi-camera Live in Tempe concert that accompanies the <em>The River</em> anniversary box set. </span><span style=\"font-size: 16px;\">As fans, we all share a debt of gratitude to Barry.</span></p>\n<p><span style=\"font-size: 12pt;\">Barry moved on to a successful and storied career in documentary film-making and was an early HDTV pioneer. He&#8217;s still a Springsteen fan, though, and today he recalls for us his last-ever Bruce shoot, one with an ironic behind-the-scenes connection to one of Bruce&#8217;s most famous on-stage remarks.</span></p>\n</div></div>\n<p>I remain rightly embarrassed to admit that I did not vote in the Ronald Reagan / Jimmy Carter Presidential Election of November 4<sup>th</sup>, 1980. This was well before early or mail-in voting was widely adopted or I would/should have supported Carter as I did in his first run for office.</p>\n<p>But that day I was on my way to Tempe, Arizona to produce and direct a concert recording of Bruce Springsteen and the E Street Band’s Arizona State University performance on the 5<sup>th</sup>, one of their first dates at the start of their original River Tour.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Born to Run (The River Tour, Tempe 1980)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/3jLdecONVQs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>The technical aspects of the shoot are far easier for me to recall.</p>\n<p>We flew in from New York with what’s called a “video fly-pack” of camera equipment. Instead of renting a local production van, switching the show “live,&#8221; it was always my intent to shoot it “film-style”&#8211;albeit with four high-end, broadcast-quality video cameras, each recorded onto their own 1” portable reel-to reel-recorders.  Shots were “called” live but the intended cuts were not recorded at the venue.</p>\n<p>All together, the entire production package was worth around $400,000 (about $1.4M today, a startling reminder of the ravages of inflation). I owned the majority of the equipment, and the key crew members had long been affiliated with my then production company, Rebo Associates. All were highly accomplished professionals, but more importantly many were long-time friends who had graciously supported me all through the 1970s on my own personal &#8220;passion project,&#8221; the one that I’d initiated with Bruce once we met down the Jersey Shore in the late sixties.  Tempe was by far the largest production I’d fronted, and as it turned out it was to be my last Bruce shoot. But that’s another story for another time.</p>\n<p>We worked closely with Bruce’s then lighting director, Mark Brickman, to maximize our camera’s ability to best capture his outstanding concert lighting. We were all very well aware that Bruce would never be willing to compromise the theatrical impact his live audiences always expected of him. Remember: while currently state-of-the-art 1980 equipment, it was still all analogue with many more compromises to live with then even today’s digital consumer cameras (or iPhones for that matter) have blown past performance-wise.</p>\n<p>The cameras still had pick-up tubes (less contrast and sensitivity than today’s CCD solid state imagers), the aspect ratio of the picture format was the once traditional 4:3 image (square, not widescreen, as is standard today), and the 1” reel to reel VTRs had tape loads limited to 60 minutes duration, much to hardcore fans&#8217; chagrin. (This explains why some songs were omitted. In short, we were reloading the tape decks. Mystery solved.)</p>\n<p>Thirty-five years passed before the show was completed by Thom Zimny for inclusion in <em>The River</em> box set reissue, crafting the show using the best coverage we provided.  Thom did his usual excellent job, as he’s always delivered for Bruce and his worldwide audience.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Cadillac Ranch (The River Tour, Tempe 1980)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/4dG3jc6fzPY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Still, as great as the concert proved to be both in the arena and on tape, from my vantage point forty-one years on the most moving and remarkable takeaway from that evening was Bruce&#8217;s wholly unexpected but clearly heartfelt remarks regarding Ronald Reagan’s commanding victory less than twenty-four hours earlier.</p>\n<p>By then, I’d been around Bruce for a decade or so. We’re close in age and shared many of the same experiences along with our peers during the late ‘60s&#8211;primarily how we chose to deal with our Vietnam War obligations which inevitably lead to a daunting  trip to Newark, New Jersey and its unavoidable  draft board confrontation.</p>\n<p>That night in Tempe remains my recollection of Bruce&#8217;s first overtly political statement, given from <em>his</em> stage to <span style=\"font-style: normal !msorm;\"><em>his</em></span> passionate followers in<em> <span style=\"font-style: normal !msorm;\">his</span></em> audience that specific evening. What he said that night was both short and prescient. More a call for <em>thought </em>rather than a call for specific <em>action. </em>This difference remains how I prefer popular artists engage with the sway they have over their audiences.</p>\n<p><strong><em>“I don’t know what you guys think about what happened last night, but I think it’s pretty frightening.” </em></strong></p>\n<p>He then threw down a particularly enraged version of his one of his most defiant songs, “<a href=\"https://estreetshuffle.com/index.php/2019/05/20/roll-of-the-dice-badlands/\">Badlands</a>,” which is how great artists should assist us in making sense of our world.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Badlands (Tempe 1980)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/NGoBcNXa3mM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Ronald Reagan&#8217;s nationwide victory was a complete rout over Carter. He carried 44 states, including Arizona, where he won by 32 percent.</p>\n<p>His smashing victory, framed by Bruce’s concise but conscious remarks, made me recall the time when I, too, bumped up against this political landslide when in late 1979 a New York City production stage called frantically asking if they could rent one of my camera/VTR production packages for a shoot they had booked.</p>\n<p>Initially, they’d wrongly assumed it was to be a 35MM film shoot given the high profile of the production company they contracted with. But upon further discovery, they learned it required state-of-the-art video equipment. They knew that was my specialty and asked me to provide it to them on a rental basis as they were in a jam.</p>\n<p>It was never divulged to me who their client was. They simply asked me to bring over the equipment in the early morning at 8am, get it set up, and leave for the duration of the production day. While my curiosity was aroused, I did as asked. At the designated time, 5pm or so, I came back to the studio assuming they’d be ready to wrap up, but they were not.</p>\n<p>I walked onto the stage and to my amazement saw that the shoot was Ronald Reagan announcing that he would be running for president in 1980. It was released on November 13, 1979 on all broadcast networks, his as-yet-unnamed campaign backers presumably having paid handsomely to blanket the nation.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Candidacy for Presidency: Ronald Reagans announcement of Candidacy for President of U.S.  11/13/79\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/fAtYMD-H2UY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>What was remarkable was that the set was designed to replicate the President’s White House office. It spookily looked as if he’d already been elected. Reagan, to his credit, was the consummate performer. . He started seated, smoothly got up and moved to casually sit on the corner of his desk, returned to his seat, and got back up to conclude his remarks without taking a single break. No edits were required. I was told he made it through three complete takes before becoming too exhausted to continue. No telling how many attempts had to be scrubbed due to flubs by either Reagan or the camera operator. That’s why they hadn’t finished as early as anticipated. Sounds simple to do, but it’s not&#8211;even for the accomplished actor and pitchman that he was.</p>\n<p>Standing in the back of the studio outside of the stage lights observing their client’s performance were three of the Conservative Rights leading political consultants&#8211; hired guns who had been charged with writing, designing and implementing Reagan&#8217;s presidential campaign, starting with this kick-off recording that aired nationwide immediately upon completion.</p>\n<p>As I recall, a young Lee Atwater was present that day, someone I recognized from my own work shooting political ads, albeit for liberal, generally left-of-center political consultants and their candidates. Most of us who did this type of work lined up with one political party or another and were hired accordingly, as in the midst of any campaign there’s always sensitive information being exchanged. Atwater was a known rabid dog, someone who proudly was shameless in attacking anyone who did not adhere to his particular worldview, and racist to the core. For example, he was often credited with writing one of Reagan’s more insensitive “go to” lines he was known to employ whenever it might prove helpful, citing “Cadillac-driving welfare queens” and &#8220;strapping young bucks buying T-bone steaks with food stamps.&#8221;</p>\n<p>Ironically, Atwater, who would later become the Chairman of the entire Republican National Committee,  had an unbelievable knowledge and  passion for the blues and R&amp;B music and, according to no less than B.B. King who he became friends with, was an accomplished blues guitarist himself. King played with him, Sam Moore, Isaac Hayes and Carla Thomas on Atwater’s 1990 Grammy-nominated album, <em>Red Hot &amp; Blue</em>. On his deathbed in 1991, he asked for forgiveness for his actions in propagating racial dissent that the Reagan era further advanced. In 1992, King organized a musical tribute to Atwater on the opening day of the Republican National Convention in Houston, Texas.</p>\n<p>I find a certain irony that one of the same four camera systems I brought to Tempe to record not only Bruce&#8217;s fantastic concert that evening but also his clearly heartfelt personal response to the previous evening’s election results was itself actually used by Reagan and his handlers on the conservative right to kick off their mutual Presidential ambitions.</p>\n<p>In Kurt Andersen&#8217;s fascinating 2020 book <em>Evil Geniuses: The Unmaking of America,</em> he traces the beginning of America&#8217;s course correction to the political right and the economic havoc that followed Reagan’s 1980 election. It’s a fascinating read for anyone who finds themselves asking how did we get to the political, economic and psychological morass we now find ourselves in. Andersen starts his narrative in the late sixties and early seventies when the ultra-right sought a national candidate to help them fulfill their vision of their America. In Ronald Reagan, a former Democrat, in fact, they found the consummate professional, an actor/pitchman/performer and politician to deliver their message&#8211;one who clearly presaged the era of Donald J. Trump and all his followers.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - The River (The River Tour, Tempe 1980)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/lc6F47Z6PI4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Take a beat and consider all that&#8217;s transpired in the past 42 years since that November 5<sup>th</sup> in Tempe&#8211;for Bruce, the country, and for all of us in our own lives. Remember Bruce&#8217;s seemingly surprising first overtly political statement that night as well as this very week’s election results.</p>\n<p>During The Late Show with Stephen Colbert just this past October 25<sup>th</sup>, when asked about his current state of mind regarding America, today, he said, &#8220;It worries me. Do you really want Marjorie Taylor Greene, Matt Gaetz, Ron deSantis, and our ex-fearless leader deciding the fate of the American Experiment?&#8221;</p>\n<p>Amen, Brother. Equally succinct but with enough of a touch of the humor we all need these days so very much.</p>\n<p>&nbsp;</p>\n", "protected": false}, "excerpt": {"rendered": "<p>Guest-blogger Barry Rebo shares his unique recollections from one of Bruce&#8217;s most well-known shows.</p>\n", "protected": false}, "author": 1, "featured_media": 30677, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [152], "tags": [2845, 128, 1822], "class_list": ["post-30675", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-where-the-band-was", "tag-barry-rebo", "tag-river-tour", "tag-tempe"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/1980-11-05.jpg?fit=1000%2C1000&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-7YL", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 20245, "url": "https://estreetshuffle.com/index.php/2020/07/31/where-the-band-was-zurich-july-31-2016-barry-rebos-story/", "url_meta": {"origin": 30675, "position": 0}, "title": "Where the Band Was: Zurich, July 31, 2016 (Barry Rebo&#8217;s story)", "author": "Ken", "date": "July 31, 2020", "format": false, "excerpt": "The Locarno Film Festival (Locarno, Switzerland) always plays the first week of August. It mixes the passion of the Italians with the organization and graciousness of the Swiss. Experienced together you have a wonderful right brain/left brain celebration of auteur cinema. Sitting outdoors on the Grande Plaza amongst three thousand passionate…", "rel": "", "context": "In &quot;Where the Band Was&quot;", "block_context": {"text": "Where the Band Was", "link": "https://estreetshuffle.com/index.php/category/where-the-band-was/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/zurich.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/zurich.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/zurich.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/zurich.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/zurich.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 61284, "url": "https://estreetshuffle.com/index.php/2025/11/05/kingdom-of-days-november-5-2/", "url_meta": {"origin": 30675, "position": 1}, "title": "Kingdom of Days: November 5", "author": "Ken", "date": "November 5, 2025", "format": false, "excerpt": "Big day: Bruce releases his second studio album, films a 1980 River show for posterity (and an eventual box set), and makes guest appearances with Huey Lewis, Bob Geldof, and Eric Church. Lots more inside.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/wild.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/wild.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/wild.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/wild.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/wild.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 61099, "url": "https://estreetshuffle.com/index.php/2025/10/11/kingdom-of-days-october-11-2/", "url_meta": {"origin": 30675, "position": 2}, "title": "Kingdom of Days: October 11", "author": "Ken", "date": "October 11, 2025", "format": false, "excerpt": "On this date: Steel Mill opens for Ike and Tina Turner, Suki Lahav joins the E Street Band, and the Vote for Change Tour wraps up with a star-studded broadcast. These and more highlights inside.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/09/PearlJam_2004-10-11_Washington_cover_1288381759.jpg?fit=785%2C676&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/09/PearlJam_2004-10-11_Washington_cover_1288381759.jpg?fit=785%2C676&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/09/PearlJam_2004-10-11_Washington_cover_1288381759.jpg?fit=785%2C676&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/09/PearlJam_2004-10-11_Washington_cover_1288381759.jpg?fit=785%2C676&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 61316, "url": "https://estreetshuffle.com/index.php/2025/11/08/kingdom-of-days-november-8-2/", "url_meta": {"origin": 30675, "position": 3}, "title": "Kingdom of Days: November 8", "author": "Ken", "date": "November 8, 2025", "format": false, "excerpt": "On this date: Bruce plays a special show at his old elementary school, a complete Stand Up for Heroes performance, and the long-awaited return of \"Drive All Night\" after a quarter-century absence.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/freehold.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/freehold.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/freehold.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/freehold.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/freehold.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 58367, "url": "https://estreetshuffle.com/index.php/2025/08/10/kingdom-of-days-august-10-2/", "url_meta": {"origin": 30675, "position": 4}, "title": "Kingdom of Days: August 10", "author": "Ken", "date": "August 10, 2025", "format": false, "excerpt": "On this date: The Castiles play their final show, Bruce's 1972 performance at Max's Kansas City is captured on video, and Bruce's eleven-night World Tour 1992 Meadowlands stand wraps up in style. More highlights inside.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/08/19720810_front.jpg?fit=770%2C779&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/08/19720810_front.jpg?fit=770%2C779&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/08/19720810_front.jpg?fit=770%2C779&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/08/19720810_front.jpg?fit=770%2C779&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 11224, "url": "https://estreetshuffle.com/index.php/2019/07/16/roll-of-the-dice-save-my-love/", "url_meta": {"origin": 30675, "position": 5}, "title": "Roll of the Dice: Save My Love", "author": "Ken", "date": "July 16, 2019", "format": false, "excerpt": "\"Save My Love\" is modern-day nostalgia: a 2010 recording (based on a 1976 rehearsal) about the power of radio in a pre-streaming world. Backstory, insights, and remarkable video inside.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/07/savemylove_sin-blackfriday2010.jpg?fit=800%2C800&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/07/savemylove_sin-blackfriday2010.jpg?fit=800%2C800&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/07/savemylove_sin-blackfriday2010.jpg?fit=800%2C800&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/07/savemylove_sin-blackfriday2010.jpg?fit=800%2C800&ssl=1&resize=700%2C400 2x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/30675", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=30675"}], "version-history": [{"count": 11, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/30675/revisions"}], "predecessor-version": [{"id": 30717, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/30675/revisions/30717"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/30677"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=30675"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=30675"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=30675"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}