{"id": 32364, "date": "2022-05-14T05:00:00", "date_gmt": "2022-05-14T12:00:00", "guid": {"rendered": "https://estreetshuffle.com/?p=32364"}, "modified": "2024-01-03T15:35:07", "modified_gmt": "2024-01-03T23:35:07", "slug": "roll-of-the-dice-backstreets", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2022/05/14/roll-of-the-dice-backstreets/", "title": {"rendered": "Roll of the Dice: Backstreets"}, "content": {"rendered": "<blockquote><p><span style=\"font-size: 14pt;\">&#8220;Suki left the [E Street Band] around March 1975. She and her husband, Louis, decided to go back to Israel. Louis was our engineer and had done terrific work on the albums, as well as running sound on the live shows. I believe he got crazy because, quite simply, Bruce fell in love with Suki and she with him. She then had to get out to try and save the marriage.&#8221; &#8212; Mike Appel, <em>Down Thunder Road: The Making of Bruce Springsteen </em>(1992)</span></p></blockquote>\n<p>We may never know the true story of the friendship between Bruce Springsteen and Suki Lahav.</p>\n<p>Some claim to know, like Bruce&#8217;s former agent Mike Appel, who minced few words about it in his 1992 sensational book with author Marc Eliot. Others demur, pointing to Lahav&#8217;s marriage and Bruce&#8217;s committed relationship that spanned Lahav&#8217;s brief tenure with the E Street Band as evidence that nothing untoward was going on. And still others simply decline to comment.</p>\n<p>What we do know is that Lahav made her first appearance on the Springsteen scene in 1973, when a children&#8217;s choir no-showed for Bruce&#8217;s recording sessions and Suki was drafted to be a one-woman choir for &#8220;<a href=\"https://estreetshuffle.com/index.php/2019/04/26/roll-of-the-dice-4th-of-july-asbury-park-sandy/\">4th of July, Asbury Park (Sandy)</a>&#8221; and &#8220;<a href=\"https://estreetshuffle.com/index.php/2018/12/14/roll-of-the-dice-incident-on-57th-street/\">Incident on 57th Street</a>.&#8221; (Suki&#8217;s husband Louis recorded overdub after overdub to get his wife to sound like a choir.)</p>\n<p>By 1974, Bruce had begun writing in a more romantic vein, and over the summer he decided to add a warm violin to the band&#8217;s sound to heighten his more tender songs. &#8220;Louis sent me along to audition,&#8221; Suki told <em>The Jerusalem Post</em> in 2007. &#8220;There were others. Surprisingly, he took me. I didn&#8217;t think I was very good&#8230; You have to practice for hours a day. I was never a big practicer. But maybe I did have my own thing.&#8221;</p>\n<p>Suki made her E Street Band stage debut at Avery Fisher Hall in New York City on October 4, 1974&#8211;the same night Bruce premiered a work-in-progress &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/04/04/roll-of-the-dice-shes-the-one/\">She&#8217;s the One</a>.&#8221;</p>\n<audio class=\"wp-audio-shortcode\" id=\"audio-32364-3\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://estreetshuffle.com/wp-content/uploads/2022/05/d1-avery-fisher08.mp3?_=3\" /><a href=\"https://estreetshuffle.com/wp-content/uploads/2022/05/d1-avery-fisher08.mp3\">https://estreetshuffle.com/wp-content/uploads/2022/05/d1-avery-fisher08.mp3</a></audio>\n<p>Some have claimed that Suki was the inspiration for &#8220;She&#8217;s the One,&#8221; and certainly the timing of her arc with the band would cooperate with that thesis. But if &#8220;She&#8217;s the One&#8221; was truly inspired by her, things had already gone very wrong by then.</p>\n<p>That early version of &#8220;She&#8217;s the One&#8221; was a very different song than the one Bruce would release on <em>Born to Run</em> within the year. It was clearly a post-breakup song, and Bruce&#8217;s lyrics were spiteful and vituperative. In particular, it contained some lines destined for another classic altogether:</p>\n<p style=\"padding-left: 40px;\"><em>I hated him and his fancy ways</em><br />\n<em>And I hated you when you went away</em></p>\n<p style=\"padding-left: 40px;\"><em>Remember all the movies baby we&#8217;d go see</em><br />\n<em>Trying to learn how to walk and talk rough just like the heroes we thought we had to be</em></p>\n<p>Regardless of whatever might have been happening behind closed doors, though, on stage the heat and chemistry between Bruce and Suki was palpable to those who recall seeing them perform together.</p>\n<p>But by March 1975, something seemed to have come to a head, and the Lahavs abruptly left the U.S. to return to their native Israel, never to return.</p>\n<p>In April, Bruce recorded the his first attempt at &#8220;Backstreets.&#8221;</p>\n<audio class=\"wp-audio-shortcode\" id=\"audio-32364-4\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://estreetshuffle.com/wp-content/uploads/2022/05/09-Backstreets.mp3?_=4\" /><a href=\"https://estreetshuffle.com/wp-content/uploads/2022/05/09-Backstreets.mp3\">https://estreetshuffle.com/wp-content/uploads/2022/05/09-Backstreets.mp3</a></audio>\n<p>That early studio take was almost certainly intended as a band rehearsal, as many of the lyrics were obviously bluffed. However, the arrangement was in its almost final form and the first verse was as complete as it would ever be, suggesting that while &#8220;Backstreets&#8221; may have evolved over time as have many of Bruce&#8217;s songs, it likely germinated from this particular seed:</p>\n<p style=\"padding-left: 40px;\"><em>One soft infested summer me and Terry became friends</em><br />\n<em>Trying in vain to breathe the fire we was born in</em><br />\n<em>Catching rides to the outskirts, tying faith between our teeth</em><br />\n<em>Sleeping in that old abandoned beach house, getting wasted in the heat</em><br />\n<em>And hiding on the backstreets, hiding on the backstreets</em><br />\n<em>With a love so hard and filled with defeat</em><br />\n<em>Running for our lives at night on them backstreets</em></p>\n<p>(Some sources cite earlier attempts at &#8220;Backstreets,&#8221; as far back as late 1974 when the song was reportedly titled &#8220;Hidin&#8217; on the River.&#8221; If true, I suspect that version was likely radically different than what it had evolved into by April 1975.)</p>\n<p>We can forever speculate and debate whether &#8220;Backstreets&#8221; is autobiographical or even loosely based on actual people or events. What I think is indisputable is that &#8220;Backstreets&#8221; is about an adulterous relationship.</p>\n<p>I scratch my head every time I hear debates over whether Terry is a man or a woman. She is clearly a woman. While I suppose that one could choose to hear &#8220;Backstreets&#8221; as the story of a forbidden same-sex relationship (which indeed would have likely necessitated hiding in those days), if one knows and acknowledges the origin of several of its key lines in &#8220;She&#8217;s the One,&#8221; it&#8217;s difficult to make the case that this was Bruce&#8217;s intent.</p>\n<p>But in any event, &#8220;Backstreets&#8221; is obviously the story of forbidden romance. It would take a very willfully selective reading to receive it as anything but. Even Bruce hinted as much, when in his SxSW keynote in 2012, he described having based &#8220;Backstreets&#8221; on doo-wop, &#8220;the most sensual music ever made, the sound of raw sex, of silk stockings rustling on backseat upholstery, the sound of the snaps of bras popping across the U.S.A., of wonderful lies being whispered into Tabu-perfumed ears, the sound of smeared lipstick, untucked shirts, running mascara, tears on your pillow, secrets whispered in the still of the night, the high-school bleachers, and the dark at the YMCA canteen,&#8221; playing the opening lines of the song to illustrate his point.</p>\n<p>(In fairness, though, Bruce has been coy over the years when discussing &#8220;Backstreets,&#8221; often casting it in terms far less specific and romantic.)</p>\n<p>Bruce tinkered with different takes and mixes over the months that followed, at one point layering on strings (not Suki, however&#8211;she&#8217;d already left) and additional guitar overdubs.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Backstreets (Unreleased Alternative Version with Strings)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/qxaU7el7_IU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>On July 18th&#8211;just two days before the <em>Born to Run </em>tour kicked off and barely a month before the album would reach record store shelves, the final take of &#8220;Backstreets&#8221; was recorded, mixed and committed to the album, making &#8220;Backstreets&#8221; one of the very last <em>Born to Run </em>songs to be completed.</p>\n<p>It was worth the wait.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Backstreets\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/USQ697oqkaw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>&#8220;Backstreets&#8221; is rarely mentioned when discussing Bruce&#8217;s more cinematic songwriting, and yet from its opening bars it plays like an epic and tragic romance, with a forty-nine-second overture that I would argue ranks as his best ever, even on an album that includes both &#8220;Jungleland&#8221; and &#8220;Thunder Road.&#8221; It&#8217;s certainly one of Roy Bittan&#8217;s finest moments on record, forever after establishing himself as a core component of the E Street sound.</p>\n<p>An entire boy-meets-girl story unfolds in that first wordless minute. If we close our eyes and feel the music, we can see our narrator and Terry as they introduce themselves to each other in the first fifteen seconds, explore each other in the next twenty, draw intimately close for a first kiss in the next ten, before the rest of the E Street Band finally explodes into the scene as the curtains draw back and our story begins in earnest.</p>\n<p style=\"padding-left: 40px;\"><em>One soft infested summer&#8230;</em></p>\n<p>I&#8217;m not sure I&#8217;ve ever paused to analyze only four words into a song, but <em>come on. </em>How incredible is that phrase? If you have ever spent even a single sticky summer in New Jersey, you know just how on point that phrase is: <em>one soft infested summer</em>. No one has described it better before or since.</p>\n<p>Let&#8217;s continue:</p>\n<p style=\"padding-left: 40px;\"><em>One soft infested summer, me and Terry became friends</em><br />\n<em>Trying in vain to breathe the fire we was born in</em><br />\n<em>Catching rides to the outskirts, tying faith between our teeth</em><br />\n<em>Sleeping in that old abandoned beach house, getting wasted in the heat</em><br />\n<em>And hiding on the backstreets, hiding on the backstreets</em><br />\n<em>With a love so hard and filled with defeat</em><br />\n<em>Running for our lives at night on them backstreets</em></p>\n<p>As I wrote earlier, this verse is the one piece of &#8220;Backstreets&#8221; that was complete from its earliest takes, and it establishes our characters&#8217; circumstances from the get-go: A summer romance, a forbidden love born from a spark of passion. (Fire is a common metaphor for passion.) A one-time encounter that our couple couldn&#8217;t allow to remain one-time. But where do you go to be alone with someone who&#8217;s already spoken for?</p>\n<p>You hide.</p>\n<p>You flee to the outskirts, the abandoned beach house. The backstreets.</p>\n<p>You go where you won&#8217;t be seen, or where if you&#8217;re seen you at least won&#8217;t be recognized. You go even if&#8211;or <i>especially</i> if&#8211;you know the romance is doomed from the start, filled with defeat.</p>\n<p>You run for your lives each night, because only together on those backstreets do you <em>feel</em> alive.</p>\n<p style=\"padding-left: 40px;\"><em>Slow dancing in the dark on the beach at Stockton&#8217;s Wing</em><br />\n<em>Where desperate lovers park we sat with the last of the Duke Street Kings</em><br />\n<em>Huddled in our cars waiting for the bells that ring</em><br />\n<em>In the deep heart of the night when you let loose of everything</em><br />\n<em>To go running on the backstreets, running on the backstreets</em><br />\n<em>Terry you swore we&#8217;d live forever</em><br />\n<em>Taking it on them backstreets together</em></p>\n<p>(I normally recommend not obsessing over the location of the locales that populate Bruce&#8217;s songs. It distracts from the film when we focus on the set. That said, if you like putting pins in the map, consider taking a ride down south to Stockton University (known in 1975 as Stockton State College) in Galloway,  about an hour&#8217;s drive from Asbury Park&#8211;far enough to keep the odds of running into someone you know pretty low. There&#8217;s a beach on Lake Fred, right across from the school&#8217;s wings.)</p>\n<p><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" data-attachment-id=\"34660\" data-permalink=\"https://estreetshuffle.com/index.php/2022/05/14/roll-of-the-dice-backstreets/stockton/#main\" data-orig-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/stockton.jpg?fit=1781%2C1345&amp;ssl=1\" data-orig-size=\"1781,1345\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;Ken Rosen&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"stockton\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/stockton.jpg?fit=300%2C227&amp;ssl=1\" data-large-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/stockton.jpg?fit=758%2C572&amp;ssl=1\" class=\"alignnone size-full wp-image-34660\" src=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/stockton.jpg?resize=758%2C572&#038;ssl=1\" alt=\"\" width=\"758\" height=\"572\" srcset=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/stockton.jpg?w=1781&amp;ssl=1 1781w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/stockton.jpg?resize=300%2C227&amp;ssl=1 300w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/stockton.jpg?resize=1024%2C773&amp;ssl=1 1024w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/stockton.jpg?resize=768%2C580&amp;ssl=1 768w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/stockton.jpg?resize=1536%2C1160&amp;ssl=1 1536w\" sizes=\"auto, (max-width: 758px) 100vw, 758px\" /></p>\n<p>(Or maybe it&#8217;s just a made-up place.)</p>\n<p>The summer passes, as summers do, and our lovers grow weary of hiding and disguising.</p>\n<p style=\"padding-left: 40px;\"><em>Endless juke joints and Valentino drag</em><br />\n<em>Where dancers scraped the tears up off the street dressed down in rags</em><br />\n<em>Running into the darkness, some hurt bad some really dying</em><br />\n<em>At night sometimes it seemed you could hear that whole damn city crying</em><br />\n<em>Blame it on the lies that killed us, blame it on the truth that ran us down</em><br />\n<em>You can blame it all on me Terry, it don&#8217;t matter to me now</em><br />\n<em>When the breakdown hit at midnight there was nothing left to say</em><br />\n<em>But I hated him and I hated you when you went away</em></p>\n<p>Once again, Bruce packs the heart of his song into its bridge. <em>Blame it on the lies that killed us, blame it on the truth that ran us down. </em>Dishonesty will eat at you from the inside, and you can&#8217;t run from the truth forever. It will catch up.</p>\n<p>And at metaphorical midnight, it does. The end of the day, and the end of a friendship. When the truth catches up, Terry chooses her husband, and like Suki and Louis, they vanish.</p>\n<p>We travel back in time now, to our lovers&#8217; last night together.</p>\n<p style=\"padding-left: 40px;\"><em>Now laying here in the dark, you&#8217;re like an angel on my chest</em><br />\n<em>Just another tramp of hearts crying tears of faithlessness</em><br />\n<em>Remember all the movies, Terry, we&#8217;d go see</em><br />\n<em>Trying to learn how to walk like the heroes we thought we had to be</em><br />\n<em>Well after all this time to find we&#8217;re just like all the rest</em><br />\n<em>Stranded in the park and forced to confess</em><br />\n<em>To hiding on the backstreets, hiding on the backstreets</em><br />\n<em>Well we swore forever friends</em><br />\n<em>On the backstreets until the end</em></p>\n<p>There&#8217;s irony, of course, in <em>tears of faithlessness</em>. Is Terry crying over our narrator, or over her husband? The phrase works regardless. They&#8217;d spent the summer convincing themselves they were the leads in an epic romance film, forever friends even if only in hiding, but the end came sooner than they imagined. When the cameras stop and the lights come up, they&#8217;re forced to admit they were doomed from the start&#8230; just like all the rest.</p>\n<p>When <em>Born to Run </em>first came out to mostly rave reviews, &#8220;Backstreets&#8221; was often an exception, with critics making fun of Bruce for repeating the phrase <em>hiding on the backstreets</em> more than two dozen times during the song&#8217;s final two minutes. But it wasn&#8217;t bloat, and it wasn&#8217;t excess. As our narrator leaves behind that final tender moment, what lasts in his memory is the hiding&#8211;the constant hiding, and the constant lying. It crowds out even the good memories and leaves only the bitter ones, and as the song winds down he can only perseverate.</p>\n<p>Whether or not Bruce really did have a romance with Suki, the Lahavs divorced two years after they left Bruce&#8217;s employ.</p>\n<p>Affairs rarely work out well for those involved. Unless they do, that is, but if &#8220;Backstreets&#8221; is autobiographical, Bruce had only discovered the rule. He was still many years away from discovering the exception.</p>\n<hr />\n<p>&#8220;Backstreets&#8221; made its concert premiere very early in the Born to Run Tour and immediately became a powerful nightly highlight.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Backstreets (Live at the Hammersmith Odeon, London &#039;75)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/YnNnYjlF1Us?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>It remained a staple of Bruce&#8217;s setlists for years afterward, and as with many of Bruce&#8217;s best songs, &#8220;Backstreets&#8221; grew in scope and power with every performance. Before long, Bruce created some breathing room before the coda and filled it with reminiscence that bordered on performance art.</p>\n<p>On some nights, he appeared to be lost in memory and reverie&#8230;</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen &amp; The E Street Band - Backstreets (Live in Houston, 1978)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/O_hZZQPukBc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>&#8230;and on other nights, he relived and relieved his narrator&#8217;s betrayal with cathartic emotional outbursts.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Backstreets (Live at the Palace Theatre, Albany, NY - 02/07/77 - Official Audio)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/7PHB5KdZ5P0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Some nights he&#8217;d preview lyrics for songs he&#8217;d not yet recorded&#8230;</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Springsteen Backstreets w/Drive All Night - Live Winterland 1978\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/am3jkZiQmQE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>&#8230;.and other nights he&#8217;d quote favorite songs by other artists.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen ‐ Backstreets (Fenway Park, Boston 2012)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/8Wx1bEvMIQI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>But even played straight, every performance of &#8220;Backstreets&#8221; feels like an event to anyone fortunate enough to be in the room for it.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen &amp; The E Street Band - Backstreets (Live in New York City)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/eGDFavEBn0Q?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>From the day it debuted, &#8220;Backstreets&#8221; has never missed an E Street Band Tour, and it likely never will. It remains a fan favorite&#8211;so much so that the unofficial fan magazine and community site for Springsteen fans was named after it.</p>\n<p>To date, Bruce has performed &#8220;Backstreets&#8221; an even 500 times. Let&#8217;s hope we get to celebrate a few more centennials.</p>\n<p><strong>Update 1/3/2024: </strong>On his World Tour in 2023, Bruce recontextualized &#8220;Backstreets&#8221; as a tribute to his fallen former bandmate, George Theiss. Each night, Bruce offered a heartfelt mid-song remembrance, but (at least for me, and I seem to be in the minority) it felt jarringly out of place in the middle of this particular song. Judge for yourself below.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - &quot;Backstreets&quot; (Live 4K HQ Audio) - Amalie Arena Tampa February 1, 2023\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/Biq_yBwQPnA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Bonus: </strong>Although &#8220;Backstreets&#8221; functions best as a full-band showcase, on rare occasion Bruce has performed it solo. Here&#8217;s one of those solo piano performances from his 2005 acoustic tour.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Backstreets (Live 2005 solo piano)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/NLmxhx4Zo0o?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Backstreets<br />\nRecorded:</strong> July 18, 1975<br />\n<strong>Released: </strong><em>Born to Run </em>(1975)<br />\n<strong>First performed:</strong> August 8, 1975 (Akron, OH)<br />\n<strong>Last performed:</strong> September 3, 2023 (East Rutherford, NJ)</p>\n<p>Looking for your favorite Bruce song? Check our <a href=\"https://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">full index</a>. New entries every week!</p>\n", "protected": false}, "excerpt": {"rendered": "<p>A forbidden love leads to a bitter betrayal in one of Bruce&#8217;s most powerful epics.</p>\n", "protected": false}, "author": 1, "featured_media": 34038, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [1065, 303, 713, 443], "class_list": ["post-32364", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-backstreets", "tag-born-to-run", "tag-shes-the-one", "tag-suki-lahav"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/04/city-street-night-car-cobblestone-urban-525290-wallhere.com_.jpg?fit=1400%2C1050&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-8q0", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 56114, "url": "https://estreetshuffle.com/index.php/2025/03/09/kingdom-of-days-march-9-2/", "url_meta": {"origin": 32364, "position": 0}, "title": "Kingdom of Days: March 9", "author": "Ken", "date": "March 9, 2025", "format": false, "excerpt": "On this date: Jake Clemons' debut E Street Band performance and Suki Lahav's final one.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/apollo.jpg?fit=1024%2C1024&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/apollo.jpg?fit=1024%2C1024&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/apollo.jpg?fit=1024%2C1024&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/apollo.jpg?fit=1024%2C1024&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 18900, "url": "https://estreetshuffle.com/index.php/2020/07/03/cover-me-i-want-you/", "url_meta": {"origin": 32364, "position": 1}, "title": "Cover Me: I Want You", "author": "Ken", "date": "July 3, 2020", "format": false, "excerpt": "Suki Lahav's tenure in the E Street Band was all too short, but her brief, prominent presence elevated Bruce's performance--most notably in the pair's stunning spotlight cover of Bob Dylan's \"I Want You.\"", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/iwantyou.jpg?fit=550%2C550&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/iwantyou.jpg?fit=550%2C550&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/iwantyou.jpg?fit=550%2C550&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 389, "url": "https://estreetshuffle.com/index.php/2018/01/23/cover-me-spanish-harlem/", "url_meta": {"origin": 32364, "position": 2}, "title": "Cover Me: &#8220;Spanish Harlem&#8221;", "author": "Ken", "date": "January 23, 2018", "format": false, "excerpt": "Soaring vocals, gorgeous harmonies, and Suki Lahav's violin carry this beautiful cover of \"Spanish Harlem\" by Bruce Springsteen and the E Street Band.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/spanish-harlem.jpg?fit=355%2C355&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 55859, "url": "https://estreetshuffle.com/index.php/2025/02/06/kingdom-of-days-february-6-2/", "url_meta": {"origin": 32364, "position": 3}, "title": "February 6", "author": "Ken", "date": "February 6, 2025", "format": false, "excerpt": "Great E Street Band footage from 1975, a guest appearance with Steve Earle from 1998, a James Taylor cover from 2006, and a tribute to Bob Dylan in 2015--all from this date in Bruce Springsteen history.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/widener-2.jpg?fit=803%2C548&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/widener-2.jpg?fit=803%2C548&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/widener-2.jpg?fit=803%2C548&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/widener-2.jpg?fit=803%2C548&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 61047, "url": "https://estreetshuffle.com/index.php/2025/10/04/kingdom-of-days-october-4-2/", "url_meta": {"origin": 32364, "position": 4}, "title": "Kingdom of Days: October 4", "author": "Ken", "date": "October 4, 2025", "format": false, "excerpt": "Suki Lahav and \"She's the One\" make their debut on the same night, the Rising Tour wraps up, and Bruce kicks off a mini-tour with Barack Obama. Much more inside.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/20081004_front.jpg?fit=1200%2C974&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/20081004_front.jpg?fit=1200%2C974&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/20081004_front.jpg?fit=1200%2C974&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/20081004_front.jpg?fit=1200%2C974&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/20081004_front.jpg?fit=1200%2C974&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 55858, "url": "https://estreetshuffle.com/index.php/2025/02/05/kingdom-of-days-february-5-2/", "url_meta": {"origin": 32364, "position": 5}, "title": "February 5", "author": "Ken", "date": "February 5, 2025", "format": false, "excerpt": "Check out a rare TV profile from 1985, a pro-shot \"Kitty's Back\" from 2014, and highlights from the spectacular 1975 Main Point show featuring work-in-progress versions of songs that would appear on Born to Run.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/02/19750205_5_front.jpg?fit=942%2C944&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/02/19750205_5_front.jpg?fit=942%2C944&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/02/19750205_5_front.jpg?fit=942%2C944&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/02/19750205_5_front.jpg?fit=942%2C944&ssl=1&resize=700%2C400 2x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/32364", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=32364"}], "version-history": [{"count": 32, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/32364/revisions"}], "predecessor-version": [{"id": 47658, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/32364/revisions/47658"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/34038"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=32364"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=32364"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=32364"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}