{"id": 29798, "date": "1984-01-13T11:00:00", "date_gmt": "1984-01-13T19:00:00", "guid": {"rendered": "https://estreetshuffle.com/?p=29798"}, "modified": "2026-02-18T14:47:41", "modified_gmt": "2026-02-18T22:47:41", "slug": "roll-of-the-dice-dancing-in-the-dark", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/1984/01/13/roll-of-the-dice-dancing-in-the-dark/", "title": {"rendered": "Dancing in the Dark"}, "content": {"rendered": "<blockquote><p><span style=\"font-size: 14pt;\">&#8220;Jon [Landau] had been bothering me to write a single, which is something he rarely does. But he did that day. And he wanted something <em>direct.</em> That seemed to be what he was hitting on me for at the time. I was angry. I had written a lot of songs and was kind of fed up with the whole thing. We&#8217;d been making the record for a long time and I was bored with the whole situation.</span></p>\n<p>&nbsp;</p>\n<p><span style=\"font-size: 14pt;\">That particular night I came home and sat on the edge of my bed and the thing I remember thinking first was that we had a record, but it wasn&#8217;t necessarily finished; I could change the whole thing right now if I wanted to.</span></p>\n<p>&nbsp;</p>\n<p><span style=\"font-size: 14pt;\">That&#8217;s all I remember thinking: if I wanted to I could do something right now that would change the whole thing&#8230;&#8221;  <em>&#8211;Bruce Springsteen to Bill Flanagan, April 1987</em></span></p></blockquote>\n<p>The next time you&#8217;re stuck in a rut, take a lesson from Bruce Springsteen. He changed the whole thing, and his life would never be the same again.</p>\n<p>In the early months of 1984, Bruce felt stuck in a <em>serious</em> rut.</p>\n<p>He&#8217;d been working on his latest album for more than two years, and he was so close to the end that he could taste it. He&#8217;d written and recorded more than seventy songs (some sources suggest as much as 86) and after countless debates and Sophie&#8217;s choices he&#8217;d finally whittled them down to eleven.</p>\n<p>But his manager wasn&#8217;t satisfied. Jon Landau knew that this could be the album to catapult his client from stardom to immortality, but it was missing one important component: a hit single.</p>\n<p>As it would turn out, the album already had six of them, but none of them had the potential to make it all the way to #1. And they needed a Number One to ignite the rocket they knew they were sitting on.</p>\n<p>So Landau goaded an exhausted Bruce into writing just one more song, and while he was not at all happy about it (&#8220;You want another one,&#8221; he spat at Landau, &#8220;<em>you</em> write it!&#8221;) he went home and sat on the edge of his bed, thought for a few moments&#8230; and decided to change the whole thing.</p>\n<p>And he did it in the most calculatedly passive-aggressive way possible: by writing meta lyrics about how sick and tired he was of working on the album and grafting them onto a backing track modeled after two of the previous year&#8217;s most commercial pop successes&#8211;the metronomic percussion of Michael Jackson&#8217;s &#8220;Beat It&#8221; (another Landau contribution via a suggestion to Max Weinberg) and the muted riff of The Police&#8217;s #1 smash, &#8220;Every Breath You Take.&#8221;</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/oRdxUFDoQe0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/OMOGaugKpzs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>And because he&#8217;s Bruce Springsteen, it worked.</p>\n<p>In one of the most ironic successes in rock history, &#8220;Dancing in the Dark&#8221; became Bruce&#8217;s all-time greatest hit (although it was denied the top spot by Prince&#8217;s stubbornly splendid &#8220;When Doves Cry&#8221;), breaking through and connecting to new listeners with lyrics about how alienated and detached the artist was from his art.</p>\n<p>His opening verse takes its inspiration from John Prine&#8217;s 1971 classic, &#8220;Angel From Montgomery.&#8221;  In Prine&#8217;s song about a middle-aged woman intensely dissatisfied with her life, her marriage, and her unrealized dreams, she voices her frustration about her husband, a &#8220;child who&#8217;s grown old&#8221;:</p>\n<p style=\"padding-left: 40px;\"><em>How the hell can a person</em><br />\n<em>Go to work in the morning</em><br />\n<em>Then come home in the evening</em><br />\n<em>And have nothing to say?</em></p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/U6cagWYTGCY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>Bruce started with Prine&#8217;s lyrics about life passing you by while you sit around getting older, but quickly realized they didn&#8217;t ring true. He was a rock star, after all, and rock stars do <em>not</em> go to work in the morning. They go to work at night. So he inverted the conceit, and he was off to the races.</p>\n<p style=\"padding-left: 40px;\"><em>I get up in the evening and I ain&#8217;t got nothing to say</em><br />\n<em>I come home in the morning, I go to bed feeling the same way</em><br />\n<em>I ain&#8217;t nothing but tired, man I&#8217;m just tired and bored with myself</em><br />\n<em>Hey there baby, I could use just a little help</em></p>\n<p>Bruce takes Prine&#8217;s notion a step further. It&#8217;s not just that he has nothing to say at home; he&#8217;s got nothing to say at work, either. He&#8217;s blocked, jaded, bored, tired. (Let&#8217;s not even pretend we&#8217;re listening to a fictional narrator here; this is straight up Bruce.) And like Prine&#8217;s protagonist, he&#8217;s resentful for being stuck in a trap of his own making. He&#8217;d written dozens of songs, and his well is dry.</p>\n<p>He&#8217;s just <em>done</em>.</p>\n<p style=\"padding-left: 40px;\"><em>You can&#8217;t start a fire, you can&#8217;t start a fire without a spark</em><br />\n<em>This gun&#8217;s for hire even if we&#8217;re just dancing in the dark</em></p>\n<p>This is a dark chorus. Channeling his inner frustration, Bruce casts about looking for inspiration. Won&#8217;t anybody give him some?</p>\n<p>But it&#8217;s also a stroke of brilliance, because as personal as the song is, its title metaphor makes the song universally relatable: &#8220;Dancing in the dark&#8221; is an idiom for sex, and pairing it with a phallic gun-for-hire makes the song resonate about a different kind of frustration. Who hasn&#8217;t felt that need for connection, even if it&#8217;s just fleeting and physical?</p>\n<p>It&#8217;s a neat trick, and for what I&#8217;m sure was at least 99% of Bruce&#8217;s audience, it managed to mask the alienation that had taken root within him. <em>This gun&#8217;s for hire even if we&#8217;re just dancing in the dark. Sure, Jon, I&#8217;ll write whatever the hell you tell me to. Doesn&#8217;t mean anything anyway. </em></p>\n<p>&#8220;Making a record tends to be a lot of mind work,&#8221; Bruce told Flanagan in that same interview. &#8220;Sometimes I like that, but I&#8217;m also oriented toward doing things and playing. How many times can you look at the same thing from a different angle? On one hand, the analytical side of my personality has been very helpful in learning, because I always question what I&#8217;m doing and look at it from every possible position, and then I change it. I&#8217;ll do that for a long time and then I&#8217;ll swing toward a tour that&#8217;ll go for a year and a half and I&#8217;m out there going crazy every night, and then I&#8217;ll swing way back. I&#8217;ve never really balanced those things in a natural fashion.&#8221;</p>\n<p>Bruce was ready to swing toward a tour when he wrote &#8220;Dancing in the Dark.&#8221; The action wasn&#8217;t in his head anymore, it was out there&#8230; <em>somewhere</em>. And he was going stir crazy trying to get there.</p>\n<p style=\"padding-left: 40px;\"><em>Message just keep getting clearer, radio&#8217;s on and I&#8217;m moving &#8217;round my place</em><br />\n<em>I check my look in the mirror, I wanna change my clothes, my hair, my face</em><br />\n<em>Man, I ain&#8217;t getting nowhere, I&#8217;m just living in a dump like this</em><br />\n<em>There&#8217;s something happening somewhere, baby I just know that there is</em></p>\n<p>Many if not most critics read those lines as Bruce revealing insecurities about his appearance. I think that&#8217;s too shallow a read, although I certainly think Bruce chose that metaphor deliberately.</p>\n<p>This verse is about a rock star trying to finish an album while pop culture moves on without him. Bruce&#8217;s songs are an extension of himself, and his albums are personal statements&#8211;like his reflection in the mirror. His endless fidgeting with them reveals as much insecurity as if he was obsessing over his clothes, his hair, his face.</p>\n<p>He was getting nowhere with his endless tinkering. He needed to finish the job and get out on the road, where at least something was happening.</p>\n<p style=\"padding-left: 40px;\"><em>You sit around getting older, there&#8217;s a joke here somewhere and it&#8217;s on me</em><br />\n<em>I&#8217;ll shake this world off my shoulders, come on baby this laugh&#8217;s on me</em></p>\n<p>The bridge holds the song&#8217;s turning point: fully aware that the world is moving on without him while he waffles with his album, he summons the will to&#8230; let it go. He shakes it it off his shoulders and accepts that it&#8217;s long past time for him to have done so.</p>\n<p>From this point forward, &#8220;Dancing in the Dark&#8221; is about action rather than inaction.</p>\n<p style=\"padding-left: 40px;\"><em>Stay on the streets of this town and they&#8217;ll be carving you up alright</em><br />\n<em>They say you gotta stay hungry, hey baby, I&#8217;m just about starving tonight</em><br />\n<em>I&#8217;m dying for some action, I&#8217;m sick of sitting &#8217;round here trying to write this book</em><br />\n<em>I need a love reaction, come on now baby gimme just one look</em></p>\n<p style=\"padding-left: 40px;\"><em>You can&#8217;t start a fire sitting &#8217;round crying over a broken heart</em><br />\n<em>This gun&#8217;s for hire even if we&#8217;re just dancing in the dark</em><br />\n<em>You can&#8217;t start a fire worrying about your little world falling apart</em><br />\n<em>This gun&#8217;s for hire even if we&#8217;re just dancing in the dark</em><br />\n<em>Even if we&#8217;re just dancing in the dark</em></p>\n<p>It was time for Bruce to move forward. The album was done. He had no appetite for any more work on that &#8220;book.&#8221; What he did hunger for was some action. A love reaction: the stage, the arena.</p>\n<p>The final lines of &#8220;Dancing in the Dark&#8221; abandon the personal and embrace the universal. We&#8217;re in Springsteen country now, with Bruce offering &#8220;Two Hearts&#8221;-style pep talks to offscreen characters. We might choose to read this as a lazy, cliched ending, but it&#8217;s not. Well, okay it is, but also it&#8217;s not. Landau asked him to write a hit Springsteen single, and so he did. It&#8217;s the only way he <em>could</em> have ended it.</p>\n<p>It was more calculatedly commercial than anything he&#8217;d ever written before, and it appalled his best friend and now former bandmate Little Steven, who urged him to reconsider its inclusion. Luckily, Stevie lost that argument, and &#8220;Dancing in the Dark&#8221; became a hit right out of the gate. It was released on May 9, 1984, almost a month before <em>Born in the U.S.A. </em>hit record store shelves. By the end of the month, it had already cracked the Top 40 at #36; by the first week of June it had climbed to #18 and showed no signs of stopping.</p>\n<p>With new heights of success staring them in the face, Springsteen and Landau knew they had to do something they&#8217;d never done before: make a music video. A <em>real </em>music video. Not a depressing, washed-out travelogue like they&#8217;d made for &#8220;Atlantic City&#8221; (which Bruce didn&#8217;t even appear in), or a live promotional video like they&#8217;d made for even earlier performances, but an honest-to-goodness MTV video with a plot and all.</p>\n<p>In the years since Bruce&#8217;s last big album and tour, MTV had arrived, and Bruce recognized its importance in growing his audience.  &#8220;Little kids, seven or eight, come up to me &#8217;cause they&#8217;ve seen the &#8216;Dancing in the Dark&#8217; video,&#8221; Bruce would tell interviewers Roger Scott and Patrick Humphries in <em>Hot Press</em> that November. &#8220;And those people can&#8217;t go to shows. They&#8217;re too young. They have no visual access to rock -and-roll music. Those are the kids that are glued to MTV.&#8221;</p>\n<p>But Bruce&#8217;s first attempt at a real video was a bit on-the-nose. He&#8217;d hired director Jeff Stein and cinematographer Daniel Pearl (whose biggest claim to fame at the time was helming the photography for &#8220;<a href=\"https://estreetshuffle.com/index.php/2019/04/07/matr-sting-and-bruce-springsteen-every-breath-you-take/\">Every Breath You Take</a>,&#8221; one of the influences for &#8220;Dancing in the Dark&#8221;), and their vision for the video was Bruce dancing&#8230; in the dark.</p>\n<p>Here&#8217;s that completed but never released original video.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/vh8NQo1p5sA?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>Bruce was not happy with the way that turned out, and even without the benefit of hindsight, it&#8217;s easy to see why.</p>\n<p>To add insult to injury, not only did the video escape into the bootleg wild, but so did video footage of Bruce and Clarence practicing their moves at home. Watch if you like, but be prepared to cringe.</p>\n<p><iframe title=\"VideoPress Video Player\" aria-label='VideoPress Video Player' width='758' height='569' src='https://videopress.com/embed/X0n4ro1l?hd=0&amp;cover=1' frameborder='0' allowfullscreen allow='clipboard-write'></iframe><script src='https://v0.wordpress.com/js/next/videopress-iframe.js?m=1770107250'></script></p>\n<p>Bruce fired Stein and Pearl and hired up-and-coming director Brian DePalma instead, fresh off a run of popular and critically acclaimed films. Together, they came up with a new concept, a wish-fulfillment fantasy that every Springsteen fan could relate to.</p>\n<p>In a new video that wouldn&#8217;t be released until after &#8220;Dancing in the Dark&#8221; had already crested one spot shy of the top of the Hot 100, a young girl played by an unknown actress gazes adoringly at her idol while he performs (lipsyncs, actually) on stage, only for them to make eye contact toward the end of the song. In a moment that thrilled viewers worldwide and set a precedent forever after, Bruce invites the girl on stage, and they dance&#8211;awkwardly but charmingly.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/129kuDCQtHs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>The young girl, of course, was actress Courtney Cox, and &#8220;Dancing in the Dark&#8221; was her on-screen breakthrough. But there were obviously a lot of other people at that performance, too.</p>\n<p>DePalma skillfully crafted the video using a blend of staged footage and real Springsteen concerts. A couple of years ago, I had the chance to connect with a couple of fans who were part of that original video shoot with Cox and hear their fascinating accounts of what it was like on the set for that iconic video. You can read their stories in <em>Kingdom of Days: Volume Six: June</em>.</p>\n<p>The song had already crested on the Hot 100, but the video took off like wildfire, becoming one of MTV&#8217;s most popular and best-remembered videos. Before long, Bruce found himself recognized by a new audience, and a younger one. &#8220;I was down at the beach,&#8221; he told Scott and Humphries, &#8220;[and] this little kid called Mike was about eight came up to me and said, &#8216;You want me to show you my &#8216;Dancing in the Dark&#8217; moves?&#8217; [Laughs] So I said okay.&#8221;</p>\n<p>Fans had good reason to practice those moves: from the very beginning, Bruce was likely to pull a lucky fan on stage during &#8220;Dancing in the Dark,&#8221; and once word got out, fans were practicing their moves all over the world.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/IbvcLQSzPi8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/sfk0uMLhXqY?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>In the meantime, while Bruce was filling arenas and stadiums, &#8220;Dancing in the Dark&#8221; was picking up awards. First, it won for Best Single at the American Music Awards in January 1985. Then he won a Grammy (his first ever) for Best Rock Vocal Performance, and the Best Stage Performance in a Video award at the VMAs.</p>\n<p><iframe title=\"VideoPress Video Player\" aria-label='VideoPress Video Player' width='758' height='426' src='https://videopress.com/embed/hYRH5uew?hd=0&amp;cover=1' frameborder='0' allowfullscreen allow='clipboard-write'></iframe><script src='https://v0.wordpress.com/js/next/videopress-iframe.js?m=1770107250'></script></p>\n<p><em>Rolling Stone</em> readers voted &#8220;Dancing in the Dark&#8221; Single of the Year, and the magazine enshrined it as one of the 500 Songs That Shaped Rock and Roll. And while it didn&#8217;t make it all the way to the top of the chart in America, it did in Belgium and The Netherlands, and it was the Number One song of the year in Australia.</p>\n<p>&#8220;Dancing in the Dark&#8221; got serious airplay at the dance clubs too, thanks to extended remixes produced by the legendary Arthur Baker. The remixes landed Bruce in the Top 10 on the Billboard Hot Dance Music/Club Play chart&#8211;territory no one could have ever predicted Bruce claiming&#8211;and became the best-selling twelve-inch single in 1984.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/gX5ljyECT0E?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>&#8220;Dancing in the Dark&#8221; was an unparalleled success for Bruce. Never before or again would he have a hit anywhere near that magnitude, although a few other tracks from <em>Born in the U.S.A. </em>seemed determined to give it a run for its money.</p>\n<p>There was only one problem with Bruce&#8217;s greatest hit: it was incredibly dated. You can&#8217;t get more than a few seconds into it without being transported immediately back to the 80s, and as the eighties faded into the rear-view mirror, it seemed like &#8220;Dancing in the Dark&#8221; was destined to go with them, an artifact of its time, inseparable from its synthy sound.</p>\n<p>Bruce tried playing it acoustically as early as 1986, but in his struggle to find a fresh arrangement, he just recreated the original, with Danny Federici&#8217;s accordion standing in for The Big Man&#8217;s saxophone.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/RjT-Rk-o7zM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>Bruce tried a few other arrangements over the years, but none worked well enough to lift &#8220;Dancing in the Dark&#8221; beyond cameo status. As late as the Reunion Tour, he was still experimenting, this time with a country-ish arrangement that rollicks more than it rocks.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/M_XKihvL2ZU?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>Early on in the Rising Tour, he finally hit on an arrangement that worked, dialing back the synth, amping up the wall of guitars in the bigger, brawnier post-Reunion E Street Band, taking it uptempo, and transforming &#8220;Dancing in the Dark&#8221; into a modern rocker that&#8217;s familiar enough to tug nostalgically at his older fans&#8217; heartstrings while his younger ones pogo with abandon.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/R0Dk_LuD5d8?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>Once the new &#8220;Dancing in the Dark&#8221; earned its place in Bruce&#8217;s encore set, it rarely left it. Ever since, fans know that if they attend an E Street Band show, there are two songs they are guaranteed to hear in the encores: &#8220;Born to Run&#8221; and &#8220;Dancing in the Dark.&#8221;</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/hadKa4CV1Wg?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/x7lfzARGXGw?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>Bruce even found an acoustic arrangement that worked, securing his greatest hit a berth in his Broadway show and acoustic benefit performances.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/rWad2yy2W2o?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>And as for those dance moves that inspired a generation&#8230;</p>\n<p>They inspired another. And then another.</p>\n<p>To this day, when Bruce hits the road with the E Street Band, there&#8217;s guaranteed to be a fan or two (or a dozen) on stage with them at the end of the night, dancing with abandon. And as the artist gets older, the dancers get younger&#8211;a fact that must certainly delight a songwriter and performer thinking hard about his legacy.</p>\n<div id=\"v-v4n1R752-1\" class=\"video-player\"><iframe title='VideoPress Video Player' aria-label='VideoPress Video Player' width='758' height='426' src='https://videopress.com/embed/v4n1R752?hd=1&amp;cover=1&amp;loop=0&amp;autoPlay=0&amp;permalink=1&amp;muted=0&amp;controls=1&amp;playsinline=0&amp;useAverageColor=0&amp;preloadContent=metadata' frameborder='0' allowfullscreen data-resize-to-parent=\"true\" allow='clipboard-write'></iframe><script data-jetpack-boost=\"ignore\" src='https://s0.wp.com/wp-content/plugins/video/assets/js/next/videopress-iframe.js'></script></div>\n<p>(Thanks, Sandy, for that video!)</p>\n<p>With luck, Bruce and the E Street Band will be back out on the road next year, and when they do, you can bet that night after night there will be dancing in the dark.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/g_9_r4r4nFI?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p><strong>Dancing in the Dark<br />\nRecorded:</strong> February 14 &#8211; March 8, 1984<br />\n<strong>Released: </strong><em>Born in the U.S.A. </em>(1984), <em>Greatest Hits </em>(1995), <em>The Essential Bruce Springsteen</em> (2003)<br />\n<strong>First performed:</strong> May 26, 1984 (Asbury Park, NJ)<br />\n<strong>Last performed:</strong> July 3, 2025 (Milan, Italy)</p>\n<p>© December 25, 2021</p>\n", "protected": false}, "excerpt": {"rendered": "<p>A last-minute addition to Born in the U.S.A. provided Bruce with his greatest hit and the rocket fuel for his best-selling album.</p>\n", "protected": false}, "author": 1, "featured_media": 31735, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3611, 3], "tags": [2237, 187], "class_list": ["post-29798", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-bitusa", "category-roll-of-the-dice", "tag-born-in-the-u-s-a", "tag-dancing-in-the-dark"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/12/dancing-scaled.jpg?fit=2560%2C1684&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-7KC", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 13189, "url": "https://estreetshuffle.com/index.php/2019/09/28/cover-me-the-cash-cows-dancing-in-the-dark/", "url_meta": {"origin": 29798, "position": 0}, "title": "Cover Me, The Cash Cows: Dancing in the Dark", "author": "Ken", "date": "September 28, 2019", "format": false, "excerpt": "There are a lot of “Dancing in the Dark” covers out there, but none quite like this one.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/cashcows.jpg?fit=1200%2C800&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/cashcows.jpg?fit=1200%2C800&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/cashcows.jpg?fit=1200%2C800&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/cashcows.jpg?fit=1200%2C800&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/cashcows.jpg?fit=1200%2C800&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 17892, "url": "https://estreetshuffle.com/index.php/2020/05/02/cover-me-lucca-lazaro-dancing-in-the-dark/", "url_meta": {"origin": 29798, "position": 1}, "title": "Cover Me, John Legend: Dancing in the Dark (remix)", "author": "Ken", "date": "May 2, 2020", "format": false, "excerpt": "Staying at home? Sheltering in place? Here's just the thing to lift your spirits: Turn up the volume and get ready to dance to Lucca Lazaro's infectious cover of Bruce Springsteen's greatest hit.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/04/lucca.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/04/lucca.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/04/lucca.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/04/lucca.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/04/lucca.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 397, "url": "https://estreetshuffle.com/index.php/2018/01/24/roll-of-the-dice-my-love-will-not-let-you-down/", "url_meta": {"origin": 29798, "position": 2}, "title": "Roll of the Dice: My Love Will Not Let You Down", "author": "Ken", "date": "January 24, 2018", "format": false, "excerpt": "Springsteen's \"My Love Will Not Let You Down\" - an introvert's inner scream", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/mylove.jpg?fit=1200%2C800&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/mylove.jpg?fit=1200%2C800&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/mylove.jpg?fit=1200%2C800&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/mylove.jpg?fit=1200%2C800&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/mylove.jpg?fit=1200%2C800&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 3492, "url": "https://estreetshuffle.com/index.php/2018/07/29/cover-me-vance-joy-dancing-in-the-dark/", "url_meta": {"origin": 29798, "position": 3}, "title": "Cover Me, Vance Joy: Dancing in the Dark", "author": "Ken", "date": "July 29, 2018", "format": false, "excerpt": "Vance Joy's gorgeously shot and sung cover of \"Dancing in the Dark\" captures the frustration and isolation at the root of Bruce's greatest hit.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/07/vance-e1532446305235.jpg?fit=700%2C394&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/07/vance-e1532446305235.jpg?fit=700%2C394&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/07/vance-e1532446305235.jpg?fit=700%2C394&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/07/vance-e1532446305235.jpg?fit=700%2C394&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 21783, "url": "https://estreetshuffle.com/index.php/2020/10/09/cover-me-boom-a-loon-dancing-in-the-dark/", "url_meta": {"origin": 29798, "position": 4}, "title": "Cover Me, BOOM a LOON: Dancing in the Dark", "author": "Ken", "date": "October 9, 2020", "format": false, "excerpt": "BOOM a LOON, Robert J. Hunter, and Eddy Smith reinvent Bruce's greatest hit with a cool funk groove.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/boomaloon.png?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/boomaloon.png?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/boomaloon.png?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/boomaloon.png?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/boomaloon.png?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 28861, "url": "https://estreetshuffle.com/index.php/2021/08/23/cover-me-round-up-dancing-in-the-dark-2/", "url_meta": {"origin": 29798, "position": 5}, "title": "Cover Me Round-Up: Dancing in the Dark (#2)", "author": "Ken", "date": "August 23, 2021", "format": false, "excerpt": "Five great, fresh takes on Bruce Springsteen's greatest hit.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/08/tomseth.jpg?fit=960%2C960&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/08/tomseth.jpg?fit=960%2C960&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/08/tomseth.jpg?fit=960%2C960&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/08/tomseth.jpg?fit=960%2C960&ssl=1&resize=700%2C400 2x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/29798", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=29798"}], "version-history": [{"count": 33, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/29798/revisions"}], "predecessor-version": [{"id": 67786, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/29798/revisions/67786"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/31735"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=29798"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=29798"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=29798"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}