{"uuid": "416c1cdc-fe99-49f1-9c0d-b87b0a7b999a", "id": 27454, "date": "1987-01-07T11:00:00", "date_gmt": "1987-01-07T19:00:00", "guid": {"rendered": "https://estreetshuffle.com/?p=27454"}, "modified": "2025-11-22T16:31:46", "modified_gmt": "2025-11-23T00:31:46", "slug": "roll-of-the-dice-tunnel-of-love", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/1987/01/07/roll-of-the-dice-tunnel-of-love/", "title": {"rendered": "Tunnel of Love"}, "content": {"rendered": "<blockquote><p><span style=\"font-size: 13pt;\">Julie was already sleeping one evening as I came to bed. There, in the darkness, the bedside lamp caught a glint of my wedding ring&#8230; . I’d never taken it off; something inside of me told me I never would, never should. I sat on the edge of the bed, gave it a light tug and watched as it slid off my finger. An ocean of despair swept over me and I felt faint. My pulse leapt and I could feel my heart threatening to push through my chest. I got up, made my way to the bathroom, ran cold water over my face and neck, then, gathering myself, beneath the bathroom’s fluorescent light, I slipped my ring back on. I walked back into the shadows of our bedroom, a room containing all my mysteries and fears, where my lovely wife lay in bed, her body just an outline, a dark, gentle ridge of tousled covers. I placed my hand upon her shoulders, moved my palm over her cheek, breathed in, felt the air return to my lungs, pulled back the sheets, climbed in and went to sleep.  &#8211; <em>Bruce Springsteen, Born to Run (2016)</em></span></p></blockquote>\n<p>Even today, it sounds unlike anything else Bruce has ever recorded. It stands apart, both from the album it lent its title to and from the rest of Bruce&#8217;s catalog.</p>\n<p>It features one of his best videos, laden with symbolism and real-life foreshadowing, and it is arguably the pinnacle of his metaphorical songwriting craft.</p>\n<p>It sports a complex soundscape, an odd but irresistible rhythm, and what I would argue are among the best backing vocals not just in Bruce&#8217;s but in <em>any</em> Top Ten song.</p>\n<p>Thirty-plus years on, &#8220;Tunnel of Love&#8221; remains one of Bruce Springsteen&#8217;s most important and revealing recordings, and it almost didn&#8217;t make the album at all.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Tunnel of Love (Official Video)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/M4K7XZGeHTE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Reports first surfaced of Bruce&#8217;s separation from Julianne Phillips, his first wife, in June 1988 after tabloid photos ran photos of Bruce and Patti in a state of undress on a hotel balcony in Rome. Phillips&#8217; spokesperson quickly confirmed the separation, but both Bruce and Julie otherwise remained tight-lipped.</p>\n<p>Today, we know their relationship was on the rocks long before. While Bruce has never explicitly addressed when he and Patti first hooked up, he&#8217;s dropped several breadcrumbs over the years. In his 2016 autobiography, Bruce wrote:</p>\n<p style=\"padding-left: 40px;\"><em>It was a September night, the moon a slim fingernail in the western sky over the silhouetted<br />\nwood that bordered the backyard&#8230;. After seventeen years of sporadically bumping into each other, then two of working side by side, somewhat flirtatiously, there came a moment when I looked at Patti and saw something different, something new, something I’d missed and hadn’t experienced before&#8230;. So, it started.</em></p>\n<p>Since Patti joined the E Street Band just a few days prior to the Born in the U.S.A. Tour in June 1984, that would put us in September 1986. Bruce continued:</p>\n<p style=\"padding-left: 40px;\"><em>At first, I told myself it was just “a thing.” It wasn’t. It was the thing. The surreptitiousness didn’t last long and I came clean to Julie as soon as I knew how serious Patti and I were&#8230; Soon I’d be separated and photographed in my tighty-whities with Patti on a balcony in Rome.</em></p>\n<p><a href=\"https://estreetshuffle.com/index.php/2021/06/15/kingdom-of-days-june-15-2/\">That paparazzi incident</a> was almost two years after Bruce and Patti first started discretely dating. If we take Bruce at his word that he came clean to Julie relatively quickly, we can assume that they separated well before the Tunnel of Love Express Tour kicked off. Indeed, Brucebase pegs the separation date in April 1987, and while I&#8217;ve never seen any other source confirm it, I&#8217;m inclined to believe it.</p>\n<p>Now, I am not one to delve into the prurient matters of one&#8217;s personal life. Even public figures are entitled to their privacy and dignity. So why piece together the chronology? Because more than any other of Bruce&#8217;s albums (with the possible exception of <em>Darkness on the Edge of Town</em>), the events of Bruce&#8217;s personal life informed Bruce&#8217;s <em>Tunnel of Love </em>songwriting, and we can best appreciate the evolution of the album and the depth of its title track if we align them with the arc of his dissolving marriage.</p>\n<p>When Bruce first started recording sessions for his next album in January 1987, the first songs he recorded were &#8220;<a href=\"https://estreetshuffle.com/index.php/2018/07/21/roll-of-the-dice-walk-like-a-man/\">Walk Like a Man</a>,&#8221; &#8220;<a href=\"https://estreetshuffle.com/index.php/2019/01/08/roll-of-the-dice-spare-parts/\">Spare Parts</a>,&#8221; and &#8220;<a href=\"https://estreetshuffle.com/index.php/2020/01/30/roll-of-the-dice-when-you-need-me/\">When You Need Me</a>,&#8221; all of which dealt with relationships, but with the exception of &#8220;Walk Like a Man&#8221; (which focused on a father and son), none seemed particularly let alone intimately autobiographical.</p>\n<p>&#8220;<a href=\"https://estreetshuffle.com/index.php/2018/04/04/roll-of-the-dice-the-honeymooners/\">The Honeymooners</a>,&#8221; &#8220;<a href=\"https://estreetshuffle.com/index.php/2018/06/23/roll-of-the-dice-the-wish/\">The Wish</a>,&#8221; and &#8220;<a href=\"https://estreetshuffle.com/index.php/2020/06/30/roll-of-the-dice-two-for-the-road/\">Two For the Road</a>&#8221; followed shortly thereafter, as Bruce continued exploring the idyllic side of romantic and familial love. By the end of February, however, Bruce&#8217;s writing (or at least his recording) started to take a more ominous turn with &#8220;<a href=\"https://estreetshuffle.com/index.php/2018/02/06/roll-of-the-dice-brilliant-disguise/\">Brilliant Disguise.</a>&#8221;</p>\n<p>Only two songs on <a href=\"https://estreetshuffle.com/index.php/2022/08/08/album-companion-tunnel-of-love/\"><em>Tunnel of Love </em></a>were recorded after the (unconfirmed) April separation date: &#8220;<a href=\"https://estreetshuffle.com/index.php/2018/08/17/roll-of-the-dice-one-step-up/\">One Step Up</a>&#8221; in late May/early June, and &#8220;Tunnel of Love&#8221;  in late June/early July.</p>\n<p>In essence, the later the recording, the murkier the theme, and there&#8217;s no question that by those final two songs Bruce was finally and directly coming to terms with his inability to make his relationships work.</p>\n<p>Much has been written about the unusual production and construction of &#8220;Tunnel of Love,&#8221; from Toby Scott&#8217;s expedition to Point Pleasant Amusement Park, where he staged and captured actual riders on a roller coaster for the song&#8217;s introduction, to Nils&#8217; spectacularly tempestuous guitar solo, to Roy&#8217;s roller coaster climb during the song&#8217;s spooky break while Patti&#8217;s spectral vocals lurk in the background. (What the heck <em>is</em> she saying at 2:44, anyway?)</p>\n<p>I&#8217;ve never heard Bruce directly address what instigated that late-breaking burst of creativity. It&#8217;s clear that he had a very specific vision in mind from the beginning, though. Lyrically, &#8220;Tunnel of Love&#8221; is all in on its theme, so it&#8217;s not surprising that he wanted to evoke an amusement park musically as well.</p>\n<p>He certainly does so. The introduction to &#8220;Tunnel of Love&#8221; is a twenty-second whirlwind of carnival sights and sounds (sometimes I swear I can even smell the funnel cake) that perfectly captures the vividness of new love.</p>\n<p>Which is exactly what our narrator is experiencing as the lyrics begin. In Bruce&#8217;s first verse, all is&#8230; well, not exactly innocent, but at least simple.</p>\n<p style=\"padding-left: 40px;\"><em>Fat man sitting on a little stool</em><br />\n<em>Takes the money from my hand while his eyes take a walk all over you</em><br />\n<em>Hands me two tickets, smiles and whispers good luck</em><br />\n<em>Well cuddle up angel, cuddle up my little dove</em><br />\n<em>We&#8217;ll ride down baby into this tunnel of love</em></p>\n<p>It&#8217;s the early days of our narrator&#8217;s relationship, all new and exciting. The ride attendant takes his money (and his girl&#8217;s measure, in a cleverly constructed line), wishes him luck and sends the lovers on their way.</p>\n<p>In the second verse, things get physical as our riders find themselves alone in the dark.</p>\n<p style=\"padding-left: 40px;\"><em>Well I can feel the soft silk of your blouse</em><br />\n<em>And them soft thrills in our little fun house</em></p>\n<p>But those early days of physical connection quickly give way to emotional intimacy, and that&#8217;s when things get scary.</p>\n<p style=\"padding-left: 40px;\"><em>Then the lights go out and it&#8217;s just the three of us</em><br />\n<em>Yeah, you me and all that stuff we&#8217;re so scared of</em><br />\n<em>Gotta ride down baby into this tunnel of love</em></p>\n<p>For all of Bruce&#8217;s celebrated lyrics, I&#8217;d argue that those lines above deserve to rank among them. It&#8217;s the most perceptive line in the song (and the second most on the album, behind the closing lines of &#8220;Brilliant Disguise&#8221;), and with their arrival we finally hear Bruce acknowledge in his writing the fear of intimacy that he would so eloquently describe in his autobiography decades later.</p>\n<p>It&#8217;s a fantastic line, and I bet Bruce thinks so too, because if you watch the video, he can&#8217;t help but break into a brief self-satisfied smile for the only time in an otherwise quite serious song.</p>\n<p>In the second half of &#8220;Tunnel of Love,&#8221; Bruce explores the rest of the carnival, putting the other attractions to brilliant metaphorical use: the funhouse mirrors that distort our images of each other like our own emotional lenses do; the room of shadows that so easily hides parts of us where our partners can&#8217;t see; the haunted house that draws our characters together to face their fright as a pair.</p>\n<p style=\"padding-left: 40px;\"><em>There&#8217;s a crazy mirror showing us both in 5-D</em><br />\n<em>I&#8217;m laughing at you, you&#8217;re laughing at me</em><br />\n<em>There&#8217;s a room of shadows that gets so dark brother</em><br />\n<em>It&#8217;s easy for two people to lose each other in this tunnel of love</em></p>\n<p>That second line&#8211;&#8220;I&#8217;m laughing at you, you&#8217;re laughing at me&#8221;&#8211;has always tugged at me. Are Bruce&#8217;s characters laughing in amusement or in scorn? The line works either way, and I suspect Bruce knew it when he wrote it.</p>\n<p>And then there&#8217;s that break: enter Patti Scialfa&#8211;literally. She makes her first off-screen and on-screen appearance in a Springsteen video at this moment (she doesn&#8217;t perform on &#8220;Brilliant Disguise&#8221; which preceded &#8220;Tunnel of Love&#8221; as the album&#8217;s first single), walking out of the shadows and into Bruce&#8217;s life, her passionately wordless vocals underscoring Bruce&#8217;s final, hopeful verse:</p>\n<p style=\"padding-left: 40px;\"><em>Well, it ought to be easy, it ought to be simple enough</em><br />\n<em>Yeah, man meets woman and they fall in love</em><br />\n<em>But this house is haunted and the ride gets rough</em><br />\n<em>You&#8217;ve got to learn to live with what you can&#8217;t rise above</em><br />\n<em>If you want to ride on down, down through this tunnel of love</em></p>\n<p>It feels disrespectful to say this given how incredible Patti&#8217;s own three albums are, but her backing vocals here are among her best performances on record, just spectacular. And <em>come on</em>: could you ask for a more dramatic introduction?</p>\n<p>But let&#8217;s look past Patti&#8217;s debut for a moment and focus on Bruce&#8217;s closing couplet. If we compare it to the last lines of &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/03/04/roll-of-the-dice-the-river/\">The River,</a>&#8221; we can appreciate just how much Bruce matured in the decade that separated the two songs.</p>\n<p>In &#8220;The River,&#8221; Bruce&#8217;s narrator feels betrayed by a relationship that didn&#8217;t live up to its initial ideal; in &#8220;Tunnel of Love,&#8221; the narrator understands the price of love going in. We all have our demons, so naturally our houses are haunted. Love means facing and dealing with your partner&#8217;s demons as well as your own, but it also means you have someone by your side to help you face yours.</p>\n<p>Many critics have viewed those closing lines as cynical at worst, resigned at best. But to me, they sound hopeful, as does the whole of &#8220;Tunnel of Love.&#8221; Songs like &#8220;One Step Up&#8221; and &#8220;Two Faces&#8221; deal more directly with Bruce&#8217;s emotional struggles; in &#8220;Tunnel of Love,&#8221; by contrast, Bruce sounds like a man who&#8217;s starting to figure out what makes a relationship work, and in the process starting to figure himself out, too.</p>\n<hr />\n<p>Once completed, &#8220;Tunnel of Love&#8221; became the last song added to the album, bumping &#8220;<a href=\"https://estreetshuffle.com/index.php/2020/02/25/roll-of-the-dice-lucky-man/\">Lucky Man</a>&#8221; (a very symbolic trade) and becoming the title track. Bruce released it as the album&#8217;s second single, which topped the Billboard Mainstream Rock chart and reached #9 on the Hot 100. The Meiert Avis-directed video, which ranks among Bruce&#8217;s best, won the Video of the Year award at that year&#8217;s MTV VMAs.</p>\n<p>&#8220;Tunnel of Love&#8221; was still riding high when the Tunnel of Love Express Tour finally kicked off in late February 1988, and fans attending the show found that it not only served as the opening song each night, it also informed the show&#8217;s entire conceit, with each band member taking a ticket as they took the stage. And even if Bruce and Patti&#8217;s relationship remained a secret during those early months, it was evident to anyone paying attention that there was something between them.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen &amp; The E Street Band - Tunnel of Love\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/xPd7_f9dLgQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Yet despite appearing at every show of its namesake tour, &#8220;Tunnel of Love&#8221; disappeared from Bruce&#8217;s set lists after the Amnesty International tour wrapped up in late 1988. It finally reappeared late on the Rising Tour and made several appearances (fittingly) throughout the Magic Tour.</p>\n<p>Bruce even played a spare but remarkably effective solo version on the electric piano in 2005 on his solo acoustic tour.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Tunnel of Love (Live at the Van Andel Arena, Grand Rapids, MI - 8/3/05 - Official Audio)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/92yhQNYpMCw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Since the Magic Tour, &#8220;Tunnel of Love&#8221; has made only a single appearance, at Gothenburg on the 2016 River Tour.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Tunnel Of Love Multicam Mix 2016 06 25 Dubbed\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/OmU3lSF9d6s?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>But don&#8217;t count out future appearances. &#8220;Tunnel of Love&#8221; is too significant a track in Bruce&#8217;s catalog to stay absent for long.</p>\n<p><strong>Bonus:</strong> Here&#8217;s an alternate, rarely seen cut of Meiert Avis&#8217; award-winning video with less carnival imagery and more Bruce.</p>\n<p><iframe title=\"VideoPress Video Player\" aria-label='VideoPress Video Player' width='758' height='569' src='https://videopress.com/embed/laIqiHGm?hd=0&amp;cover=1' frameborder='0' allowfullscreen allow='clipboard-write'></iframe><script src='https://v0.wordpress.com/js/next/videopress-iframe.js?m=1739540970'></script></p>\n<p><strong>Tunnel of Love<br />\nRecorded:</strong> June-July, 1987<br />\n<strong>Released: </strong><em>Tunnel of Love </em>(1987), <em>The Essential Bruce Springsteen</em> (2003)<br />\n<strong>First performed:</strong> February 25, 1988 (Worcester, MA)<br />\n<strong>Last performed:</strong> June 25, 2016 (Gothenburg, Sweden)</p>\n<p>(c) June 15, 2021</p>\n", "protected": false}, "excerpt": {"rendered": "<p>The most mature and intimate song on Tunnel of Love cloaks itself in carnival imagery and telegraphs things to come.</p>\n", "protected": false}, "author": 1, "featured_media": 63525, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3, 3604], "tags": [275], "class_list": ["post-27454", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "category-tunnel", "tag-tunnel-of-love"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/1987/01/B1TWyfD0s5S._SL1500_.jpg?fit=1500%2C1492&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-78O", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 2607, "url": "https://estreetshuffle.com/index.php/1987/01/12/roll-of-the-dice-valentines-day/", "url_meta": {"origin": 27454, "position": 0}, "title": "Valentine&#8217;s Day", "author": "Ken", "date": "January 12, 1987", "format": false, "excerpt": "\"Valentine's Day\" is a powerful counterpoint to \"The River.\" It may even be a sequel.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/06/valentinesday.jpg?fit=600%2C630&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/06/valentinesday.jpg?fit=600%2C630&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/06/valentinesday.jpg?fit=600%2C630&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 55589, "url": "https://estreetshuffle.com/index.php/2025/01/15/kingdom-of-days-january-15-2/", "url_meta": {"origin": 27454, "position": 1}, "title": "January 15", "author": "Ken", "date": "January 15, 2025", "format": false, "excerpt": "On this date in Springsteen history: Watch a full Light of Day performance, plus the premiere of the video for \"Tunnel of Love.\"", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/01/rs-1076-rectangle.jpg?fit=1200%2C800&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/01/rs-1076-rectangle.jpg?fit=1200%2C800&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/01/rs-1076-rectangle.jpg?fit=1200%2C800&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/01/rs-1076-rectangle.jpg?fit=1200%2C800&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/01/rs-1076-rectangle.jpg?fit=1200%2C800&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 36849, "url": "https://estreetshuffle.com/index.php/1987/01/01/album-companion-tunnel-of-love/", "url_meta": {"origin": 27454, "position": 2}, "title": "Tunnel of Love", "author": "Ken", "date": "January 1, 1987", "format": false, "excerpt": "Bruce's eighth studio album is the latest to receive the complete Roll of the Dice treatment.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/Tunnel-Of-Love-1507561237-1000x1000-1.jpg?fit=1000%2C1000&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/Tunnel-Of-Love-1507561237-1000x1000-1.jpg?fit=1000%2C1000&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/Tunnel-Of-Love-1507561237-1000x1000-1.jpg?fit=1000%2C1000&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/Tunnel-Of-Love-1507561237-1000x1000-1.jpg?fit=1000%2C1000&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 55793, "url": "https://estreetshuffle.com/index.php/2025/01/24/kingdom-of-days-january-24-2/", "url_meta": {"origin": 27454, "position": 3}, "title": "January 24", "author": "Ken", "date": "January 24, 2025", "format": false, "excerpt": "Bruce plays his first ever show in Chicago, preps for his first ever show in South Africa, and records two songs that have still never seen the light of day. These and more highlights inside.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/rehearsal.jpg?fit=700%2C466&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/rehearsal.jpg?fit=700%2C466&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/rehearsal.jpg?fit=700%2C466&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/rehearsal.jpg?fit=700%2C466&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 6810, "url": "https://estreetshuffle.com/index.php/1987/01/04/roll-of-the-dice-spare-parts/", "url_meta": {"origin": 27454, "position": 4}, "title": "Spare Parts", "author": "Ken", "date": "January 4, 1987", "format": false, "excerpt": "The rocking arrangement and blunt language of \"Spare Parts\" overwhelms the dilemma at its center its moral of redemptive self-empowerment. Like \"Born in the U.S.A.,\" its true power emerges when it's performed quietly.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/spareparts_ep-at-cd3.jpg?fit=800%2C800&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/spareparts_ep-at-cd3.jpg?fit=800%2C800&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/spareparts_ep-at-cd3.jpg?fit=800%2C800&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/spareparts_ep-at-cd3.jpg?fit=800%2C800&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 1223, "url": "https://estreetshuffle.com/index.php/2018/03/22/cover-me-softband-tunnel-of-love/", "url_meta": {"origin": 27454, "position": 5}, "title": "Cover Me, Softband: Tunnel of Love", "author": "Ken", "date": "March 22, 2018", "format": false, "excerpt": "A lovely acoustic cover by a mystery band. Anyone know anything about them?", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/03/tolsoft.jpg?fit=500%2C500&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/27454", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=27454"}], "version-history": [{"count": 21, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/27454/revisions"}], "predecessor-version": [{"id": 63526, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/27454/revisions/63526"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/63525"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=27454"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=27454"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=27454"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}