{"uuid": "64744d91-a838-4767-9d8f-257a3f6e891f", "id": 42777, "date": "2023-05-01T05:05:00", "date_gmt": "2023-05-01T12:05:00", "guid": {"rendered": "https://estreetshuffle.com/?p=42777"}, "modified": "2024-01-03T16:35:37", "modified_gmt": "2024-01-04T00:35:37", "slug": "roll-of-the-dice-youngstown", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2023/05/01/roll-of-the-dice-youngstown/", "title": {"rendered": "Roll of the Dice: Youngstown"}, "content": {"rendered": "<blockquote><p><span style=\"font-size: 14pt;\">&#8220;I remember thinkin&#8217;, well I&#8217;m a guy. I know how to do one thing. What would happen if you&#8217;ve done something for thirty years&#8230; What would I say to my kids if I came home at night and I couldn&#8217;t feed them, or if they were hurting? I couldn&#8217;t help them. I couldn&#8217;t make them safe or ensure their health&#8230; It strikes to such a central part of who you are.&#8221; </span><span style=\"font-size: 14pt;\"><em>&#8211;Bruce Springsteen, 1995</em></span></p></blockquote>\n<p>In 1982, <em>Sacramento Bee</em> city editor Bill Moore walked into a bar and met an elderly homeless man. Over a drink, the man told Moore stories of itinerants riding the rails from town to town, searching for work, food, and shelter.</p>\n<p>This wasn&#8217;t Depression-era reminiscing, however. It was happening right then, fifty years post-Depression. These vagabonds were formerly middle-class citizens falling through new and widening cracks in the American safety net. Unable to find work in their hometowns or steady work anywhere, parents were forced to leave their families behind and wander the country in search of employment, and the public was oblivious to it.</p>\n<p>Moore was gobsmacked by the man&#8217;s stories. His newsman&#8217;s nose smelled a story. When he got back to the newspaper, he assigned a young reporter named Dale Maharidge to the story. Maharidge was only 26 at the time, but he&#8217;d been working newsrooms since he was a teen. He knew the best way to find a story was to immerse himself in it, so he and photographer Michael Williamson spent a week travelling California by train, collecting stories from the vagabonds he met along the way.</p>\n<p>&#8220;Within the first 24 hours, we knew it was a big story,&#8221; Williamson told <em>Chicago Tribune </em>columnist Bob Greene in a 1985 interview. &#8220;We were wondering if we would be able to find any hobos riding the trains around the country in the 80s. On the first train we hopped onto, there were twenty-five hobos. This was two and a half miles from our office, and we hadn&#8217;t even realized it was there.&#8221;</p>\n<p>Maharidge and Williamson quickly realized a week wasn&#8217;t long enough. They knew they had only scratched the surface, so they asked the newspaper for a leave of absence in order to do the story justice. They decided to write a book, and although their publisher warned them it would almost certainly not have any commercial potential, the pair spent six of the next twenty-four months riding the American railways.</p>\n<p>&#8220;We realized early on that maybe we had been stupid,&#8221; said Williamson. &#8220;There the two of us were, living in these freight cars in the middle of the country, and there were a lot of thoughts of the office and of home. Things were much more comfortable back there. But we knew that this was what we had gone into journalism for in the first place: to go out and see something that we hadn&#8217;t seen before.&#8221;</p>\n<p>Maharidge and Williamson titled their book <em>Journey to Nowhere</em>, knowing full well that neither their title nor subject matter was likely to attract many readers. &#8220;We would think: no one is going to want to read about this,&#8221; recalled Williamson. &#8220;It&#8217;s too depressing. It&#8217;s not what people will willingly read.&#8221;</p>\n<p>The pair persisted, believing in the importance of both their story and their approach. <b>&#8220;</b>I did something that was very rare in America now,&#8221; Maharidge said in a 2011 <em>Democracy Now! </em>interview. &#8220;I listened. I like listening to people’s stories. And when you listen, and you really care, which I do&#8230; you can’t fake that. And that’s what I try to do in the book: I try to show America to Americans, because we’ve got to start a conversation now about what kind of country we want to be, because it’s not going well.&#8221;</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"1985-publication of Journey to Nowhere\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/iPVW89AtCAo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Their instincts proved correct on all counts: when it was published, <em>Journey to Nowhere </em>marked the beginning of America&#8217;s awareness of its emerging underclass and garnered rave reviews. It also bombed commercially, selling only around ten thousand copies in total.</p>\n<p>&#8220;It didn&#8217;t change the world the way we thought it would,&#8221; Maharidge told the <em>The Hartford Courant</em> in 1996. &#8220;We were naïve, but at the time it was very sobering.&#8221;</p>\n<p>But sometimes it doesn&#8217;t matter how many books you sell&#8211;as long as a copy finds its way into the collection of just one right person.</p>\n<blockquote><p><span style=\"font-size: 14pt;\">&#8220;I&#8217;ve been telling students for five years now that you never know how your work will affect people, how you might change someone else&#8217;s life. Now I can point to this experience with Bruce and show that it&#8217;s true&#8221; &#8212; </span><span style=\"font-size: 14pt;\"><em>Dale Maharidge, The Modesto Bee, December 10, 1995</em></span></p></blockquote>\n<p>In October 1995, Maharidge checked his answering machine and found his attention arrested by a caller claiming to represent Bruce Springsteen, asking if he would be interested in licensing the rights to part of his book to the New Jersey singer-songwriter.</p>\n<p>Maharidge was stunned. &#8220;The first thing I asked Bruce was: &#8216;How did you find the book?&#8217; He said, &#8216;I bought it when it came out in the store.'&#8221;</p>\n<p>He may have been one of the book&#8217;s original 10,000 purchasers, but <i>Journey to Nowhere </i>collected dust on Springsteen&#8217;s bookshelf for a full decade before he finally cracked it open. And then one sleepless night in 1995, Springsteen pulled it off the shelf and started to read.</p>\n<p>&#8220;I had completed most of the [<a href=\"https://estreetshuffle.com/index.php/2023/06/03/album-companion-the-ghost-of-tom-joad/\"><em>Ghost of Tom Joad</em></a>] record,&#8221; Bruce recalled in the introduction he would end up writing for the book&#8217;s second edition, &#8220;when one night, unable to sleep, I pulled this book down off my living room shelf. I read it in one sitting and lay awake that night disturbed by its power and frightened by its implication.&#8221;</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"BRUCE SPRINGSTEEN--RAW INTERVIEW FOOTAGE\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/HN6z96fJq44?start=1&#038;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Within a week, Springsteen had written two new songs based on the stories told in <em>Journey to Nowhere, </em>and he wanted them on the album he thought was otherwise complete. Both songs drew heavily from Marharidge&#8217;s text, however, and Bruce felt he needed the author&#8217;s permission before releasing them.</p>\n<p>Maharidge wasn&#8217;t comfortable selling. &#8220;You can&#8217;t copyright inspiration,&#8221; he told <em>The Modesto Bee</em>, &#8220;and the book inspired him. I&#8217;m flattered that it had that impact on him. That alone was enough of a thrill to me. If he wanted to take the words from the book verbatim and slap them into his songs, I would have said, &#8216;fine.'&#8221;</p>\n<p>With the author&#8217;s permission, Bruce added the two songs to his now-complete album. &#8220;<a href=\"https://estreetshuffle.com/index.php/2018/07/13/roll-of-the-dice-the-new-timer/\">The New Timer</a>&#8221; chronicles the dangers faced by the homeless roaming the country by rail, drawing heavily from profiles in the book. It&#8217;s a quiet, harrowing song&#8211;even by the album&#8217;s sober standards&#8211;and it remains the least performed track from the album to this day.</p>\n<p>The second song went on to become the album&#8217;s most popular song besides its title track, and along with &#8220;<a href=\"https://estreetshuffle.com/index.php/2019/10/17/roll-of-the-dice-the-ghost-of-tom-joad/\">The Ghost of Tom Joad</a>,&#8221; it&#8217;s one of the album&#8217;s only two tracks to be performed in both contemplative acoustic and ferocious rock arrangements.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Youngstown\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/p-zs4lohmYc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>&#8220;Youngstown&#8221; is based on the story of Joe Marshall, a World War II veteran that Maharidge and Williamson met and interviewed during their two-year odyssey, and his son who followed in his footsteps in Vietnam. Wounded in battle in Normandy, the elder Marshall returned to his Ohio home and found work at the Ohio Steel Works.</p>\n<p style=\"padding-left: 40px;\"><em>Here in northeast Ohio, back in 1803</em><br />\n<em>James and Danny Heaton found the ore that was lining Yellow Creek</em><br />\n<em>They built a blast furnace here along the shore</em><br />\n<em>And they made the cannon balls that helped the Union win the war</em></p>\n<p>At the time, the steel industry&#8217;s Ohio roots were firmly entrenched. In 1802 (Springsteen would fudge the date in his song by a year for rhyming purposes), businessmen James and Daniel Heaton discovered iron ore in Yellow Creek near a town called Youngstown. Realizing the economic potential, the Heatons built a blast furnace and kick-started a new industry manufacturing armaments for the Union Army during the Civil War.</p>\n<p>When the war ended, demand for steel only grew. Bridges, buildings, ships, and cars&#8230; America was modernizing and the steel industry was at the heart of it. Youngstown steel found its way across America and the world, and the small Ohio town established itself as the nation&#8217;s leading producer.</p>\n<p style=\"padding-left: 40px;\"><em>Here in Youngstown, here in Youngstown</em><br />\n<em>My sweet Jenny I&#8217;m sinking down</em><br />\n<em>Here darling in Youngstown</em></p>\n<p>Although we&#8217;re accustomed to glossing over female names in Springsteen&#8217;s songs&#8211;they rarely seem to hold significance&#8211;in the case of &#8220;Youngstown,&#8221; it&#8217;s essential to understand why his narrator sings to Jenny.</p>\n<p>Bruce lifted Jenny directly from <em>Journey to Nowhere</em>, but she&#8217;s not Marshall&#8217;s wife, girlfriend or daughter. In fact, she&#8217;s not even a person at all.</p>\n<p><img data-recalc-dims=\"1\" decoding=\"async\" src=\"https://i0.wp.com/sweetjennylandcompany.com/images/jeanette%20furnace%201.jpg?w=758\" /></p>\n<p>Jeanette was the name of the $3,000,000 (in 1918 dollars) blast furnace at the Youngstown Sheet and Tube Company. Named after Mary Jeannette Thomas, daughter of Briar Hill Steel&#8217;s president, the furnace was 90 feet tall and weighed 500 tons. Before it was decommissioned in 1977, it produced more than eleven million tons of steel. It provided and sustained the livelihood of thousands of workers, until it didn&#8217;t.</p>\n<p>When we realize that Bruce&#8217;s narrator is singing to a blast furnace rather than a lover, we understand the full tragedy of &#8220;Youngstown.&#8221; Without the job that Jenny supported, Marshall finds himself sinking into poverty, helplessness, and desperation in the town he&#8217;d always called home.</p>\n<p>The Jenny furnace was demolished on January 29, 1997. Bruce got to see it in person shortly before its demise, although not by official invitation. On January 12, 1996, Bruce brought his solo acoustic tour to Youngstown itself, and he invited Maharidge to the show.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen: YOUNGSTOWN (live in Youngstown!)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/Smddcs5n0H0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Bruce told Dale he really wanted to see Jenny with his own eyes, but Maharidge wasn&#8217;t sure that was wise. &#8220;I said, &#8216;Look, Cargill owns it. They’re arresting everybody.&#8217; I knew somebody who was arrested a month before, sneaking in. He said, &#8216;Let’s go.&#8217; So we snuck into the Jenny blast furnace, spent an hour and a half in there talking about politics and life. And we made it out without getting arrested.&#8221;</p>\n<p style=\"padding-left: 40px;\"><em>Well my daddy worked the furnaces, kept &#8217;em hotter than hell</em><br />\n<em>I come home from &#8216;Nam worked my way to scarfer, a job that&#8217;d suit the devil as well</em><br />\n<em>Well taconite coke and limestone fed my children and made my pay</em><br />\n<em>Them smokestacks reaching like the arms of God into a beautiful sky of soot and clay</em></p>\n<p>&#8220;Youngstown&#8221; is a multi-generational song, told from the perspective of the son. Joe Marshall Jr. followed in his father&#8217;s footsteps in both military and civilian life. He served in Vietnam while his father worked on the furnaces under brutal conditions. Upon discharge, the younger Marshall joined his father in the mills as a stationary engineer.</p>\n<p>In his song, the son is a scarfer. If you&#8217;re unfamiliar with the job, let&#8217;s just say Bruce doesn&#8217;t exaggerate much when he described it as a job that would suit the devil. Scarfers remove defects and imperfections from slabs of steel using an oxyacetylene torch. It&#8217;s fiery, dangerous work.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Scarfer\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/y1wdxWNuJus?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Although Youngstown steel found its way into all sorts of products and places, it was particularly in demand for military vehicles, arms, and ammunition. When the Vietnam war finally ended, demand softened and foreign competition increased. Unable to withstand the economic headwinds, thousands of Youngstown steelworkers were laid off when the Campbell Steel Works closed on September 19, 1977, a day that became known locally as Black Monday. The Jenny blast furnace was permanently decommissioned that year, too.</p>\n<p>The Ohio Works finally closed in 1980, and both Marshalls found themselves unemployed. The plant was demolished not long after, and in their book, Maharidge and Williamson walk through the rubble with father and son. Surveying the metaphorical wreckage, Marshall Sr. makes a rueful observation: &#8220;What Hitler couldn&#8217;t do, they did it for him.&#8221; Bruce used that line almost verbatim in his song.</p>\n<p style=\"padding-left: 40px;\"><em>Well my daddy come on the Ohio works when he come home from World War Two</em><br />\n<em>Now the yard&#8217;s just scrap and rubble, he said &#8220;Them big boys did what Hitler couldn&#8217;t do.&#8221;</em><br />\n<em>Yeah these mills they built the tanks and bombs that won this country&#8217;s wars</em><br />\n<em>We sent our sons to Korea and Vietnam, now we&#8217;re wondering what they were dying for</em></p>\n<div id=\"v-I1OlqUWC-1\" class=\"video-player\"><iframe title='VideoPress Video Player' aria-label='VideoPress Video Player' width='758' height='504' src='https://videopress.com/embed/I1OlqUWC?hd=1&amp;cover=1&amp;loop=0&amp;autoPlay=0&amp;permalink=1&amp;muted=0&amp;controls=1&amp;playsinline=0&amp;useAverageColor=0&amp;preloadContent=metadata' frameborder='0' allowfullscreen data-resize-to-parent=\"true\" allow='clipboard-write'></iframe><script data-jetpack-boost=\"ignore\" src='https://s0.wp.com/wp-content/plugins/video/assets/js/next/videopress-iframe.js'></script></div>\n<p>Black Monday kicked off a five-year period of economic devastation, with approximately 50,000 jobs vanishing into thin air. At the peak of the steel industry, 150,000 people lived in Youngstown. Today, it&#8217;s barely 60,000.</p>\n<p>Youngstown is currently the poorest city in Ohio, with 36% of its residents and 58% of its children living in poverty. Among American cities, only San Juan in Puerto Rico has a higher child poverty rate.</p>\n<p>The societal and economic destruction of the once proud town shook Springsteen to his core. He couldn&#8217;t help but empathize and identify with the displaced steelworkers. &#8220;I was very frightened,&#8221; he told Bob Costas in 1995. &#8220;My God, you never know what tomorrow brings. It strikes some sort of fear: what if you couldn&#8217;t take care of your family? What if your daughters, what if you couldn&#8217;t pay for their health care? What if that was your kids? I know how deadly important my job is to me. What if I didn&#8217;t have that job? Or what if I couldn&#8217;t do that job after I did it for 20 or 25 years?&#8221;</p>\n<p>&#8220;I&#8217;ve had an enormous amount of luck and fortune and have worked hard, but that other thing&#8230; I don&#8217;t know. It never feels that far away. I think it&#8217;s as far away as the guy next to you. It&#8217;s not that far.&#8221;</p>\n<p style=\"padding-left: 40px;\"><em>From the Monongahela valley to the Mesabi iron range</em><br />\n<em>To the coal mines of Appalachia, the story&#8217;s always the same</em><br />\n<em>Seven hundred tons of metal a day, now sir you tell me the world&#8217;s changed</em><br />\n<em>Once I made you rich enough, rich enough to forget my name</em></p>\n<p>The destruction wasn&#8217;t limited to Youngstown.  Across the industry, steel companies closed plants and abandoned their employees. From Pennsylvania&#8217;s Monongahela Valley to the Mesabi mining district in Minnesota to the Appalachian coal mines, the modernization of America left human wreckage in its wake. In 1953, there were 650,000 American steelworkers. By 2015, there were only 142,000.</p>\n<p>Since Bruce first wrote and recorded &#8220;Youngstown,&#8221; the industry has continued to contract thanks to the rapid evolution of industry technology. In 1980, it took 10 person-hours to produce one ton of finished steel. Today it takes 30 to 90 minutes.</p>\n<p>It may be unfair to point fingers at employers for caving to forces beyond their control. But through his characters, Springsteen argues that those employers bear some responsibility for the welfare of the loyal employees they abandoned in order to protect their profits. Instead, the workers found themselves discarded and forgotten by the employers they made wealthy.</p>\n<p>Like so many of their neighbors, Marshall and son found themselves unable to support themselves or their families. All they wanted was a chance to do honest work, even difficult and dangerous work. As our narrator says in the song&#8217;s final words, he belongs in the furnaces and scarfing pits. He&#8217;s not cut out for easy work; he was made for hardened steel.</p>\n<p style=\"padding-left: 40px;\"><em>When I die I don&#8217;t want no part of heaven, I would not do heaven&#8217;s work well</em><br />\n<em>I pray the devil comes and takes me to stand in the fiery furnaces of hell</em></p>\n<div id=\"cf_async_439501118\">When he dies, he tells us, let him go to hell. It can&#8217;t be any hotter then his previous working conditions, and it can&#8217;t be any worse than his current living conditions. At least it would feel familiar.</div>\n<div></div>\n<hr />\n<p>Bruce met Maharidge and Williamson for the first time at Neil and Pegi Young&#8217;s Bridge School Benefit concert in October 1995, shortly before the release of <em>The Ghost of Tom Joad.</em> Springsteen invited the two men to the show and asked them to meet him backstage afterward. Greeting them with a giant hug, Bruce invited them into his dressing room, where Bruce gushed effusively about <em>Journey to Nowhere.</em></p>\n<p><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" data-attachment-id=\"43128\" data-permalink=\"https://estreetshuffle.com/index.php/2023/05/01/roll-of-the-dice-youngstown/capture-3/#main\" data-orig-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2023/05/Capture.png?fit=1052%2C636&amp;ssl=1\" data-orig-size=\"1052,636\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Capture\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2023/05/Capture.png?fit=300%2C181&amp;ssl=1\" data-large-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2023/05/Capture.png?fit=758%2C458&amp;ssl=1\" class=\"alignnone size-full wp-image-43128\" src=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2023/05/Capture.png?resize=758%2C458&#038;ssl=1\" alt=\"\" width=\"758\" height=\"458\" srcset=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2023/05/Capture.png?w=1052&amp;ssl=1 1052w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2023/05/Capture.png?resize=300%2C181&amp;ssl=1 300w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2023/05/Capture.png?resize=1024%2C619&amp;ssl=1 1024w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2023/05/Capture.png?resize=768%2C464&amp;ssl=1 768w\" sizes=\"auto, (max-width: 758px) 100vw, 758px\" /></p>\n<p>&#8220;He told us he wanted to do what he could to get the book back in print,&#8221; Maharidge told the <em>Bee. </em>He told Bruce that if he were so inclined to write an introduction for the new edition, they could put his name on the cover. That might prompt more people to pick up the book. Bruce agreed right away; days later, Marharidge secured a publisher for a second edition.</p>\n<p><img decoding=\"async\" src=\"https://m.media-amazon.com/images/I/A1qKfEa0u-L._AC_UF1000,1000_QL80_.jpg\" alt=\"Journey to Nowhere: The Saga of the New Underclass: Maharidge, Dale, Williamson, Michael, Springsteen, Bruce: 9780786882045: Amazon.com: Books\" /></p>\n<div id=\"cf_async_439501118\">The book was re-published in the spring of 1996, when Bruce was in the middle of his marathon, worldwide solo acoustic tour. He&#8217;d been performing &#8220;Youngstown&#8221; at every stop, doing his best through lengthy introductory comments to draw attention to the book and the people who inspired him. He even performed the song on <em>The Late Show with David Letterman</em>, an unusual song selection for a late night television appearance.</div>\n<div></div>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Youngstown - Bruce Springsteen (live on the Late Show with David Letterman 1995)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/InaLZEgy9r4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>When the E Street Band reunited a few years later, &#8220;Youngstown&#8221; became the only song from <em>The Ghost of Tom Joad</em> to be performed every single night of the Reunion Tour as the first song of a five-pack that contained the heart of Bruce&#8217;s nightly message.</p>\n<p>If the original album version is defeated and tragic, this new arrangement of &#8220;Youngstown&#8221; was fierce and defiant&#8211;angry, even. It also featured a scorching Nils Lofgren solo that brought the audience to its feet nightly.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen &amp; The E Street Band - Youngstown (Live in New York City)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/w038TQyWRN8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>As for the Marshalls, after the steelworks closed, Marshall Jr. struggled for years. Forced to live with his parents again, he kept his industrial license continually renewed at his father&#8217;s urging. &#8220;My dad told me right after the mill shut down, &#8216;Joe, keep the license up. You never know.'&#8221; Marshall told Maharidge in 2020. &#8220;I said &#8216;Screw it, I&#8217;ll never be an engineer again.&#8217; But he said &#8216;Never say never.&#8217; And he was right.&#8221;</p>\n<p>Joe was 67 then and working as a stationary engineer in Columbus, after years of serving as a corrections officer. Like many of his neighbors and colleagues, the formerly dyed-in-the-wool Democrat had become a Trump supporter.</p>\n<p>Springsteen told author Brian Hiatt he wasn&#8217;t surprised. &#8220;I believe there&#8217;s a price being paid for not addressing the real cost of the deindustrialization and globalization that has occurred in the United States for the past thirty-five, forty years,&#8221; Bruce says in <em>Stories Behind the Songs, </em>&#8220;and how it&#8217;s deeply affected people&#8217;s lives and deeply hurt people to where they want someone who says they have a solution.&#8221;</p>\n<p>But when Maharidge asked Marshall if he&#8217;d ever consider returning to the Democratic Party if they were able to deliver good jobs for the Ohio working class, Marshall quickly and repeatedly answered, &#8220;Sure.&#8221;</p>\n<p>Joe Marshall Jr. passed away a year later. Youngstown still waits for those jobs.</p>\n<p><strong>Youngstown<br />\nRecorded:</strong> June 16, 1995<br />\n<strong>Released:</strong> <em>The Ghost of Tom Joad </em>(1995)<br />\n<strong>First performed:</strong> November 21, 1995 (New Brunswick, NJ)<br />\n<strong>Last performed:</strong> February 25, 2017 (Auckland, New Zealand)</p>\n<p>Looking for your favorite Bruce song? Check our <a href=\"https://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">full index</a>. New entries every week!</p>\n", "protected": false}, "excerpt": {"rendered": "<p>In 1985, Bruce picked up a book on the new American underclass. When he finally opened and read it a decade later, it inspired one of the strongest songs on his next album.</p>\n", "protected": false}, "author": 1, "featured_media": 42778, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [1349, 582, 42], "class_list": ["post-42777", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-journey-to-nowhere", "tag-the-ghost-of-tom-joad", "tag-youngstown"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2023/04/youngstown.webp?fit=600%2C600&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-b7X", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 55578, "url": "https://estreetshuffle.com/index.php/2025/01/12/kingdom-of-days-january-12/", "url_meta": {"origin": 42777, "position": 0}, "title": "January 12", "author": "Ken", "date": "January 12, 2025", "format": false, "excerpt": "Youngstown in Youngstown, an all-star HOF jam, and a secret gig at the White House are among this day's highlights.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/2017-0112.jpg?fit=939%2C448&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/2017-0112.jpg?fit=939%2C448&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/2017-0112.jpg?fit=939%2C448&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/2017-0112.jpg?fit=939%2C448&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 16059, "url": "https://estreetshuffle.com/index.php/2020/02/21/roll-of-the-dice-this-depression/", "url_meta": {"origin": 42777, "position": 1}, "title": "Roll of the Dice: This Depression", "author": "Ken", "date": "February 21, 2020", "format": false, "excerpt": "Years before he openly confessed his lifelong battle with depression, Bruce hid it in plain sight as the centerpiece of his Wrecking Ball album.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/depression-scaled.jpg?fit=1200%2C814&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/depression-scaled.jpg?fit=1200%2C814&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/depression-scaled.jpg?fit=1200%2C814&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/depression-scaled.jpg?fit=1200%2C814&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/depression-scaled.jpg?fit=1200%2C814&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 3909, "url": "https://estreetshuffle.com/index.php/2018/08/24/roll-of-the-dice-for-never-asking/", "url_meta": {"origin": 42777, "position": 2}, "title": "Roll of the Dice: For Never Asking", "author": "Ken", "date": "August 24, 2018", "format": false, "excerpt": "Bruce grappled with depression through song as early as 1968, as this unreleased entry from his notebook demonstrates.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/08/forneverasking_lyrics-300x145.jpg?resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/08/forneverasking_lyrics-300x145.jpg?resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/08/forneverasking_lyrics-300x145.jpg?resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/08/forneverasking_lyrics-300x145.jpg?resize=700%2C400 2x"}, "classes": []}, {"id": 1015, "url": "https://estreetshuffle.com/index.php/2018/03/17/roll-of-the-dice-better-days/", "url_meta": {"origin": 42777, "position": 3}, "title": "Roll of the Dice: Better Days", "author": "Ken", "date": "March 17, 2018", "format": false, "excerpt": "\"Better Days\" is one of the happiest songs in Bruce's catalog. It also features some of his best writing.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/03/betterdays.jpg?fit=495%2C500&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 61366, "url": "https://estreetshuffle.com/index.php/2025/11/14/kingdom-of-days-november-14-2/", "url_meta": {"origin": 42777, "position": 4}, "title": "Kingdom of Days: November 14", "author": "Ken", "date": "November 14, 2025", "format": false, "excerpt": "\"Streets of Fire\" returns after almost a quarter-century, \"Youngstown\" gets Seeger-fied, and more.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/20061114_front.jpg?fit=711%2C703&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/20061114_front.jpg?fit=711%2C703&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/20061114_front.jpg?fit=711%2C703&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/20061114_front.jpg?fit=711%2C703&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 3494, "url": "https://estreetshuffle.com/index.php/2018/07/25/meeting-across-the-river-bruce-springsteen-and-sam-moore-soul-man/", "url_meta": {"origin": 42777, "position": 5}, "title": "Meeting Across the River: Bruce Springsteen and Sam Moore, Soul Man", "author": "Ken", "date": "July 25, 2018", "format": false, "excerpt": "Two master bandleaders sharing the stage together: Bruce and Sam Moore team up to cover a Stax classic at the Rock and Roll Hall of Fame 25th Anniversary Concert.", "rel": "", "context": "In &quot;Meeting Across the River&quot;", "block_context": {"text": "Meeting Across the River", "link": "https://estreetshuffle.com/index.php/category/meeting-across-the-river/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/07/sam-and-dave-soul-man-atlantic-11.jpg?fit=497%2C500&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/42777", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=42777"}], "version-history": [{"count": 40, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/42777/revisions"}], "predecessor-version": [{"id": 47686, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/42777/revisions/47686"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/42778"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=42777"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=42777"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=42777"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}