{"uuid": "a6b50a18-611a-4021-bdd4-46b3c31f77cc", "id": 29310, "date": "2021-10-03T05:00:00", "date_gmt": "2021-10-03T12:00:00", "guid": {"rendered": "https://estreetshuffle.com/?p=29310"}, "modified": "2024-03-24T19:12:18", "modified_gmt": "2024-03-25T02:12:18", "slug": "roll-of-the-dice-racing-in-the-street", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2021/10/03/roll-of-the-dice-racing-in-the-street/", "title": {"rendered": "Roll of the Dice: Racing in the Street"}, "content": {"rendered": "<blockquote><p><span style=\"font-size: 14pt\">&#8220;Oh yeah, life goes on long after the thrill of living is gone.&#8221;&nbsp; </span><span style=\"font-size: 14pt\"><em>&#8211;John Mellencamp</em></span></p>\n</blockquote>\n<p>It&#8217;s the scariest question in rock and roll:&nbsp;<em>And then what?</em></p>\n<p>No young rocker really wants to ask that question, let alone answer it.</p>\n<p>If you pull out of that town full of losers, what happens <em>after</em> you win? When you get to that place where you really want to go, what happens <em>after</em> you take that walk in the sun?</p>\n<p>Even for those born to run, the road is long and seeming without end. It doesn&#8217;t stop at the horizon.</p>\n<p>&#8220;I think at the moment in &#8217;75 when my dream in its own funny way came true, I had to deal with the consequences,&#8221; Bruce told Bill Flanagan in a 1987 interview. &#8220;That [dream] is always very comfortable and there&#8217;s an illusion of safety. There is an illusion of security which is all <em>really</em> an illusion. It&#8217;s really a very dangerous place. There is little safety there. There&#8217;s no real security and there&#8217;s no&nbsp;<em>life</em> there. There&#8217;s really nothing.</p>\n<p>&#8220;That whole Darkness record was about that. I wanted to come back and confront some things. What had happened after <em>Born to Run</em>? Where were my friends? Where were the people that mattered to me? My frivolous little trip&#8211;okay, it was fun, but in and of itself it just didn&#8217;t hold enough to keep me very fascinated.&#8221;</p>\n<p>What did fascinate Bruce was the idea of consequences. In that same interview, Flanagan suggested that rock and roll had largely avoided dealing with consequences, leaving that for country music. Flanagan compared rock and roll to Saturday night and country to Sunday morning. Bruce replied, &#8220;I wanted Saturday night&nbsp;<em>and</em> Sunday morning&#8211;but I also wanted Monday through Friday! Because there&#8217;s a lot more Monday through Fridays than there are Saturday nights or Sunday mornings. And those are the days you&#8217;ve got to live with.&#8221;</p>\n<p>And so in 1976, Bruce stared that scary question in the face and refused to flinch.</p>\n<p><em>And then what?</em></p>\n<p>Answering that question led him away from his romantic <em>Born to Run</em> songwriting and opened a darker, realistic vein that produced &#8220;The Promise,&#8221; &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/05/28/roll-of-the-dice-something-in-the-night/\">Something in the Night</a>,&#8221; and what still stands as one of his crowning songwriting achievements: &#8220;Racing in the Street.&#8221;</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Racing in the Street\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/cm9UuM3UXdc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Bruce wrote all those songs around the same time, but unlike the others, Bruce didn&#8217;t preview &#8220;Racing in the Street&#8221; on tour. Instead, he held onto it tightly until the legal injunction that prevented him from entering a recording studio was lifted.</p>\n<p>On July 2, 1977, Bruce recorded the earliest known version of &#8220;Racing in the Street&#8221; at Atlantic Studios. It&#8217;s incomplete&#8211;missing the final verse and featuring several early lyrical phrases that would ultimately be changed&#8211;but his breathtaking solo piano performance is laden with empathy for his characters.&nbsp; If you haven&#8217;t heard it before, you really should take a few minutes to do so now.</p>\n<div id=\"v-TkMyNoop-1\" class=\"video-player\"><iframe title='VideoPress Video Player' aria-label='VideoPress Video Player' width='758' height='426' src='https://videopress.com/embed/TkMyNoop?hd=1&amp;cover=1&amp;loop=0&amp;autoPlay=0&amp;permalink=1&amp;muted=0&amp;controls=1&amp;playsinline=0&amp;useAverageColor=0&amp;preloadContent=metadata' frameborder='0' allowfullscreen data-resize-to-parent=\"true\" allow='clipboard-write'></iframe><script data-jetpack-boost=\"ignore\" src='https://s0.wp.com/wp-content/plugins/video/assets/js/next/videopress-iframe.js'></script></div>\n<p>Bruce&#8217;s final lyrics for &#8220;Racing in the Street&#8221; (completed and recorded only a month after the solo recording above&#8211;that&#8217;s how quickly Bruce gelled the song) are among the subtlest he&#8217;d yet written, so much so that listeners and critics have often too confidently and completely characterized it as depressive and fatalistic. It <em>is</em> those things, but it&#8217;s also defiant and hopeful and even a bit sweet.</p>\n<p>It was a huge leap forward in Bruce&#8217;s songwriting, but there was still one big throughline: the getaway car. In interviews, Bruce has cited Asbury Park&#8217;s car culture and a conversation with a local as inspiration for &#8220;Racing in the Street,&#8221; but he was too sophisticated a songwriter by that point to have not understood that the best way to mature and deepen his <em>Born to Run</em> themes was to challenge the idea of escape represented by the automobile throughout that album.</p>\n<p>In &#8220;Racing in the Street,&#8221; the car still offers escape, but only for and in the moment. The &#8217;69 Chevy is a drug that offers a short-lived high to distract from the long, dull sameness of his life.</p>\n<p style=\"padding-left: 40px\"><em>I got a &#8217;69 Chevy with a 396, fuelie heads and a Hurst on the floor</em><br />\n<em>She&#8217;s waiting tonight down in the parking lot outside the 7-Eleven store</em><br />\n<em>Me and my partner Sonny built her straight out of scratch and he rides with me from town to town</em><br />\n<em>We only run for the money, got no strings attached, we shut &#8217;em up and then we shut &#8217;em down</em></p>\n<p style=\"padding-left: 40px\"><em>Tonight, tonight the strip&#8217;s just right, I wanna blow &#8217;em off in my first heat</em><br />\n<em>Summer&#8217;s here and the time is right for racing in the street</em></p>\n<p>We feel that <em>sameness</em> throughout &#8220;Racing in the Street,&#8221; from its languid rhythm (Max can&#8217;t even keep the pace constant during the otherwise gorgeous bridge&#8211;<em>stick!</em>) to its torpid riff, lifted with a wink from The Crystals &#8220;<a href=\"https://estreetshuffle.com/index.php/2020/12/03/cover-me-then-she-kissed-me/\">Then He Kissed Me</a>.&#8221; Sameness, impotence, and a melodic ennui.</p>\n<p>It isn&#8217;t just the riff that paid homage to the romantic girl group music of the 1960s. Bruce tips his hat throughout to &#8220;<a href=\"https://estreetshuffle.com/index.php/2020/09/12/cover-me-dancing-in-the-street/\">Dancing in the Street</a>&#8221; by Martha and the Vandellas, co-opting that song&#8217;s chorus repeatedly to underscore how his narrator uses street racing as a way to recapture a simpler, more innocent time of his life.</p>\n<p>&#8220;I felt like if I was going to move on,&#8221; Bruce told Flanagan, &#8220;[my music] was going to have to make sense of my life <em>now</em>. And the thing that I found in &#8216;<a href=\"https://estreetshuffle.com/index.php/2019/06/01/matr-bruce-springsteen-and-ronnie-spector-be-my-baby/\">Be My Baby</a>&#8216; is not going to answer the questions that come up [now].&#8221;</p>\n<p>So the callbacks to the sixties represent the narrator&#8217;s lost youth and innocence, and the car (from the same era) represents a momentary way to recapture it.</p>\n<p>And this is probably as a good a time as any to acknowledge what my automotive aficionado readers will otherwise doubtless comment on: a &#8217;69 Chevy with a 396 and fuelie heads is not a thing. They are incompatible, or so I&#8217;m told. (I know next to nothing about cars.) Bruce has known this since shortly after he recorded it, as he revealed in this 1978 radio interview.</p>\n<audio class=\"wp-audio-shortcode\" id=\"audio-29310-3\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://estreetshuffle.com/wp-content/uploads/2021/10/Bruce-Springsteen-Radio-Interview-KMET-FM-July-4-1978.mp3?_=3\" /><a href=\"https://estreetshuffle.com/wp-content/uploads/2021/10/Bruce-Springsteen-Radio-Interview-KMET-FM-July-4-1978.mp3\">https://estreetshuffle.com/wp-content/uploads/2021/10/Bruce-Springsteen-Radio-Interview-KMET-FM-July-4-1978.mp3</a></audio>\n<p>Despite his penchant for updating his lyrics over time, Bruce never did fix his impossible car, but that&#8217;s okay: it&#8217;s a metaphor anyway, right? There&#8217;s something fitting about life&#8217;s getaway car being an impossible vehicle.</p>\n<p>In any event, that first verse is pure escapist fantasy, Act One of three with no hint of the darkness we glimpse in the second act.</p>\n<p style=\"padding-left: 40px\"><em>We take all the action we can meet and we cover all the northeast states</em><br />\n<em>When the strip shuts down we run &#8217;em in the street from the fire roads to the interstate</em><br />\n<em>Now some guys they just give up living and start dying little by little, piece by piece</em><br />\n<em>Some guys come home from work and wash up and go racing in the street</em></p>\n<p style=\"padding-left: 40px\"><em>Tonight, tonight the strip&#8217;s just right, I wanna blow &#8217;em all out of their seats</em><br />\n<em>We&#8217;re calling out around the world, we&#8217;re going racing in the street</em></p>\n<p>That second couplet is the key to the song, and it took Bruce a while to get there. You might have noticed that in the original piano version above, he sings:</p>\n<p style=\"padding-left: 40px\"><em>Now some guys they do it for the money, other guys do it &#8217;cause they don&#8217;t know what else they can do</em><br />\n<em>And me I stand there with nothing, I got tired of waking up in a world somebody else owns</em></p>\n<p>Those lines were a bit too on the nose, explicitly revealing that our narrator turns to racing out of despair or frustration rather than the more nuanced lines he&#8217;d finally land on:</p>\n<p style=\"padding-left: 40px\"><em>Now some guys they just give up living and start dying little by little, piece by piece</em><br />\n<em>Some guys come home from work and wash up and go racing in the street</em></p>\n<p>What&#8217;s brilliant about these lines is that they can be read either as complements or contrasts, and they work either way. Does our narrator go racing every night <em>because</em> he&#8217;s dying by degrees, or in defiance of it? Decide for yourself; my money&#8217;s on both.</p>\n<p>What&#8217;s important here is that no matter how you read those lines, it&#8217;s clear that our narrator understands his own motivation. As John Mellencamp would write a few years later, life goes on long after the thrill of living is gone. But our narrator knows how to recapture some of that thrill on any given night, even if it keeps him anchored in place.</p>\n<p>There&#8217;s an instrumental bridge here, inspired by and similar to The Beach Boys&#8217; &#8220;Don&#8217;t Worry, Baby&#8221; &#8212; almost certainly another deliberately sly choice. In that song, a reluctant racer dreads the ritual and comes alive only when he&#8217;s with his girl, who reassures him they&#8217;ll be okay. Bruce immediately subverts The Beach Boys&#8217; storyline in his final verse.</p>\n<p style=\"padding-left: 40px\"><em>I met her on the strip three years ago in a Camaro with this dude from L.A.</em><br />\n<em>I blew that Camaro off my back and drove that little girl away</em><br />\n<em>But now there&#8217;s wrinkles &#8217;round my baby&#8217;s eyes and she cries herself to sleep at night</em><br />\n<em>When I come home the house is dark, she sighs, &#8220;Baby did you make it all right?&#8221;</em><br />\n<em>She sits on the porch of her daddy&#8217;s house but all her pretty dreams are torn</em><br />\n<em>She stares off alone into the night with the eyes of one who hates for just being born</em><br />\n<em>For all the shut down strangers and hot rod angels rumbling through this promised land</em><br />\n<em>Tonight my baby and me we&#8217;re gonna ride to the sea and wash these sins off our hands</em></p>\n<p style=\"padding-left: 40px\"><em>Tonight, tonight the highway&#8217;s bright, out of our way mister you best keep</em><br />\n<em>&#8216;Cause summer&#8217;s here and the time is right for racing in the street</em></p>\n<p>Those are devastatingly powerful lines. If there is tragedy to be found in &#8220;Racing in the Street&#8221; it&#8217;s in the form of the narrator&#8217;s love interest. Street racing may have brought them together in their youth, but now it&#8217;s driven a wedge between them.</p>\n<p>Both characters find themselves trapped in the unending sameness of their shared life, but only one of them finds a means of temporary escape. He relives past glory when he races, but she has <em>nothing</em>. She&#8217;s on the outside, and for anyone who fell in love with the selfless romance of &#8220;Don&#8217;t Worry Baby&#8221; in 1964, is there any line in Bruce&#8217;s catalog more heartbreaking and bitter than&nbsp; our heroine&#8217;s &#8220;Baby, did you make it all right?&#8221;</p>\n<p>Bruce reveals a selfishness in our lead character here, or at least a self-centeredness. It&#8217;s clear he understands his love&#8217;s pain. He even shares it. It&#8217;s just not clear he realizes that his personal painkiller exacerbates her isolation.</p>\n<p>&#8220;I had the experience of watching the ones that went before,&#8221; Bruce told Flanagan in that 1987 interview. &#8220;There were maps. And when a lot of them got to that place they read, &#8216;Dead End.&#8217;&#8230; You can&#8217;t set up a house at the end of that dead-end street.&#8221; But that&#8217;s exactly where our two characters live, where our narrator&#8217;s baby sits haunted on the porch staring with the eyes of one who hates for just being born. Being born means having to live a life, and that can be a big space and a long time to fill.</p>\n<p>In his early version of the song, Bruce exhorts his &#8220;little one&#8221; to &#8220;come on out&#8230; and we&#8217;ll go&nbsp;<em>dying</em> in the streets.&#8221; Because when the thrill of living is gone, the thrill of risking death becomes very tempting.</p>\n<p>Bruce is making a statement with his two characters: for ordinary people living ordinary lives, the world is divided into shut-down strangers (a nice play on words, capturing both the emotionally shut-down as well as those defeated in contest) and hot rod angels. You either give in or fight on, die by degrees or live (and even risk dying) in the moment. And it is very hard to be life partner to someone in the opposing camp.</p>\n<p>Hard, perhaps, but not impossible. Bruce redeems his narrator in the song&#8217;s final lines. He may abandon his partner for his nightly races, but on this night he pauses his ritual. Instead, he takes her to the sea, where they put aside their bitterness and avoidance and come together for at least one night.</p>\n<p>Describing that passage in a 1978 interview, Bruce said, &#8220;&#8230;what I was trying to show is that through all that, and through all the disappointment&#8211;in the face of all that&#8230; darkness out there, there&#8217;s some place better than where you are&#8211;and if not, at least there&#8217;s some value in the search.&#8221;</p>\n<p>There&#8217;s value in the search, and value in having a search partner.</p>\n<p>I&#8217;ve compared &#8220;Racing in the Street&#8221; to John Mellencamp&#8217;s &#8220;Jack and Diane&#8221; a couple of times in this essay, because both songs mine similar earth. Bruce is more artful about it, but it&#8217;s Mellencamp who delivers one of the immortal lines of rock and roll.</p>\n<p>Both songwriters, however, should impress the heck out of us for having written such deeply empathetic songs at such a young age. Bruce was only 26 or 27 when he wrote &#8220;Racing,&#8221; and John was likely 30. These are the kinds of songs we&#8217;d expect them to release <em>now, </em>not then.</p>\n<p>Oh wait, they just did.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"John Mellencamp - Wasted Days ft. Bruce Springsteen\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/hHLGZxlBpLA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>&#8220;Wasted Days&#8221; is very much in keeping for the authors of &#8220;Racing in the Street&#8221; and &#8220;Jack and Diane.&#8221; But what&#8217;s more terrifying: idling in place when your days are numbered, or feeling forever stuck when forever is still a mighty long time?</p>\n<p>Ask me in about twenty years.</p>\n<hr>\n<p>&#8220;Racing in the Street&#8221; is such a poetic accomplishment that it&#8217;s easy to overlook its backing track when discussing it. That would be a disservice, though, because this is one of the E Street Band&#8217;s finest moments on record.</p>\n<p>This is a carefully arranged song with an uncharacteristically restrained performance, but &#8220;Racing&#8221; wouldn&#8217;t work without the gradual entrance of the band members as the narrator retreats into his inner life; the spectral background vocals during the song&#8217;s final verse; and that gorgeous, ambling coda. (My favorite moment, though, is Max&#8217;s engine-revving drum roll that ushers in the bridge as our narrator loses himself in past glory.)</p>\n<p>At almost seven minutes, &#8220;Racing in the Street&#8221; is already one of Bruce&#8217;s longer studio tracks. On stage, it&#8217;s only grown in length and majesty over the decades. It was a set centerpiece from the beginning, a nightly highlight during the Darkness Tour. Bruce and the band performed the song in its album arrangement, but we can already hear the intro and outro evolving. (Clarence also gets a sax solo&#8211;his instrument was conspicuously absent on the album track.)</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen &amp; The E Street Band - Racing in the Street (Live in Houston, 1978)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/yYf3mCEVAnU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Over the years, though, it&#8217;s been Roy Bittan who&#8217;s emerged as the hero of live performances of &#8220;Racing in the Street,&#8221; and watching this performance from Philadelphia in 2016, it&#8217;s easy to understand why. The entire band is at the top of their game, but Roy is simply majestic.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Racing In The Street - Philadelphia (Best Version) - 9/9/16\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/DQc_HLYh_NI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Bonus #1</strong>: In 2010, Bruce released an alternate vintage version of &#8220;Racing in the Street&#8221; on his album <em>The Promise.</em>&#8221; Commonly known as &#8220;Racing in the Street (&#8217;78)&#8221; (inexplicably, since it was recorded in 1977), the song features lyrics closer to the original solo piano version above, arranged for a more powerful band performance.</p>\n<p>It&#8217;s a fascinating insight into the evolution of a classic song, but even though it&#8217;s a fantastic performance (featuring David Lindley on violin), the arrangement stomps on the song&#8217;s sadness and robs it of its emotional power.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Racing in the Street (&#039;78)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/LE78g3UzyfM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Interestingly, Bruce had to do a minor bit of surgery on his &#8217;77 studio outtake in order to release it. There&#8217;s one&#8211;and only one&#8211;lyric line in the track that&#8217;s modern, a seconds-long 2010 Bruce vocal grafted onto a 1977 vintage performance. Did you notice it?</p>\n<p>If not, take a listen to the original raw outtake&#8211;I&#8217;m pretty certain you&#8217;ll figure out which line Bruce had to replace when you hear it.</p>\n<audio class=\"wp-audio-shortcode\" id=\"audio-29310-4\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://estreetshuffle.com/wp-content/uploads/2021/10/racinginthestreet_unofficial2.mp3?_=4\" /><a href=\"https://estreetshuffle.com/wp-content/uploads/2021/10/racinginthestreet_unofficial2.mp3\">https://estreetshuffle.com/wp-content/uploads/2021/10/racinginthestreet_unofficial2.mp3</a></audio>\n<p>That version of &#8220;Racing&#8221; has made only a few outings in concert, the first of which even featured Lindley reprising his violin part 33 years later.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Racing in the Street (Live At The Carousel, Asbury Park, NJ - 2010)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/xlremWeb08o?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>It&#8217;s likely to stay rare, though, because after performing the original version more than 350 times across four decades, when Bruce and the band attempt to play the alternate version, they risk their muscle memory running them off the rails. I was there in Uncasville when they did their best to open with that alternate version in 2014, and you can hear it go awry pretty early.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Racing In The Street (&#039;78)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/LL0ejclelxg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>That version of &#8220;Racing in the Street&#8221; is likely to stay a curiosity, but the original version is sure to always rank among Bruce&#8217;s best work, a favorite of fans and critics alike.</p>\n<p><strong>Bonus #2:&nbsp;</strong>My favorite version of &#8220;Racing in the Street&#8221; isn&#8217;t any of the above. It&#8217;s the to-die-for acoustic version from 1996 performed by just Bruce on guitar accompanied by Soozie Tyrell on violin. It&#8217;s simply stunning.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen- Racing in the Street Asbury Park 1996\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/PiCrYEChi9Q?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Racing in the Street<br />\nRecorded:</strong> August 1977 (both versions)<br />\n<strong>Released:&nbsp;</strong><em><a href=\"https://estreetshuffle.com/index.php/2022/07/05/album-companion-darkness-on-the-edge-of-town/\">Darkness on the Edge of Town&nbsp;</a></em>(1978),&nbsp;<em>The Promise&nbsp;</em>(2010, &#8217;78 version)<br />\n<strong>First performed:</strong> May 23, 1978 (Buffalo, NY)<br />\n<strong>Last performed:</strong> June 26, 2023 (Gothenburg, Sweden)</p>\n<p>Looking for your favorite Bruce song? Check our full index&nbsp;<a href=\"https://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">here</a>. New entries every week!</p>\n", "protected": false}, "excerpt": {"rendered": "<p>It&#8217;s one of Bruce&#8217;s best songs, and it arose from a simple question: And then what?</p>\n", "protected": false}, "author": 1, "featured_media": 29961, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [299, 1247, 1961], "class_list": ["post-29310", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-darkness-on-the-edge-of-town", "tag-racing-in-the-street", "tag-racing-in-the-street-78"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/racing-scaled.jpg?fit=2560%2C2033&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-7CK", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 13195, "url": "https://estreetshuffle.com/index.php/2019/10/19/roll-of-the-dice-fugitives-dream/", "url_meta": {"origin": 29310, "position": 0}, "title": "Roll of the Dice: Fugitive&#8217;s Dream", "author": "Ken", "date": "October 19, 2019", "format": false, "excerpt": "Sister song to \"Unsatisfied Heart,\" \"Fugitive's Dream\" is a fully-realized Born in the U.S.A. outtake that would have been right at home on Nebraska.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/fugitive_1554006559.jpg?fit=640%2C426&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/fugitive_1554006559.jpg?fit=640%2C426&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/fugitive_1554006559.jpg?fit=640%2C426&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 226, "url": "https://estreetshuffle.com/index.php/2018/01/14/roll-of-the-dice-i-wanna-be-with-you/", "url_meta": {"origin": 29310, "position": 1}, "title": "Roll of the Dice: I Wanna Be With You", "author": "Ken", "date": "January 14, 2018", "format": false, "excerpt": "A lost power-pop classic, \"I Wanna Be With You\" charms with its lovesick loser protagonist, fiercely defiant lyrics and exuberant arrangement.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/wanna.jpg?fit=800%2C700&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/wanna.jpg?fit=800%2C700&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/wanna.jpg?fit=800%2C700&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/wanna.jpg?fit=800%2C700&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 36003, "url": "https://estreetshuffle.com/index.php/2022/07/05/album-companion-darkness-on-the-edge-of-town/", "url_meta": {"origin": 29310, "position": 2}, "title": "Album Companion: Darkness on the Edge of Town", "author": "Ken", "date": "July 5, 2022", "format": false, "excerpt": "Bruce Springsteen's fourth studio album becomes the first to receive the complete Roll of the Dice treatment.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/07/darkness.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/07/darkness.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/07/darkness.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/07/darkness.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/07/darkness.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 35841, "url": "https://estreetshuffle.com/index.php/2022/06/27/roll-of-the-dice-action-in-the-streets/", "url_meta": {"origin": 29310, "position": 3}, "title": "Roll of the Dice: Action in the Streets", "author": "Ken", "date": "June 27, 2022", "format": false, "excerpt": "So nice he wrote it thrice–and maybe more, depending on how you count. Let's listen to the moving target that is \"Action in the Streets.\"", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/07/action.jpg?fit=599%2C598&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/07/action.jpg?fit=599%2C598&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/07/action.jpg?fit=599%2C598&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 7796, "url": "https://estreetshuffle.com/index.php/2019/03/10/roll-of-the-dice-crazy-rocker/", "url_meta": {"origin": 29310, "position": 4}, "title": "Roll of the Dice: Crazy Rocker", "author": "Ken", "date": "March 10, 2019", "format": false, "excerpt": "Listen to Bruce's greatest unfinished rocker from the Darkness sessions and imagine what a show-stopper we *almost* had.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/03/crocker.jpg?fit=903%2C748&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/03/crocker.jpg?fit=903%2C748&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/03/crocker.jpg?fit=903%2C748&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/03/crocker.jpg?fit=903%2C748&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 13440, "url": "https://estreetshuffle.com/index.php/2019/11/06/roll-of-the-dice-wrong-side-of-the-street/", "url_meta": {"origin": 29310, "position": 5}, "title": "Roll of the Dice: Wrong Side of the Street", "author": "Ken", "date": "November 6, 2019", "format": false, "excerpt": "\"Wrong Side of the Street\" is a lyrical lightweight, but it features a great E Street Band backing track that went unreleased for more than 30 years after it was recorded.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/cycle6.png?fit=1143%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/cycle6.png?fit=1143%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/cycle6.png?fit=1143%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/cycle6.png?fit=1143%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/cycle6.png?fit=1143%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/29310", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=29310"}], "version-history": [{"count": 19, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/29310/revisions"}], "predecessor-version": [{"id": 49938, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/29310/revisions/49938"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/29961"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=29310"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=29310"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=29310"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}