{"uuid": "99f1d72b-f351-4628-b828-f76945d4cfb2", "id": 5817, "date": "2018-12-14T05:00:36", "date_gmt": "2018-12-14T13:00:36", "guid": {"rendered": "http://estreetshuffle.com/?p=5817"}, "modified": "2023-07-16T04:52:36", "modified_gmt": "2023-07-16T11:52:36", "slug": "roll-of-the-dice-incident-on-57th-street", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2018/12/14/roll-of-the-dice-incident-on-57th-street/", "title": {"rendered": "Roll of the Dice: Incident on 57th Street"}, "content": {"rendered": "<p>Bruce recorded &#8220;Incident on 57th Street&#8221; on his 24th birthday.</p>\n<p>Let that sink in while you listen to what is arguably Bruce&#8217;s first songwriting masterpiece:</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Incident on 57th Street\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/ioQcvijom28?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>When I sit down to write these essays, I usually have a hook. An angle, some aspect of the song to approach it from, a lens to view it through. Often it&#8217;s the lyrics, sometimes the music, frequently the history, notable performances, or some other interesting facet.</p>\n<p>&#8220;Incident on 57th Street&#8221; though&#8230; the entire song is the hook.</p>\n<p>Everything about it is perfect: the lyrics, in which Bruce finally cements the marriage of brilliant imagery with clear storyline (a balance he never quite struck before); the music, in which every band member, every instrument adds as much to the story as do Bruce&#8217;s vocals; the arrangement, which has held up through the decades without the slightest hint of datedness.</p>\n<p>Ask a thousand Springsteen fans for their top five Springsteen songs, and you&#8217;ll get a thousand different answers. But odds are that &#8220;Incident&#8221; will have the highest hit rate.</p>\n<p>Bruce had certainly floated with &#8220;epic&#8221; storytelling before. One might argue, for instance, that &#8220;<a href=\"http://estreetshuffle.com/index.php/2018/02/20/roll-of-the-dice-lost-in-the-flood/\">Lost in the Flood</a>&#8221; qualifies as his first on-record epic, but I&#8217;d argue that song is more of a street painting than a story, and that Bruce gets a little lost in metaphor at the expense of connection and clarity. I&#8217;d make a similar argument about &#8220;New York City Serenade,&#8221; sister song to &#8220;Incident&#8221; from the same album side; NYCS has even stronger orchestration than &#8220;Incident&#8221; but oversteps from romantic to pastoral. And there are certainly a number of pre-fame outtakes that show glimmers and glimpses of what was to come but that never quite gel.</p>\n<p>No, &#8220;Incident on 57th Street&#8221; is where Bruce finally nailed what he&#8217;d spent years reaching for. Without it, there would be no &#8220;Jungleland&#8221; (which some posit is a sequel to &#8220;Incident,&#8221; in theme if not in character), no &#8220;<a href=\"https://estreetshuffle.com/index.php/2022/05/14/roll-of-the-dice-backstreets/\">Backstreets</a>,&#8221; no &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/10/03/roll-of-the-dice-racing-in-the-street/\">Racing in the Street</a>.&#8221;</p>\n<p>Let&#8217;s dig in:</p>\n<p>Oh, that introduction.</p>\n<p>Bruce has a knack for crafting distinctive overtures, but there may be no better example than David Sancious&#8217; &#8220;Once upon a time&#8221; opening bars on the piano; Danny Federici&#8217;s escalating organ forming a stairway in front of us, and Bruce&#8217;s spectral, guitar-bending &#8220;follow me&#8221; that leads us onto the story&#8217;s stage.</p>\n<p>We are twenty seconds in, and I am already gobsmacked by this song&#8217;s brilliance.</p>\n<p>When Vini&#8217;s drums usher in the rest of the band, the individual musicians continue to play the same parts that were interwoven throughout the introduction but are now married in tight synchrony, anchored by Garry&#8217;s bass. (We will return to Garry, for he gets a rare moment in the spotlight later.)</p>\n<p>Bruce tells us a tale:</p>\n<p style=\"padding-left: 30px;\"><em>Spanish Johnny drove in from the underworld last night</em><br />\n<em>With bruised arms and broken rhythm in a beat-up old Buick but dressed just like dynamite</em><br />\n<em>He tried sellin&#8217; his heart to the hard girls over on Easy Street</em><br />\n<em>But they sighed, &#8220;Johnny, it falls apart so easy and you know hearts these days are cheap&#8221;</em></p>\n<p>Every word of that opening verse&#8211;of the entire song, really&#8211;is essential and purposeful.</p>\n<p>In four simple lines, we feel like we already know our hero. Johnny is a gigolo from the wrong side of town, but a romantic one: he sells his body to wealthy women, but what he <em>really</em> wants to give is his heart. But his patrons aren&#8217;t buying it: to them, relationships don&#8217;t last long and aren&#8217;t worth the effort. It&#8217;s easier to pay by the hour. (I love how Bruce&#8217;s soaring vocals momentarily fall to earth to capture the blasé dismissal of the Easy Street girls.)</p>\n<p>And while Johnny may be sharply dressed, his life isn&#8217;t an easy one: he&#8217;s a heroin addict (which we know thanks to the tell-tale sign of bruised arms), which is where his money must be going to, because he&#8217;s driving a sputtering heap of a car.</p>\n<p>We&#8217;ve gleaned all this from four lines. Bruce is just getting started. Johnny&#8217;s addiction is getting him in hot water with management:</p>\n<p style=\"padding-left: 30px;\"><em>And the pimps swung their axes and said, &#8220;Johnny, you&#8217;re a cheater&#8221;</em><br />\n<em>Well, the pimps swung their axes and said, &#8220;Johnny, you&#8217;re a liar&#8221;</em></p>\n<p>Again, Bruce&#8217;s vocals are just so perfectly nuanced, dropping almost imperceptibly into character as the pimps leveling their accusations, and then immediately returning to the tale.</p>\n<p style=\"padding-left: 30px;\"><em>And from out of the shadows came a young girl&#8217;s voice</em></p>\n<p>This is a key moment in the story, and Sancious sets it up for us with three brief flourishes.</p>\n<p style=\"padding-left: 30px;\"><em>Said, &#8220;Johnny, don&#8217;t cry&#8221;</em></p>\n<p>Bruce&#8217;s vocal here is gentle, tender. We need to know: to whom does this voice belong?</p>\n<p style=\"padding-left: 30px;\"><em>Puerto Rican Jane, oh, won&#8217;t you tell me what&#8217;s your name</em><br />\n<em>I want to drive you down to the other side of town</em><br />\n<em>Where paradise ain&#8217;t so crowded, there&#8217;ll be action goin&#8217; down on Shanty Lane tonight</em><br />\n<em>All them golden-heeled fairies in a real bitch fight pull thirty-eights and kiss the girls goodnight</em></p>\n<p>The power of this passage is remarkable. Danny&#8217;s organ (possibly David as well, there are two organs in play) comes to the fore, and we feel like the world is spinning as the ill-fated lovers discover each other.</p>\n<p>Johnny is immediately smitten with Jane, (who is also a prostitute, as we&#8217;ll shortly learn) and wants to abscond with her back to the underworld from whence he came. The heat&#8217;s too high on Easy Street, and he&#8217;s in hot water with the axe-swinging pimps. But he knows full well that while they might not be gunning for him specifically in his end of town, it&#8217;s still a pretty dangerous place to work.</p>\n<p>And now we arrive at the first chorus, with Suki Lahav&#8217;s double-tracked backing vocals sounding like a heavenly choir:</p>\n<p style=\"padding-left: 30px;\"><em>Oh, goodnight, it&#8217;s all right, Jane</em><br />\n<em>Now let them black boys in to light the soul aflame</em><br />\n<em>We may find it out on the street tonight, baby</em><br />\n<em>Or we may walk until the daylight, maybe</em></p>\n<p>This is where we learn that Puerto Rican Jane, just like Spanish Johnny, sells her body for a living. Johnny encourages her to work on his side of town, enticing her with stories of a clientele she&#8217;ll actually enjoy doing business with.</p>\n<p>A digression about sex and ethnicity here, because it&#8217;s impossible to discuss the song without acknowledging their significance in &#8220;Incident on 57th Street.&#8221;</p>\n<p>&#8220;Incident&#8221; is a story of two Latino sex workers, and while Bruce doesn&#8217;t exactly romanticize their jobs, he imbues Johnny, at least, with a swagger and a sexual confidence that seems to imply that he&#8217;s more than comfortable in his own skin and his own profession. He also paints African-Americans with a broad brush, certainly romanticizing the johns as skilled enough in the sexual arts as to light a streetwalker&#8217;s soul aflame.</p>\n<p>Forty-five years down the road, we can look back at Bruce&#8217;s choice of language (even then, he was always deliberate&#8211;no word or phrase is without purpose) and perhaps judge him for indulging in stereotype. But ethnically, this is as close to that line as he ever gets, because he immediately pulls the focus back to our two leads and their intense connection. And the choice of profession serves a purpose, because the two of them fall in love as they walk the streets together, looking for work, watching each other&#8217;s back, through the long night and into the morning.</p>\n<p>At the end of the night, the two end up in&#8230; well, we never really learn where, because that&#8217;s not a detail that matters. We just know that they find privacy, a peaceful oasis at her place, his place, or someplace in between. The story continues:</p>\n<p style=\"padding-left: 30px;\"><em>Well, like a cool Romeo he made his moves, ah, she looked so fine</em><br />\n<em>And like a late Juliet she knew he&#8217;d never be true, but then she didn&#8217;t really mind</em><br />\n<em>Upstairs a band was playin&#8217;, the singer was singin&#8217; something about going home</em><br />\n<em>She whispered, &#8220;Spanish Johnny, you can leave me tonight, but just don&#8217;t leave me alone&#8221;</em></p>\n<p>Johnny is all swagger and sweet-talk, but after a night of street-walking and -talking, Jane knows him (and knows men) well enough to know that fidelity may be too much to ask given his nature. She already understands and discounts the demands of the job&#8211;and she alludes to it, asking for his heart knowing that she has to share his body, asking him to always return home to her at the end of every working night.</p>\n<p>(A nod, here, to that wonderful lyric: &#8220;the singer was singin&#8217; something about going home.&#8221; It sounds like a throwaway line, but it actually serves two essential purposes: first, anchoring the lovers so much in each other&#8217;s presence that background details barely register to them; second, establishing a prompt for Jane&#8217;s whispered plea. This is one of my favorite verses.)</p>\n<p>But we already know this story won&#8217;t end well. We know it as soon as Bruce casts them as Romeo and Juliet. Something is about to go down.</p>\n<p>Johnny telegraphs it:</p>\n<p style=\"padding-left: 30px;\"><em>And Johnny cried, &#8220;Puerto Rican Jane, word is down the cops have found the vein&#8221;</em><br />\n<em>Well, them barefoot boys, they left their homes for the woods</em><br />\n<em>Them little barefoot street boys, they said homes ain&#8217;t no good</em><br />\n<em>They left the corners, threw away all of their switchblade knives</em><br />\n<em>And kissed each other goodbye</em></p>\n<p>The cops have tracked down the source of the neighborhood drug scene, and the usual suspects have scattered, leaving the street eerily quiet&#8211;no supply, but an inevitably building demand.</p>\n<p>And now the song elevates from brilliant to masterpiece.</p>\n<p>The street is empty now, and Johnny is lost in thought, wrestling with a dilemma that Bruce never outright states but makes crystal clear nonetheless. The E Street Band disappears, and the soundstage is deserted as the street below. In a rare and stunningly effective move, Garry carries the melody all by himself&#8211;quietly, softly, with Vini&#8217;s haphazard cymbals rolling through the empty street like tumbleweed as his only accompaniment.</p>\n<p style=\"padding-left: 30px;\"><em>Johnny was sittin&#8217; on the fire escape watchin&#8217; the kids playin&#8217; down in the street</em><br />\n<em>He called down, &#8220;Hey, little heroes, summer&#8217;s long, but I guess it ain&#8217;t very sweet around here anymore&#8221;</em><br />\n<em>Janey sleeps in sheets damp with sweat; Johnny sits up alone and watches her dream on, dream on</em><br />\n<em>And the sister prays for lost souls, then breaks down in the chapel after everyone&#8217;s gone</em></p>\n<p><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" data-attachment-id=\"6708\" data-permalink=\"https://estreetshuffle.com/index.php/2018/12/14/roll-of-the-dice-incident-on-57th-street/incidentlyrics/#main\" data-orig-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/12/incidentlyrics.jpg?fit=516%2C650&amp;ssl=1\" data-orig-size=\"516,650\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"incidentlyrics\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/12/incidentlyrics.jpg?fit=238%2C300&amp;ssl=1\" data-large-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/12/incidentlyrics.jpg?fit=516%2C650&amp;ssl=1\" class=\"aligncenter wp-image-6708\" src=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/12/incidentlyrics-238x300.jpg?resize=758%2C955\" alt=\"\" width=\"758\" height=\"955\" srcset=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/12/incidentlyrics.jpg?resize=238%2C300&amp;ssl=1 238w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/12/incidentlyrics.jpg?w=516&amp;ssl=1 516w\" sizes=\"auto, (max-width: 758px) 100vw, 758px\" /></p>\n<p>Johnny may have called down to his compadres (who, by the way, are not children&#8211;their &#8220;play&#8221; is decidedly less innocent), but he&#8217;s really talking to himself. He&#8217;s lost in thought, unable to sleep. The line about the sister praying for lost souls in the nearby chapel&#8211;that&#8217;s not a throwaway line either. It&#8217;s foreshadowing, and because it happens within Johnny&#8217;s earshot and notes it, we know that he knows it&#8217;s foreshadowing, too.</p>\n<p style=\"padding-left: 30px;\"><em>Jane moves over to share her pillow but opens her eyes to see Johnny up and putting his clothes on</em><br />\n<em>She says, &#8220;Those romantic young boys, all they ever want to do is fight&#8221;</em><br />\n<em>Those romantic young boys, they&#8217;re callin&#8217; through the window:</em><br />\n<em>&#8220;Hey, Spanish Johnny, you want to make a little easy money tonight?&#8221;</em></p>\n<p>Again, there&#8217;s much here that draws our attention. Jane wakes from a dream and remarks at the foolishness of young men, and the way she says it, underlined by Suki, tells us that she sees Johnny as being apart from them.</p>\n<p>Which has to make it all the more devastating when they invite Johnny to join them out on the street to fill the vacuum left by the recent police sweep.  Notice how even Garry and Vini stop short for a beat at the question, before returning to sink like Jane&#8217;s heart.</p>\n<p>Johnny is quick to reassure Jane:</p>\n<p style=\"padding-left: 30px;\"><em>And Johnny whispered, &#8220;Goodnight, it&#8217;s all tight, Jane</em><br />\n<em>I&#8217;ll meet you tomorrow night on Lover&#8217;s Lane</em><br />\n<em>We may find it out on the street tonight, baby</em><br />\n<em>Or we may walk until the daylight, maybe&#8221;</em></p>\n<p>That Lover&#8217;s Lane reference is yet another brilliant lyrical touch. On one level, it&#8217;s an ironic euphemism for the gritty street where they ply their trade; on another, it&#8217;s a sincere nickname for the street where they first fell in love through a night of walking and talking. This is one of the most subtly impressive lyrical devices in the entire song, and I think it goes mostly unnoticed to a casual listener.</p>\n<p>Jane doesn&#8217;t believe Johnny, and Johnny doesn&#8217;t believe himself. He repeats his empty reassurance twice, with increasing desperation, until his promise turns into a plea turns into a prayer, his voice wailing but increasingly lost in the rising power of the church organ and choir that end the scene like a Greek chorus, leading us off-stage while Bruce&#8217;s guitar solo ushers in the unfolding violence. We never learn of Johnny&#8217;s fate even though we absolutely know it in our hearts. (Bruce would use this trick again and again over the years.)</p>\n<p>And finally, as we&#8217;re led farther and farther from the street melee, we end our tale with Jane, abandoned and alone, waiting, waiting, as her music box (Sancious on the piano) plays us out, gradually slowing, ebbing like Johnny&#8217;s life to a complete&#8230;. stop.</p>\n<p>Wow. Just&#8230; wow.</p>\n<p>With a song so carefully crafted, it&#8217;s not surprising that Bruce is meticulous about its arrangement in concert as well. But in its early outings, you can hear Bruce experimenting a bit. Or perhaps it&#8217;s just the difference made by an earlier incarnation of the E Street Band.</p>\n<p>In fact, we only have one existing recording of the song performed live by the original E Street Band. Days after their show in Nashville on January 29, 1974, Bruce fired Vini. David Sancious left six months later. So what you&#8217;re about to hear below is the only performance of &#8220;Incident on 57th Street&#8221; with both (or even either of) Lopez and Sancious. Things to note: the extended, ethereal intro, Vini&#8217;s almost-distracting drumming (it&#8217;s a bit too much at times, although perfect in the third verse), Danny&#8217;s powerful presence (he&#8217;s usually more restrained in this song)&#8230;. but the thing that leaps out at us the most is the unique ending. Take a listen:</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - INCIDENT ON 57TH STREET 1974 (audio)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/vi3gv3GLZ3s?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>The next performance to be captured on bootleg was seven months later&#8211;but it was a significant one. When the lights dimmed at showtime and the E Street Band took the stage, they were accompanied by someone new: Suki Lahav, who reprised her studio vocals and added gorgeous violin accompaniment to an absolutely stunning new arrangement. Listen in on the debut of Bruce&#8217;s stripped-down, acoustic &#8220;Incident on 57th Street.&#8221;</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - INCIDENT ON 57th STREET  1974 (audio)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/obc5Z6xUqy0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Suki would join the band as a featured guest performer a month later, and &#8220;Incident&#8221; would remain a setlist showpiece throughout her tenure.</p>\n<p>In February 1975, Bruce and the band played the Main Point in Bryn Mawr, PA, where they opened with &#8220;Incident.&#8221; That single performance&#8211;captured and broadcast on the radio in crystal clarity&#8211;is my personal all-time favorite Springsteen performance. Bar none. Without even a close second. Bruce and Suki are magnificent, and the siren sound effect that closes the song is a beautiful touch&#8211;so perfectly and naturally placed that for many, many years I believed it was real.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen &amp; The E&#039;Street Band Live at the Main Point &#039;75 - Incident On 57th Street\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/Yk8iXy-aw30?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>I still get chills when I listen to that.</p>\n<p>Amazingly, we have <em>video</em> of their performance from the very next night! Too bad the audio isn&#8217;t as clear as it is above, but it&#8217;s still worth viewing:</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Incident on 57th Street - Widener 1975\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/w0IMRkIuBrw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>&#8220;Incident&#8221; remained a frequent setlist highlight throughout the Born to Run, Lawsuit, and Chicken Scratch tours, all the way into the early days of the Darkness Tour.</p>\n<p>But then it disappeared. Between 1978 and 1999, &#8220;Incident&#8221; came out only once (in an arrangement very similar to modern performances), during the year-closing 1980 River Tour stand at Nassau Coliseum. Fortunately, not only was that one-off performance captured on tape, it was captured professionally&#8211;and released on EP in Europe in 1986.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Incident on 57th Street (Live at Nassau Coliseum, Uniondale, NY - December 1980)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/NbmLwUiJ6QA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>For almost twenty years, &#8220;Incident&#8221; went missing in action. Fans began to wonder if they&#8217;d <em>ever </em>hear it again. So imagine the delight of the fans in attendance when Bruce and the E Street Band opened their final Reunion Tour show in Philadelphia with it, as powerful and majestic as ever:</p>\n<div id=\"v-S2mzhjFW-1\" class=\"video-player\"><iframe title='VideoPress Video Player' aria-label='VideoPress Video Player' width='758' height='426' src='https://videopress.com/embed/S2mzhjFW?hd=1&amp;cover=1&amp;loop=0&amp;autoPlay=0&amp;permalink=1&amp;muted=0&amp;controls=1&amp;playsinline=0&amp;useAverageColor=0&amp;preloadContent=metadata' frameborder='0' allowfullscreen data-resize-to-parent=\"true\" allow='clipboard-write'></iframe><script data-jetpack-boost=\"ignore\" src='https://s0.wp.com/wp-content/plugins/video/assets/js/next/videopress-iframe.js'></script></div>\n<p>(It&#8217;s amazing that we have so many well-preserved documents of such a rare song, let alone historically significant ones.)</p>\n<p>Bruce played &#8220;Incident&#8221; a few more times on the Reunion Tour and the holiday shows that followed, but it wasn&#8217;t until the Rising Tour that it made more frequent appearances, getting more than a dozen outings. One of the earliest performances on that tour was a gorgeous solo piano rendition, captured professionally and released on Bruce&#8217;s video document <em>Live in Barcelona. </em>Believe it or not, this 2003 performance was the first time European fans ever got to hear the song performed live on their own continent.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen &amp; The E Street Band - Incident on 57th Street (Live In Barcelona)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/qbRtk9-jcL0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Aside from the brief Vote for Change and Seeger Sessions tours, &#8220;Incident on 57th Street&#8221; hasn&#8217;t missed a tour ever since. It remains a rarity however, only coming out a few times on any given tour, and it remains high on many long-time fans&#8217; chase-list to this day.</p>\n<p>I&#8217;ll leave you with one of Bruce&#8217;s most recent performances, from the show where the 2016 River Tour transformed in to the &#8220;Autobiography&#8221; tour. When Bruce decided to structure his setlists to feature his best work over the years, it was the one time when &#8220;Incident on 57th Street&#8221; absolutely <em>had</em> to be a nightly regular.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Incident On 57th Street (E Rutherford 8/30/16) cam mix video\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/Ez2tGloaHXk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Incident on 57th Street<br />\nRecorded: </strong>September 23, 1973<br />\n<strong>Released: </strong><em>The Wild, The Innocent &amp; The E Street Shuffle</em> (1973)<br />\n<strong>First performed:</strong> October 13, 1973 (Washington, DC)<br />\n<strong>Last performed:</strong> January 22, 2017 (Perth, Australia)</p>\n<p>Looking for your favorite Bruce song? Check our <a href=\"http://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">full index</a>. New entries every week!</p>\n", "protected": false}, "excerpt": {"rendered": "<p>Most artists spend their career working toward a pinnacle like “Incident in 57th Street.” Bruce recorded his on his 24th birthday.</p>\n", "protected": false}, "author": 1, "featured_media": 6667, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [2077, 2078, 60, 1721, 443, 116, 2079], "class_list": ["post-5817", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-dave-sancious", "tag-garry-talent", "tag-incident-on-57th-street", "tag-live-in-barcelona", "tag-suki-lahav", "tag-vini-lopez", "tag-war-ep"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/12/incident.jpg?fit=913%2C719&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-1vP", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 7887, "url": "https://estreetshuffle.com/index.php/2019/03/31/roll-of-the-dice-frankie/", "url_meta": {"origin": 5817, "position": 0}, "title": "Roll of the Dice: Frankie", "author": "Ken", "date": "March 31, 2019", "format": false, "excerpt": "Ah, the elusive, romantic epic \"Frankie.\" She's the one that got away multiple times. It took years, but Bruce and the E Street Band finally did right by her in the studio and on stage. Watch and listen inside.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/03/Frankie-Download-Free-PNG.png?fit=1200%2C750&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/03/Frankie-Download-Free-PNG.png?fit=1200%2C750&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/03/Frankie-Download-Free-PNG.png?fit=1200%2C750&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/03/Frankie-Download-Free-PNG.png?fit=1200%2C750&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/03/Frankie-Download-Free-PNG.png?fit=1200%2C750&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 55588, "url": "https://estreetshuffle.com/index.php/2025/01/14/kingdom-of-days-january-14-2/", "url_meta": {"origin": 5817, "position": 1}, "title": "January 14", "author": "Ken", "date": "January 14, 2025", "format": false, "excerpt": "On this day: the release of High Hopes, the one and only performance of \"Gov. Christie's Traffic Jam,\" and more.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/high-hopes-album-bruce-springsteen-1389043820.jpg?fit=960%2C960&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/high-hopes-album-bruce-springsteen-1389043820.jpg?fit=960%2C960&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/high-hopes-album-bruce-springsteen-1389043820.jpg?fit=960%2C960&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/high-hopes-album-bruce-springsteen-1389043820.jpg?fit=960%2C960&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 56799, "url": "https://estreetshuffle.com/index.php/2025/05/22/kingdom-of-days-may-22-2/", "url_meta": {"origin": 5817, "position": 2}, "title": "Kingdom of Days: May 22", "author": "Ken", "date": "May 22, 2025", "format": false, "excerpt": "Bruce serenades and conducts a sing-along from an Italian balcony, Joe Grushecky joins Bruce for a wildly unpredictable show in Pittsburgh, and more.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/anaheim2000.webp?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/anaheim2000.webp?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/anaheim2000.webp?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/anaheim2000.webp?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/anaheim2000.webp?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 55412, "url": "https://estreetshuffle.com/index.php/2024/12/29/kingdom-of-days-december-29/", "url_meta": {"origin": 5817, "position": 3}, "title": "Kingdom of Days: December 29", "author": "Ken", "date": "December 29, 2024", "format": false, "excerpt": "On this date: Bruce's first show in Ohio, performances destined for Live 1975-85, and an E Street Band guest appearance on Good Morning America. More highlights inside.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/12/NAUSSU_12.29.80_coverTW.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/12/NAUSSU_12.29.80_coverTW.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/12/NAUSSU_12.29.80_coverTW.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/12/NAUSSU_12.29.80_coverTW.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/12/NAUSSU_12.29.80_coverTW.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 61267, "url": "https://estreetshuffle.com/index.php/2025/11/01/kingdom-of-days-november-1-2/", "url_meta": {"origin": 5817, "position": 4}, "title": "Kingdom of Days: November 1", "author": "Ken", "date": "November 1, 2025", "format": false, "excerpt": "Child plays their last show, \"The Ties That Bind\" and \"Fade Away\" make their debut, and the first all-Bruce, all-the-time radio station takes to the airwaves.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/i_pilarz_sirius.jpg?fit=1200%2C681&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/i_pilarz_sirius.jpg?fit=1200%2C681&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/i_pilarz_sirius.jpg?fit=1200%2C681&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/i_pilarz_sirius.jpg?fit=1200%2C681&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/i_pilarz_sirius.jpg?fit=1200%2C681&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 5779, "url": "https://estreetshuffle.com/index.php/2018/11/28/where-the-band-was-milan-november-28-2007/", "url_meta": {"origin": 5817, "position": 5}, "title": "Where the Band Was: Milan, November 28, 2007", "author": "Ken", "date": "November 28, 2018", "format": false, "excerpt": "My first show in Milano hooked me on Italian shows forever--once I managed to survive getting inside.", "rel": "", "context": "In &quot;Where the Band Was&quot;", "block_context": {"text": "Where the Band Was", "link": "https://estreetshuffle.com/index.php/category/where-the-band-was/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/milanmagic.png?fit=1000%2C1000&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/milanmagic.png?fit=1000%2C1000&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/milanmagic.png?fit=1000%2C1000&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/milanmagic.png?fit=1000%2C1000&ssl=1&resize=700%2C400 2x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/5817", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=5817"}], "version-history": [{"count": 19, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/5817/revisions"}], "predecessor-version": [{"id": 44242, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/5817/revisions/44242"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/6667"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=5817"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=5817"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=5817"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}