{"uuid": "19b0886a-30e6-484e-a654-6c0ffeb1bf96", "id": 583, "date": "1987-01-09T11:00:33", "date_gmt": "1987-01-09T19:00:33", "guid": {"rendered": "http://estreetshuffle.com/?p=583"}, "modified": "2025-11-22T16:34:40", "modified_gmt": "2025-11-23T00:34:40", "slug": "roll-of-the-dice-brilliant-disguise", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/1987/01/09/roll-of-the-dice-brilliant-disguise/", "title": {"rendered": "Brilliant Disguise"}, "content": {"rendered": "<p><em>God have mercy on the man who doubts what he’s sure of.</em></p>\n<p>That&#8217;s the single greatest last line of any rock song ever (IMO, anyway).</p>\n<p>If you asked me to name my favorite Bruce Springsteen songs, the list would vary by the year, week, or even day. But “Brilliant Disguise” would <em>always</em> be on the list: the lyrics remain among the most powerful he’s ever written, his vocals emotional and soulful, and that video…</p>\n<p>“Brilliant Disguise” arrested me from the moment I first heard it on October 3, 1987, the day it was released as the lead-off single for the <a href=\"https://estreetshuffle.com/index.php/2022/08/08/album-companion-tunnel-of-love/\"><em>Tunnel of Love</em></a> album—mostly because of that last line.</p>\n<p>I was nineteen, and while I knew that line was significant, I had no idea what it meant. I obsessed over the paradox of it and turned it endlessly in my mind as I listened to the song over and over in those first few weeks.</p>\n<p>I wouldn’t really understand the song for several years—until I was as far into my marriage as Bruce was into his at the time he wrote “Brilliant Disguise.” And even then, it proved elusive, as the song shifted in meaning and nuance over time. For decades, that song filled me with a sense of foreboding; today, it feels like a celebration. Like Springsteen’s best songs, “Brilliant Disguise” keeps you company over the years, growing and deepening as you do, too.</p>\n<p>The song starts unambiguously, on the narrator’s wedding day, as the newlyweds share their first moment together… and the first note of mystery sounds:</p>\n<p style=\"padding-left: 30px;\"><em>I hold you in my arms as the band plays</em><br />\n<em> What are those words whispered baby just as you turn away?</em></p>\n<p>The whispered words are probably innocuous: “I love you,” most likely. Or maybe “I’ll be right back.” But on a day when two people are supposed to be one, when you’re sure you know how your partner thinks and feels, it probably registers just a bit when she pulls away and you don’t fully understand why.</p>\n<p style=\"padding-left: 30px;\"><em>I saw you last night out on the edge of town</em><br />\n<em> I wanna read your mind to know just what I&#8217;ve got in this new thing I&#8217;ve found</em></p>\n<p>And now the mystery deepens. What was she doing out there late at night? For that matter, what was <em>he </em>doing? Does the couple really share as much as they think they do?</p>\n<p>(Literary device note: did you catch the “edge of town” reference? It&#8217;s a sly callback to “<a href=\"http://estreetshuffle.com/index.php/2018/04/10/roll-of-the-dice-darkness-on-the-edge-of-town/\">Darkness on the Edge of Town</a>,” a way to imply impending darkness without literally stating it. Also, for all we know, the couple lives at the edge of town, but Bruce knows that the listener invests in the point-of-view character so that he becomes central, and therefore the edge of town is far away. All in all, a very slick trick: Bruce conveys a lot of information in that one line.)</p>\n<p style=\"padding-left: 30px;\"><em>So tell me what I see when I look in your eyes</em><br />\n<em> Is that you baby or just a brilliant disguise</em></p>\n<p>And now the first central conceit (there are two) of the song is established: can we ever truly know someone except for the ways they wish to be known?</p>\n<p>The journey continues from intrigue to suspicion:</p>\n<p style=\"padding-left: 30px;\"><em>I heard somebody call your name from underneath our willow</em><br />\n<em> I saw something tucked in shame underneath your pillow</em></p>\n<p>The imagery is significant in its intimacy: if his wife is seeing someone else, it’s not out on the edge of town now—it’s from underneath <em>their tree</em>, a place obviously full of meaning and significance for them. And whatever it is she hides isn’t locked away, but rather underneath her pillow in the bed that they share, seemingly accessible but unavailable, hidden in the most intimate  of places.</p>\n<p style=\"padding-left: 30px;\"><em>Well I&#8217;ve tried so hard baby but I just can&#8217;t see</em><br />\n<em> What a woman like you is doing with me</em></p>\n<p>…and now we have the final ingredient in this doubt cocktail: insecurity. He’s married out of his league and realize that <a href=\"http://estreetshuffle.com/index.php/2018/01/18/roll-of-the-dice-with-every-wish/\">with every wish, there comes a curse</a>.</p>\n<p style=\"padding-left: 30px;\"><em>Now look at me baby, struggling to do everything right</em><br />\n<em> And then it all falls apart oh when out go the lights</em></p>\n<p>There’s frustration and resentment building, but towards whom? Her? Himself?</p>\n<p>What happens when the lights go out? (It’s possible we find out years later in “<a href=\"https://estreetshuffle.com/index.php/2021/01/23/roll-of-the-dice-when-the-lights-go-out/\">When the Lights Go Out</a>,” written not long after “Brilliant Disguise.”) Has the couple drifted apart? Has the bedroom heat cooled? Or is that all that’s left? It’s unclear, but it doesn’t matter: it’s the lack of recognition that haunts the protagonist.</p>\n<p style=\"padding-left: 30px;\"><em>I&#8217;m just a lonely pilgrim, I walk this world in wealth</em></p>\n<p>When the song came out, rumors and speculation immediately started about the state of Bruce’s marriage to Julianne Phillips. Bruce always denied that the song was autobiographical, but even if you accept the idea of someone writing about an experience so intimate without ever experiencing it, a detail like walking the world in wealth as a lonely pilgrim sure does conjure up the image of a successful touring rock star. In any event, the pair divorced not long after the song came out.</p>\n<p>But now, we come to central truth number two:</p>\n<p style=\"padding-left: 30px;\"><em>I want to know if it&#8217;s you I don&#8217;t trust, &#8217;cause I damn sure don&#8217;t trust myself</em></p>\n<p>…and there it is. That’s the sleeper line of the song. “God have mercy…” may drive the nail home, but this is the real crux of it: does the narrator suspect his wife correctly, or is he just projecting his own fears and insecurities? Is she distancing himself from him, or is he distancing himself from her? Either way, the result is the same:</p>\n<p style=\"padding-left: 30px;\"><em>Now you play the loving woman, I&#8217;ll play the faithful man</em><br />\n<em> But just don&#8217;t look too close into the palm of my hand</em><br />\n<em> Well we stood at the altar, the gypsy swore our future was right</em><br />\n<em> But come the wee, wee hours… maybe, baby, the gypsy lied</em></p>\n<p>(I have to admit that this verse always puzzled me just a bit. I love the gypsy imagery, and it pairs well with the palm-reading warning that precedes it. But that part about standing at the altar… it’s odd to think that a gypsy was at their wedding, and I’ve often wondered what the significance of that detail is. I used to think that it might refer to Steve Van Zandt, who dresses very gypsy-like, and who I assumed was Bruce’s best man at his first wedding. But then I learned that Clarence Clemons played that role, so perhaps I read too much into it.)</p>\n<p>Now Bruce flips the chorus from a question to a warning:</p>\n<p style=\"padding-left: 30px;\"><em>So when you look at me you better look hard and look twice</em><br />\n<em> Is that me baby or just a brilliant disguise</em></p>\n<p>Am I the person you think I am? Do I let you see my true self? Do I shield you from my fears and doubts? Or am I protecting myself?</p>\n<p>…and then we come to that devastating, chilling last couplet, delivered almost as an afterthought as the song fades out:</p>\n<p style=\"padding-left: 30px;\"><em>Tonight our bed is cold</em><br />\n<em> I&#8217;m lost in the darkness of our love</em><br />\n<em> God have mercy on the man who doubts what he&#8217;s sure of.</em></p>\n<p>I may never know what the narrator is really thinking there: Is he convinced that his wife is an open book but can’t help but harbor doubts anyway? Or is he convinced that his wife is a stranger but grasps for signs and signals otherwise? Or is it self-reflection: is it his own love that he’s unsure of?  Does he feel known and recognized by his partner?</p>\n<p>Without exaggeration, there are at least a dozen ways to interpret this song, and it shouldn’t surprise that those new discoveries and interpretation mirror my own journey through life and marriage. Like I wrote earlier, great songs follow us and reflect us as we grow.</p>\n<p>And that’s why years later, I was caught up short by the song again, almost 20 years down the road, when Bruce started performing it acoustically and intimately with his now-wife Patti.</p>\n<p>On the set of VH-1 Storytellers, Bruce confessed, “I guess it sounds like a song of betrayal &#8211; who&#8217;s that person sleeping next to me, who am I? Do I know enough about myself to be honest with that person? But a funny thing happens: songs shift their meanings when you sing them, they shift their meanings in time, they shift their meanings with who you sing them with. When you sing this song with someone you love, it turns into something else…  a reaffirmation of loves’ mysteries, its shadows, frailties and acceptance of those frailties, without which there is no love.”</p>\n<p>Honestly, I didn’t get it, at the time. It still sounded like a song of doubt at its core. But the more I heard them perform it, and more importantly—the more I <em>saw</em> them perform it, the nuance in the song became clear: if you’re lucky enough to make it that far, you someday come to realize that the things you try to hide aren’t really hidden, and of the things you choose to show, some are true and some are just who you want to be. Sometimes the difference is imperceptible, but ultimately it doesn’t matter—because at that point in a shared life, love is much more than the sum of its parts. There will be mysteries and vulnerabilities, but they’ve become an integral part of the relationship rather than an external threat to it.</p>\n<p>At least that’s how it feels to me today. But I won’t be surprised if I have still another take down the road. That’s the way it goes with “Brilliant Disguise.”</p>\n<p>A live staple from 1988 through 1993, “Brilliant Disguise” appeared intermittently but reliably in every tour since 1999, continuing to grow and deepen as it ages.</p>\n<p>However, this may be the only song in Bruce’s catalog for which live performance has been unable to improve on the recorded version. The one sort-of exception: the official video.</p>\n<p>The video for Brilliant disguise is pseudo-live, actually: Bruce sang the vocal live, take after take, accompanied by his recorded instrumental track. The video itself is a minimalist masterpiece, set in a kitchen, where Bruce plays his guitar and sings, staring out at the viewer as the camera draws ever so slowly inward, revealing, ultimately the insecurities and fear at the heart of the song in Bruce’s screen-filling eyes.</p>\n<p>In my mind, the song continues after Bruce stops singing. Watch his eyes, his face after the last line and you&#8217;ll see what I mean. He says a lot without any words at all.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Brilliant Disguise (Official Video)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/idnJnjV_8rg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>(There is a fantastic <a href=\"http://meiertavis.com/archives/1215\">blog post</a> by Meirt Avis, the director of the “Brilliant Disguise” video, providing the full backstory for the video concept, production, and shoot—I highly recommend reading it.)</p>\n<p>If there’s a live performance, I’d recommend, it’d be this one from 1990—the first time he performed the song solo, and the first song performed in concert in more than two years off the road, a divorce, a new pairing, and a new son. Bruce’s voice is in finer shape than I’ve heard before or since, and the emotion of the song comes through nakedly.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Brilliant Disguie (solo acoustic) Bruce Springsteen 11/16/1990 (Christic Benefit)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/03dJ0y_nuXY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>&#8220;Brilliant Disguise&#8221; is ultimately a very personal song, both for the singer and the listener. Your take may differ from mine, as it very likely should. And if so, I&#8217;d love to hear it.</p>\n<p><strong>Brilliant Disguise</strong><br />\n<strong>Recorded</strong>: Early 1987<br />\n<strong>Released</strong>: <a href=\"https://estreetshuffle.com/index.php/2022/08/08/album-companion-tunnel-of-love/\"><em>Tunnel of Love</em> </a>(1987), <em>Greatest Hits</em> (1995), <em>The Essential Bruce Springsteen</em> (2003), <em>Chapter and Verse</em> (2016)<br />\n<strong>First Performed</strong>: October 31, 1987 (Sea Bright, NJ)<br />\n<strong>Last</strong> <strong>Performed</strong>: November 22, 2024 (Vancouver, BC)</p>\n<p>(c) February 6, 2018</p>\n", "protected": false}, "excerpt": {"rendered": "<p>&#8220;Brilliant Disguise&#8221; is a nakedly intimate, exquisitely written, and intensely performed exploration of self-doubt and the mysteries and insecurities of relationships.</p>\n", "protected": false}, "author": 1, "featured_media": 8919, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3, 3604], "tags": [274, 275], "class_list": ["post-583", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "category-tunnel", "tag-brilliant-disguise", "tag-tunnel-of-love"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/bruce-springsteen-brilliant-disguise-cbs-4.jpg?fit=800%2C798&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-9p", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 26516, "url": "https://estreetshuffle.com/index.php/2021/04/15/roll-of-the-dice-leavin-train/", "url_meta": {"origin": 583, "position": 0}, "title": "Roll of the Dice: Leavin&#8217; Train", "author": "Ken", "date": "April 15, 2021", "format": false, "excerpt": "This retread of \"Brilliant Disguise\" (with a bit of \"I'm Goin' Down\") adds nothing original to Bruce's catalog. Cool backing track, though.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/94845279_m.jpg?fit=1200%2C799&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/94845279_m.jpg?fit=1200%2C799&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/94845279_m.jpg?fit=1200%2C799&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/94845279_m.jpg?fit=1200%2C799&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/94845279_m.jpg?fit=1200%2C799&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 36849, "url": "https://estreetshuffle.com/index.php/1987/01/01/album-companion-tunnel-of-love/", "url_meta": {"origin": 583, "position": 1}, "title": "Tunnel of Love", "author": "Ken", "date": "January 1, 1987", "format": false, "excerpt": "Bruce's eighth studio album is the latest to receive the complete Roll of the Dice treatment.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/Tunnel-Of-Love-1507561237-1000x1000-1.jpg?fit=1000%2C1000&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/Tunnel-Of-Love-1507561237-1000x1000-1.jpg?fit=1000%2C1000&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/Tunnel-Of-Love-1507561237-1000x1000-1.jpg?fit=1000%2C1000&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/Tunnel-Of-Love-1507561237-1000x1000-1.jpg?fit=1000%2C1000&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 4778, "url": "https://estreetshuffle.com/index.php/2018/10/17/cover-me-thompson-square-brilliant-disguise/", "url_meta": {"origin": 583, "position": 2}, "title": "Cover Me, Thompson Square: Brilliant Disguise", "author": "Ken", "date": "October 17, 2018", "format": false, "excerpt": "One of my favorite \"Brilliant Disguise\" covers--Thompson Square gets to the heart of the song and its shifting meaning over time.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/thompson.jpg?fit=500%2C500&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 2295, "url": "https://estreetshuffle.com/index.php/2018/05/27/cover-me-the-reason-brilliant-disguise/", "url_meta": {"origin": 583, "position": 3}, "title": "Cover Me, The Reason: Brilliant Disguise", "author": "Ken", "date": "May 27, 2018", "format": false, "excerpt": "A bright, acoustic cover of a dark song by Canadian band, The Reason.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/img.youtube.com/vi/jq0LkOd-TFU/0.jpg?resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 5522, "url": "https://estreetshuffle.com/index.php/2018/11/10/cover-me-ronnie-spector-brilliant-disguise/", "url_meta": {"origin": 583, "position": 4}, "title": "Cover Me, Ronnie Spector: Brilliant Disguise", "author": "Ken", "date": "November 10, 2018", "format": false, "excerpt": "Ronnie Spector does an admirable cover of \"Brilliant Disguise\" -- right up until the coda. You might not be able to unhear that part.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/ronniebruce.jpg?fit=540%2C405&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/ronniebruce.jpg?fit=540%2C405&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/11/ronniebruce.jpg?fit=540%2C405&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 19056, "url": "https://estreetshuffle.com/index.php/2020/06/27/cover-me-tom-mcrae-and-david-ford-brilliant-disguise/", "url_meta": {"origin": 583, "position": 5}, "title": "Cover Me, Tom McRae and David Ford: Brilliant Disguise", "author": "Ken", "date": "June 27, 2020", "format": false, "excerpt": "Brilliant singer-songwriters in their own right, David Ford and Tom McCrae are irresistible when they team up to cover Bruce's \"Brilliant Disguise.\"", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/tomanddavid.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/tomanddavid.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/tomanddavid.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/tomanddavid.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/tomanddavid.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/583", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=583"}], "version-history": [{"count": 14, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/583/revisions"}], "predecessor-version": [{"id": 63528, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/583/revisions/63528"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/8919"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=583"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=583"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=583"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}