{"id": 31153, "date": "2021-11-27T05:00:00", "date_gmt": "2021-11-27T13:00:00", "guid": {"rendered": "https://estreetshuffle.com/?p=31153"}, "modified": "2023-01-03T06:48:11", "modified_gmt": "2023-01-03T14:48:11", "slug": "two-faces-rockaway-the-days", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2021/11/27/two-faces-rockaway-the-days/", "title": {"rendered": "Two Faces: Rockaway the Days"}, "content": {"rendered": "<div class=\"su-box su-box-style-default\" id=\"\" style=\"border-color:#000000;border-radius:3px;\"><div class=\"su-box-title\" style=\"background-color:#333333;color:#FFFFFF;border-top-left-radius:1px;border-top-right-radius:1px\">Editor's Note</div><div class=\"su-box-content su-u-clearfix su-u-trim\" style=\"border-bottom-left-radius:1px;border-bottom-right-radius:1px\">\n<p><span style=\"font-size: 12pt;\"><strong><em>Editor&#8217;s Note:</em></strong></span> <span style=\"font-size: 16px;\"><i>By popular demand, guest blogger Katy Crane returns today with a new <strong>Two Faces</strong> entry. </i></span></p>\n<p><span style=\"font-size: 16px;\"><i>And I do mean popular: Katy&#8217;s <a href=\"https://estreetshuffle.com/index.php/2021/11/04/two-faces-western-stars/\">debut counterpoint</a> to my &#8220;<a href=\"https://estreetshuffle.com/index.php/2020/03/28/roll-of-the-dice-western-stars/\">Western Stars</a>&#8221; Roll of the Dice essay already ranks #3 among this site&#8217;s most-viewed posts of the year!</i></span></p>\n<p><span style=\"font-size: 16px;\"><i>Today, she takes us deep into a much more obscure song: Bruce&#8217;s 1984 outtake, &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/03/15/roll-of-the-dice-rockaway-the-days/\">Rockaway the Days</a>.&#8221;  And once again, Katy&#8217;s take is a very different one from mine<span style=\"font-size: 12pt;\">. Let&#8217;s hear what she has to say&#8230;</span></i></span></p>\n</div></div>\n<p>The 1984 outtake “Rockaway the Days” opens with a poignant little guitar riff, cheerful and reassuring and wistful all at once. Then we hear Springsteen’s voice, telling a grim story with the sing-song cadences of a lullaby:</p>\n<p style=\"padding-left: 40px;\"><em>Billy got out of prison but he wasn’t right<br />\n</em><em>Some like to drink or gamble; Billy liked to fight</em></p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Rockaway The Days (Studio Outtake - 1984)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/eu5sSFAC5-U?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>At times, “Rockaway the Days” can feel like two songs. The verses are flat and detached, more a list of events than a story arc, while the riff and the chorus wash us in empathy and melancholy. The two parts of the song never quite fuse together, and while that may explain why “Rockaway the Days” is an outtake, it also gives it a fascinating strangeness and a central mystery. Who is telling this story, and where does the fault line between the chorus and the verses come from?</p>\n<p>Ken has already explored the links between this song and the earlier outtake “<a href=\"https://estreetshuffle.com/index.php/2021/01/15/roll-of-the-dice-losin-kind/\">Losin’ Kind</a>,” and I can’t improve on that analysis. But there are a few more connections I hear as well. (And as you’ll notice if you’ve read Ken’s piece, he and I have very different takes on what exactly is happening in the chorus.) So if you’ll join me, we’ll take a second look at “Rockaway the Days,” a complex, ambitious song that bridges the gap between the isolation of <em>Nebraska </em>and the desperate search for connection of <em>Born in the U.S.A</em>.</p>\n<p>“Rockaway the Days” is one of Springsteen’s rare third-person stories, and the opening drops us abruptly into the middle of a man’s life. There’s no introduction, no backstory, no insight into Billy’s mind, just a concise summary of his problem. Billy has an addiction to fighting, and prison has done nothing to cure it.</p>\n<p style=\"padding-left: 40px;\"><em>He tracked back to his home state of Maryland<br />\n</em><em>Went to his ma’s mobile home, where she took him in, all right</em></p>\n<p>Again, the narration is oddly flat, yet every detail is telling. The mother’s poverty, the absent father, the words “home state” instead of “home,” the plodding solo journey &#8211; everything tells us we’re watching someone without many chances in life. We learn that Billy’s mother took him in, which tells us two things: that he had to ask, and that there was a chance she might say no.</p>\n<p>Springsteen ends the verse with a casual, soothing “All right,” as if he’s checking in with his listeners, making sure we’re with him. That “all right” leads us into the chorus, where the whole tone of the song changes:</p>\n<p style=\"padding-left: 40px;\"><em>Rockaway the days, rockaway the nights<br />\n</em><em>Gimme something to last me, baby, &#8217;til the morning light<br />\n</em><em>I ain&#8217;t lookin&#8217; for trouble, I ain&#8217;t looking for a fight<br />\n</em><em>Honey rockaway these days, rockaway these nights</em></p>\n<p>We’re no longer in the past; whatever’s happening in the chorus is happening right now. We’re no longer listening to a detached third-person narrative; there’s a real, vulnerable person here now, speaking to us directly, asking for comfort.</p>\n<p>And by “comfort,” of course, I mean sex. This is a song like “Because the Night” and “<a href=\"https://estreetshuffle.com/index.php/2021/01/13/roll-of-the-dice-cover-me/\">Cover Me</a>” and “<a href=\"https://estreetshuffle.com/index.php/2019/08/09/roll-of-the-dice-human-touch/\">Human Touch</a>,” in which a character overwhelmed by the misery of the world turns to sex as a refuge, a way to get through a long, depressing night. Ken hears the singer of “Rockaway the Days” as a maternal figure, and while I disagree, I think he’s pinpointed something central about how this chorus feels. Springsteen&#8217;s voice is gentle, the cadence repetitive and soothing. This is a lullaby of a kind, but a dark one, a lullaby for adults.</p>\n<p>The singer takes up Billy’s story again, running quickly through the big events of his life, his courtship and marriage. (In what may be Springsteen’s laziest rhyme ever, he names Billy’s wife “Mary Dove” so that her name will rhyme with “love.” Oof.)</p>\n<p style=\"padding-left: 40px;\"><em>Billy swore to Mary he&#8217;d always love her so<br />\n</em><em>They were married in the valley where the river flows, all right</em></p>\n<p>Once again we get just the bare facts, a year or two of Billy’s life summed up in a few quick lines. A brief glimpse of a rural community, of church picnics and riverside weddings, of Billy trying to fit into domestic life. Once again Springsteen ends the verse with that gentle “all right” that suggests it’s not all right at all.</p>\n<p>Another chorus, another appeal for human warmth and protection, and then we’re in the longest stretch of Billy’s story, three verses with nothing to break them up. Billy’s compulsion to fight catches up with him, and “fight” turns out to be a mild word for what he does.<em> </em></p>\n<p style=\"padding-left: 40px;\"><em>At a roadside bar Billy argued with a young man<br />\n</em><em>And he settled that argument with a razor in his hand</em></p>\n<p>Billy flees, but unlike his counterparts in “Highway Patrolman” and “Losin’ Kind” and “<a href=\"https://estreetshuffle.com/index.php/2018/03/23/roll-of-the-dice-highway-29/\">Highway 29,</a>” he doesn’t immediately hit the highway. He doesn’t have a car, for one thing, and he’s spent the last few years trying to fit into a community. He turns for refuge not to the open road but to people: his wife, his mother, a neighbor. But it’s too late; all his chances have run out. This time, when he asks to be taken in, no one is going to say yes.</p>\n<p>Billy goes first to Mary, and her reaction tells us something of what life with him must have been like.</p>\n<p style=\"padding-left: 40px;\"><em>With blood on his shirt back to Mary he did run<br />\n</em><em>She sighed &#8220;Billy, oh Billy, what have you done?&#8221;</em></p>\n<p>She’s grieved, but not surprised, and she knows immediately that Billy has hurt someone. Billy tries again at his mother’s house, but doesn’t even get in the door.</p>\n<p style=\"padding-left: 40px;\"><em>He ran to his ma&#8217;s trailer but the lights were dim<br />\n</em><em>He pounded on the door, she wouldn&#8217;t let him in<br />\n</em><em>Up the road to a neighbor&#8217;s house he drew near<br />\n</em><em>They said &#8220;Billy go away, we don&#8217;t want no trouble &#8217;round here&#8221;</em></p>\n<p>What has Billy done already, how many people has he hurt, that his family and friends see him approaching and assume correctly that he’s done something terrible?</p>\n<p>We can see the ending of this story coming already, but the narrator refuses to rush it. He takes us through each detail: the stolen car, the drug-fueled flight, the panicked one-car accident. He shows us the aftermath of Billy’s death: his body being recovered, his mother getting the news, and finally his burial, in the place where he was married a few verses ago.</p>\n<p>The chorus comes back, and now, with Billy’s story complete and finished behind us, we can hear this for what it is: a song of mourning. Not for Billy, exactly, but for a world where grim little stories like this happen every day.</p>\n<p>Then something unexpected happens: the song keeps going. For the first time, that insistent guitar riff drops out, and in the hush of its absence, the narrator reflects on the world he lives in.</p>\n<p style=\"padding-left: 40px;\"><em>Rich man want the power and the seat on the top<br />\n</em><em>Poor man want the money that the rich man got</em></p>\n<p>Sound familiar? Six years before, in “<a href=\"https://estreetshuffle.com/index.php/2019/05/20/roll-of-the-dice-badlands/\">Badlands</a>,” Springsteen sang confidently,</p>\n<p style=\"padding-left: 40px;\"><em>Poor man wanna be rich, rich man wanna be king<br />\n</em><em>And a king ain&#8217;t satisfied till he rules everything<br />\n</em><em>I wanna go out tonight, I wanna find out what I got</em></p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Badlands\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/SDlSCeQXbPo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>And there’s no better encapsulation of the change from <a href=\"https://estreetshuffle.com/index.php/2022/07/05/album-companion-darkness-on-the-edge-of-town/\"><em>Darkness on the Edge of Town </em></a>to <em>Born in the U.S.A.</em> than these two mirror-image verses. In “Badlands,” the singer concluded his neat summary of the class struggle by swaggering out into the night to take his place in it, to find out what he had and try to get more. Six years later, his impulse is exactly the opposite: to draw inward, to retreat into the safety of closed doors and the comfort of another person.</p>\n<p>What other person? We’re about to find out.</p>\n<p style=\"padding-left: 40px;\"><em>Honey, tonight I’m feeling so tired and unsure<br />\n</em><em>Come on in, Mary, shut the light, close the door.</em></p>\n<p>If “Rockaway the Days” were a movie, this would be the moment when the audience collectively gasps. This is a Big Reveal. The singer, lost in his thoughts, hears a knock and turns to answer the door. Who’s that on the other side? Why, it’s our old friend Mary!</p>\n<p>But who exactly is the singer? Is this a flashback to Billy, at an earlier point in his life, before everything went wrong? Or is it someone else, someone who’s in Mary’s life now?</p>\n<p>Either one is possible, but I’m inclined to think it’s the second. I think Springsteen set Billy’s story in the past and the chorus in the present for a reason. I think the words “I ain’t looking for trouble/ I ain’t looking for a fight,” are significant; these are both words explicitly associated with Billy. The narrator is reassuring Mary that he’s not Billy, that she can trust him, that what happened to Billy won’t happen to him.</p>\n<p>This also explains the flatness of the narration, the sense of being shut out of Billy’s thoughts and emotions. The singer doesn’t know Billy; he knows only the bare events of his life. And yet Billy’s story has brushed up against his own, and he’s affected by it, haunted by it.</p>\n<p>Compare this to “<a href=\"https://estreetshuffle.com/index.php/2018/01/11/roll-of-the-dice-working-on-the-highway/\">Wreck on the Highway</a>,” another story with a car crash, a dead young man, and a narrator who has crossed paths with someone else’s tragedy. That song ends with the singer lying awake at night watching his girlfriend sleep, keeping vigil over the things he loves so they don’t slip away. “Rockaway the Days” is “Wreck on the Highway” updated for the <em>Born in the U.S.A.</em> era, a time when that kind of human connection is harder to come by.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Wreck on the Highway\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/D-MthLm7_m0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>As a 1984 outtake, “Rockaway the Days” bridges the gap between two albums. We’ve just come through the dark isolation of <em>Nebraska</em>, and now the characters are starting to reach out, tentatively, for the connections that will tether them to the world again. “Rockaway the Days” is a <em>Nebraska</em> story, as told by a character from <em>Born in the U.S.A</em>. The narrator is depressed and lonely, but he’s asking for help. He’s making contact, however briefly, with another person. And yet he’s preoccupied by someone for whom that kind of contact didn’t work, who had a family and a marriage but couldn’t keep from spiraling out, away from the things that were trying to save him.</p>\n<p>Springsteen gives us a final chorus:</p>\n<p style=\"padding-left: 40px;\"><em>Rockaway the days, rockaway the nights<br />\n</em><em>Gimme something to last me, baby, &#8217;til the morning light<br />\n</em><em>I ain&#8217;t lookin&#8217; for trouble, I ain&#8217;t looking for a fight<br />\n</em><em>Honey rockaway these days, rockaway these nights</em></p>\n<p>And now that we know who these people are, whose tryst we’re witnessing, we can finally see all the emotional layers to it. It’s partly an instinctive response to tragedy: life asserting itself in the face of death. It’s partly self-protection: the singer turning away from a world in which stories like Billy’s happen and taking refuge in sex. But we’re also watching someone trying his hardest not to be Billy, to stay connected, to get through one day at a time for as long as he can.</p>\n<p>“Well, all right,” the narrator sings again, but the soothing quality is gone from his voice. He sounds doubtful now, uncertain, like he’s trying to convince himself of something. “Well, all right.” His voice rises, becomes a question, with a hysterical, yelping edge to it. “Well, all right? <em>Well, all right</em>?&#8221;</p>\n<p>There’s no answer. Just the guitar riff, insistent and wistful, returning one last time to end the song.</p>\n<p>&nbsp;</p>\n", "protected": false}, "excerpt": {"rendered": "<p>Katy Crane returns with a deep dive into Bruce&#8217;s 1984 outtake.</p>\n", "protected": false}, "author": 1, "featured_media": 25971, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3326], "tags": [3353, 3129], "class_list": ["post-31153", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-two-faces", "tag-katy-crane", "tag-rockaway-the-days"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/rockaway.jpg?fit=1200%2C675&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-86t", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 25700, "url": "https://estreetshuffle.com/index.php/2021/03/15/roll-of-the-dice-rockaway-the-days/", "url_meta": {"origin": 31153, "position": 0}, "title": "Roll of the Dice: Rockaway the Days", "author": "Ken", "date": "March 15, 2021", "format": false, "excerpt": "This under-the-radar Born in the U.S.A. outtake is the darkest in Bruce's \"car crash song\" mini-genre.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/rockaway.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/rockaway.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/rockaway.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/rockaway.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/rockaway.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 31270, "url": "https://estreetshuffle.com/index.php/2021/12/06/two-faces-cynthia/", "url_meta": {"origin": 31153, "position": 1}, "title": "Two Faces: Cynthia", "author": "Ken", "date": "December 6, 2021", "format": false, "excerpt": "Katy Crane explains why \"Cynthia\" is a feminist rewrite of Roy Orbison's \"Oh, Pretty Woman.\"", "rel": "", "context": "In &quot;Two Faces&quot;", "block_context": {"text": "Two Faces", "link": "https://estreetshuffle.com/index.php/category/two-faces/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/09/womanwalking2.gif?fit=500%2C500&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 30616, "url": "https://estreetshuffle.com/index.php/2021/11/04/two-faces-western-stars/", "url_meta": {"origin": 31153, "position": 2}, "title": "Two Faces: Western Stars", "author": "Ken", "date": "November 4, 2021", "format": false, "excerpt": "Introducing guest-blogger Katy Crane in her first of hopefully many appearances. Today she offers a counter-take to my interpretation of \"Western Stars.\"", "rel": "", "context": "In &quot;Two Faces&quot;", "block_context": {"text": "Two Faces", "link": "https://estreetshuffle.com/index.php/category/two-faces/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/f23405-20190425-bruce-springsteen-western-stars.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/f23405-20190425-bruce-springsteen-western-stars.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/f23405-20190425-bruce-springsteen-western-stars.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/f23405-20190425-bruce-springsteen-western-stars.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/f23405-20190425-bruce-springsteen-western-stars.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 55578, "url": "https://estreetshuffle.com/index.php/2025/01/12/kingdom-of-days-january-12/", "url_meta": {"origin": 31153, "position": 3}, "title": "January 12", "author": "Ken", "date": "January 12, 2025", "format": false, "excerpt": "Youngstown in Youngstown, an all-star HOF jam, and a secret gig at the White House are among this day's highlights.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/2017-0112.jpg?fit=939%2C448&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/2017-0112.jpg?fit=939%2C448&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/2017-0112.jpg?fit=939%2C448&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/2017-0112.jpg?fit=939%2C448&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 30170, "url": "https://estreetshuffle.com/index.php/2021/10/13/cover-me-damien-jurado-and-rosie-thomas-wages-of-sin/", "url_meta": {"origin": 31153, "position": 4}, "title": "Cover Me, Damien Jurado and Rosie Thomas: Wages of Sin", "author": "Ken", "date": "October 13, 2021", "format": false, "excerpt": "Damien Jurado and Rosie Thomas turn Bruce's haunting outtake into the dance of distrust it was always meant to be.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/4066101_so.jpg?fit=1080%2C1070&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/4066101_so.jpg?fit=1080%2C1070&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/4066101_so.jpg?fit=1080%2C1070&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/4066101_so.jpg?fit=1080%2C1070&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/4066101_so.jpg?fit=1080%2C1070&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 21112, "url": "https://estreetshuffle.com/index.php/2020/10/10/roll-of-the-dice-seeds/", "url_meta": {"origin": 31153, "position": 5}, "title": "Roll of the Dice: Seeds", "author": "Ken", "date": "October 10, 2020", "format": false, "excerpt": "Will the real \"Seeds\" please stand up? Let's take a listen to the many forms of this unreleased but vital entry in the Springsteen catalog.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/seeds.jpg?fit=1033%2C800&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/seeds.jpg?fit=1033%2C800&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/seeds.jpg?fit=1033%2C800&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/seeds.jpg?fit=1033%2C800&ssl=1&resize=700%2C400 2x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/31153", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=31153"}], "version-history": [{"count": 8, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/31153/revisions"}], "predecessor-version": [{"id": 40584, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/31153/revisions/40584"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/25971"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=31153"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=31153"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=31153"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}