{"id": 51596, "date": "1984-01-12T11:05:00", "date_gmt": "1984-01-12T19:05:00", "guid": {"rendered": "https://estreetshuffle.com/?p=51596"}, "modified": "2026-02-18T14:42:57", "modified_gmt": "2026-02-18T22:42:57", "slug": "roll-of-the-dice-glory-days", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/1984/01/12/roll-of-the-dice-glory-days/", "title": {"rendered": "Glory Days"}, "content": {"rendered": "<blockquote><p><span style=\"font-size: 14pt;\">   &#8220;The first verse actually happened. The second verse mostly happened, and the third verse, of course, is happening now.&#8221;  <em>&#8211;Bruce Springsteen, Greatest Hits, 1994</em></span></p></blockquote>\n<p>That was thirty years ago.</p>\n<p>As I write this, Bruce Springsteen should be on stage in Milan at San Siro, a venue of Springsteenian glory if ever there was one.</p>\n<p>Instead, he&#8217;s recuperating from losing his voice and taking ill after performing in a torrential downpour in Sunderland two weeks ago.</p>\n<p>Add four more shows to the list of postponements that have plagued Bruce&#8217;s 2023-2024 World Tour: a dozen due to peptic ulcer disease, a pair of Philly shows scuttled last minute due to illness, three from the tour&#8217;s first leg, and now four European shows.</p>\n<p>Even the shows that go on sometimes aren&#8217;t always hitch-less: in Amsterdam, Bruce fell and had to be helped up.</p>\n<p><iframe loading=\"lazy\" title=\"Bruce Springsteen falls on stage while performing in Amsterdam\" width=\"563\" height=\"1000\" src=\"https://www.youtube.com/embed/V1SDWUdIolE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></p>\n<p>And in Kilkenny, he had to stop the show when he realized he was physically incapable of escaping the pit.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/kVyG3Lf_Fvg?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>It&#8217;s been a decade since Bruce last scheduled his shows on back-to-back nights; now he needs at least three days to recover between shows.</p>\n<p>He didn&#8217;t dare attempt his customary knee slide during &#8220;Waitin&#8217;<a href=\"https://estreetshuffle.com/index.php/2019/09/27/roll-of-the-dice-waitin-on-a-sunny-day/\"> on a Sunny Day</a>&#8221; in Sunderland. He no longer mounts pianos during &#8220;Tenth Avenue Freeze-Out.&#8221; His hair is thinner, his body leaner. He moves less but breathes harder than in tours of yesteryear.</p>\n<p>And yet each night, at the end of a setlist laced with loss and remembrance, Bruce Springsteen and the E Street Band launch into a song that rings with wry and raucous irony.</p>\n<p>Or does it?</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/6vQpW9XRiyM?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>&#8220;Glory Days&#8221; is of course associated with Bruce&#8217;s <em>Born in the U.S.A.</em> period, reaching #5 on the Billboard Hot 100 at the peak of his glory days in the summer of 1985. But it actually dates back to the <em>Nebraska </em>era. That might surprise, given the song&#8217;s lyrical lightness and unmistakably eighties pop sound, but Springsteen&#8217;s original 1981 acoustic home demo reveals a much darker origin.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/HAMpifa4sko?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>We can only guess (until we get a chance to ask him) that &#8220;Glory Days&#8221; wasn&#8217;t the song&#8217;s original title, and nostalgia certainly wasn&#8217;t its central conceit.</p>\n<p>This early version of &#8220;Glory Days&#8221; was most likely titled &#8220;Stockton,&#8221; a name which punctuates its brief chorus (a chorus in which the phrase &#8220;glory days&#8221; never appears). Stockton is a death trap of a town, a town full of losers who never pull out.</p>\n<p>We recognize the first verse, with its washed-up high school hero. The second verse, while unfamiliar to us in context of the 1985 hit single, clearly walks well-trod <em>Darkness on the Edge of Town </em>and <em>Nebraska </em>ground.</p>\n<p>By the time Bruce finished the song and brought it to the E Street Band to record, &#8220;Stockton&#8221; had shed most of its darker shading and evolved into a song of wistful nostalgia.</p>\n<p>Mostly anyway. Although he wisely dropped the song&#8217;s location, allowing it to resonate more broadly than it might have otherwise, Bruce couldn&#8217;t bring himself to drop the verse about his dad until the last minute.</p>\n<p style=\"padding-left: 40px;\"><em>My old man worked 20 years on the line and they let him go</em><br />\n<em>Now everywhere he goes out looking for work they just tell him that he&#8217;s too old</em><br />\n<em>I was 9 years old when he was working at the Metuchen Ford plant assembly line</em><br />\n<em>Now he just sits on a stool down at the Legion Hall, but I can tell what&#8217;s on his mind</em></p>\n<p>It actually made it to the final recording&#8211;you can hear it below, before it was edited out of the released track.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/kOiJXGPZ80Y?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>Even though it was dropped from the final cut, that verse featured one of three true (or &#8220;mostly true&#8221;) vignettes that inspired the song.</p>\n<p>The first one was from eight years earlier.</p>\n<p style=\"padding-left: 40px;\"><em>I had a friend was a big baseball player back in high school</em><br />\n<em>He could throw that speedball by you, make you look like a fool boy</em><br />\n<em>Saw him the other night at this roadside bar, I was walking in, he was walking out</em><br />\n<em>We went back inside, sat down, had a few drinks, but all he kept talking about was glory days</em></p>\n<p>Joe DePugh and Bruce Springsteen were childhood friends and little league teammates in Freehold, New Jersey. Bruce and Joe shared a love of the game, but their athletic skills were worlds apart. Joe developed into a high school sports star, courted by colleges and invited to try out for the Los Angeles Dodgers. And Bruce&#8230; well, let&#8217;s just say he earned an appropriate yet affectionate nickname from his friend: &#8220;Saddie.&#8221;</p>\n<p>DePugh went off to college in Pennsylvania, but by the time he graduated both of his parents had passed away. He became his younger brothers&#8217; legal guardian, and DePugh re-established his roots in New Jersey. Joe supported his family as a contractor and substitute teacher, playing sports in local leagues on summer evenings.</p>\n<p>One night in 1973, Joe joined his basketball buddies  for a post-game dinner at The Headliner, a local bar in Neptune. At around 9:30pm, he was walking out when a long-lost familiar face came walking in. Joe turned around and accompanied his old friend to the bar, where he and Saddie Springsteen reminisced about old glories (mostly Joe&#8217;s) and ignominies (mostly Bruce&#8217;s).</p>\n<p>&#8220;Bruce lost this big game for us one year,&#8221; DePugh told a <em>Palm Beach Post</em> reporter in 2011. &#8220;We stuck him out in right field all the time where you think he&#8217;s out of harm&#8217;s way. But this important game, we had a bunch of guys missing, and we had to play him. In the last inning, the ball went out to him &#8211; it was just a can-of-corn fly ball &#8211; and he dropped it. Actually, it hit him on the head, and we lost the game.&#8221;</p>\n<p>Glory days.</p>\n<p>Although Bruce had walked in with an entourage, the pair talked for hours alone at the bar. Bruce was still a couple years away from his breakout moment, but Joe recalls hearing about his friend&#8217;s two released albums and the time he opened for The Beach Boys. When the bar closed at 1:30am, Joe and Saddie were still talking.</p>\n<p class=\"gnt_ar_b_p\">&#8220;I remember my girlfriend was furious,&#8221; DePugh recollected to the <em>Post. </em>&#8220;This was before cellphones, so I never called her. To this day that woman thinks I was with somebody else that night. I said, &#8216;No, no! It&#8217;s that guy from high school I told you about.'&#8221;</p>\n<p>Bruce and Joe wouldn&#8217;t talk again for more than thirty years.</p>\n<p style=\"padding-left: 40px;\"><em>Well there&#8217;s a girl that lives up the block, back in school she could turn all the boys&#8217; heads</em><br />\n<em>Sometimes on a Friday I&#8217;ll stop by and have a few drinks after she put her kids to bed</em><br />\n<em>Her and her husband Bobby, well, they split up, I guess it&#8217;s two years gone by now</em><br />\n<em>We just sit around talking about the old times, she says when she feels like crying, she starts laughing thinking about glory days</em></p>\n<p>We know who the first verse is about, and we know who the excised verse is about. As for the verse that &#8220;mostly happened&#8221;&#8230; well, Bruce has never volunteered that information.</p>\n<p>We don&#8217;t need to know, though. If the first verse is specific, the second is universal. Not because we all know someone like the pretty girl who peaked in high school, but because we all know what it&#8217;s like to look back on a simpler time before life and living took their toll.</p>\n<p>However, there&#8217;s one mystery about &#8220;Glory Days&#8221; that is (IMHO) worth pondering: what made Bruce thread a recollection about an eight-year-old random encounter with a childhood remembrance of his father and a contemporaneous entres nous with an out-of-his-league former classmate?</p>\n<p>Author Clinton Heylin has a theory, and to my mind it&#8217;s a plausible one.</p>\n<p>In town a day early for his St. Louis show on the original River Tour, Bruce went out driving and ended up at a movie theater, where he saw <em>Stardust Memories. </em>In what has become a well chronicled and often told encounter, Bruce struck up a conversation with a fellow theater-goer and ended up following him home for a late-night dinner.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/ezPRW1wt0NE?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>Bruce&#8217;s post-movie evening with the Satanovskys is well-known among his fans, but less so the impression the film made on Springsteen and (possibly) one of his greatest hits. Midway through the film, Woody Allen&#8217;s character, a famous film director, has a chance encounter with an old childhood friend. Only one of them had found success in life, and Allen is awkwardly apologetic for his good fortune.</p>\n<div id=\"v-RIyIeVxo-1\" class=\"video-player\"><iframe title='VideoPress Video Player' aria-label='VideoPress Video Player' width='758' height='410' src='https://videopress.com/embed/RIyIeVxo?hd=1&amp;cover=1&amp;loop=0&amp;autoPlay=0&amp;permalink=1&amp;muted=0&amp;controls=1&amp;playsinline=0&amp;useAverageColor=0&amp;preloadContent=metadata' frameborder='0' allowfullscreen data-resize-to-parent=\"true\" allow='clipboard-write'></iframe><script data-jetpack-boost=\"ignore\" src='https://s0.wp.com/wp-content/plugins/video/assets/js/next/videopress-iframe.js'></script></div>\n<p>I wouldn&#8217;t be at all surprised if that scene jogged Bruce&#8217;s memory of his run-in with DePugh seven years earlier, because he recorded that acoustic home demo of &#8220;Glory Days&#8221; about six months later.</p>\n<p>It&#8217;s easy to understand why the scene resonated. Although he was still years away from summiting the peak of his own glory, by the River Tour Bruce had become a bona fide rock star. More importantly, he&#8217;d turned thirty, an age which in his profession typically ushered in a downhill run.</p>\n<p>Although it&#8217;s hard to pinpoint the birthdate of any musical genre, one could make a fair argument that both Bruce and rock and roll were born around the same time. It was still a young genre when Bruce signed with his record label, and life and fame hadn&#8217;t been kind to many of the pioneers who influenced him.</p>\n<p>Jimi Hendrix and Buddy Holly both died years before their thirtieth birthdays; John Lennon and Elvis Presley barely made it to 40. (Lennon was almost certainly on Bruce&#8217;s mind during the period he wrote &#8220;Glory Days&#8221;&#8211;the former Beatle was assassinated shortly after Bruce saw <em>Stardust Memories</em>.)</p>\n<p>So we can forgive Bruce for wondering at the ripe age of 31 how many glory days he still had in front of him, and we can feel his carpe diem resolve in the final verse.</p>\n<p style=\"padding-left: 40px;\"><em>Think I&#8217;m going down to the well tonight and I&#8217;m gonna drink till I get my fill</em><br />\n<em>And I hope when I get old I don&#8217;t sit around thinking about it, but I probably will</em><br />\n<em>Yeah just sitting back trying to recapture a little of the glory of</em><br />\n<em>Well but time slips away and leaves you with nothing mister but boring stories of glory days</em></p>\n<p>That first line is often misunderstood by fans who in their mind&#8217;s eye picture the narrator at a local bar, already looking back on his better days. (In their defense, it doesn&#8217;t help that the heavy-rotation MTV video sets that verse in a bar.)</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/NeJrkyzmyS0?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;start=123&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>But while the &#8220;well&#8221; is indeed metaphorical, it&#8217;s not a stand-in for a bottle. To its world-famous author, the well is the concert stage, and to this day each time Bruce steps on it he drinks until he gets his fill, determined to make this day better than the last time he stood here.</p>\n<p style=\"padding-left: 40px;\"><em>Glory days</em><br />\n<em>Well they&#8217;ll pass you by, glory days</em><br />\n<em>In the wink of a young girl&#8217;s eye, glory days</em><br />\n<em>Glory days</em></p>\n<p>Maybe so. But what the singer suspected then and surely knows now, is that if you focus on the best and the beauty of the day in front of you rather than the ones behind you, every day is a glory day.</p>\n<p>When it makes its nightly appearance, &#8220;Glory Days&#8221; is a shared moment for the tens of thousands in attendance, many of whom are well past their own glory days, many yet to reach them.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/iYYl09XNVik?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>For Springsteen, who can&#8217;t possibly help but remember the moments he stood on each stage over the decades, it&#8217;s not just a &#8220;remember when&#8221; moment. It&#8217;s a &#8220;remember <em>now</em> &#8221; moment.</p>\n<p>And if we&#8217;re wise, fully present with phones firmly pocketed, it is for us too.</p>\n<p>During the early years following the song&#8217;s release,  Bruce leaned into the irony of a 35-year-old waxing nostalgic, fully aware of the Peter Pan life he&#8217;d led up to that point.</p>\n<div class=\"jetpack-video-wrapper\"><span class=\"embed-youtube\" style=\"text-align:center; display: block;\"><iframe loading=\"lazy\" class=\"youtube-player\" width=\"758\" height=\"427\" src=\"https://www.youtube.com/embed/qMUxvDBFQYs?version=3&#038;rel=1&#038;showsearch=0&#038;showinfo=1&#038;iv_load_policy=1&#038;fs=1&#038;hl=en-US&#038;autohide=2&#038;wmode=transparent\" allowfullscreen=\"true\" style=\"border:0;\" sandbox=\"allow-scripts allow-same-origin allow-popups allow-presentation allow-popups-to-escape-sandbox\"></iframe></span></div>\n<p>But as the story goes, all boys grow up. Today Bruce plays a Peter who refuses to acknowledge it, winking at us all the while. And it works: in the pit, with backs aching and legs throbbing, the lost boys dance with one swollen foot on either side of the fourth wall.</p>\n<p>As for DePugh, he may never have had his major league glory, but not many people can lay claim to immortality in a Bruce Springsteen song. He was living in Vermont when the song came out, as flabbergasted as the friends and family to whom the story of their Headliner encounter had become legend.</p>\n<p>Joe has dined out on that story ever since, a couple of times with Bruce himself.</p>\n<p>As they left their old haunt Federici&#8217;s after one such dinner in 2008, Bruce turned to him and said, &#8220;Always remember, I love you.&#8221;</p>\n<p>&#8220;Not like some corny Budweiser commercial,&#8221; Joe clarified to the <em>New York Times</em> in 2011, &#8220;but a real sentimental thing.&#8221;</p>\n<p>DePugh was speechless, managing only a feeble &#8220;Thanks, Saddie&#8221; as he watched his old friend walk to his car. But after a beat, he pulled himself together, &#8220;pulled the door open and yelled down to him, &#8216;Sad!'&#8221;</p>\n<p>&#8220;He turned around, and I pointed at him and said, &#8216;I love you, too, and I&#8217;m real proud of you.&#8217; And he just waved.&#8221;</p>\n<p>Glory days.</p>\n<p><iframe title=\"Spotify Embed: Glory Days - feat. Bruce Springsteen and Patti Scialfa\" style=\"border-radius: 12px\" width=\"100%\" height=\"152\" frameborder=\"0\" allowfullscreen allow=\"autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture\" loading=\"lazy\" src=\"https://open.spotify.com/embed/track/5yZg1t3WCLLRv0J167GGzK?si=8f82d1cd8bbf43a2&amp;utm_source=oembed\"></iframe></p>\n<p><strong>Glory Days<br />\nRecorded:</strong> May 5, 1982<br />\n<strong>Released:</strong> <em>Born in the U.S.A. </em>(1984), <em>Greatest Hits </em>(1995), <em>The Essential Bruce Springsteen </em>(2003)<br />\n<strong>First performed:</strong> June 8, 1984 (Asbury Park, NJ)<br />\n<strong>Last performed:</strong> June 24, 2025 (San Sebastian, Spain)</p>\n<p>© June 4, 2024</p>\n", "protected": false}, "excerpt": {"rendered": "<p>   &#8220;The first verse actually happened. The second verse mostly happened, and the third verse, of course, is happening now.&#8221;  &#8211;Bruce Springsteen, Greatest Hits, 1994&hellip;</p>\n", "protected": false}, "author": 1, "featured_media": 51598, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3611, 3], "tags": [2237, 90], "class_list": ["post-51596", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-bitusa", "category-roll-of-the-dice", "tag-born-in-the-u-s-a", "tag-glory-days"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2024/06/s-l1600.jpg?fit=1200%2C1200&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-dqc", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 19185, "url": "https://estreetshuffle.com/index.php/2020/07/10/roll-of-the-dice-hes-guilty-the-judge-song/", "url_meta": {"origin": 51596, "position": 0}, "title": "Roll of the Dice: He&#8217;s Guilty (The Judge Song)", "author": "Ken", "date": "July 10, 2020", "format": false, "excerpt": "\"He's Guilty\" bears the distinction of being the only officially released Steel Mill studio recording, but it was also a reliable nightly crowd pleaser in the band's live shows.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/guilty-stamp-2.png?fit=1200%2C924&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/guilty-stamp-2.png?fit=1200%2C924&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/guilty-stamp-2.png?fit=1200%2C924&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/guilty-stamp-2.png?fit=1200%2C924&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/guilty-stamp-2.png?fit=1200%2C924&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 16170, "url": "https://estreetshuffle.com/index.php/2020/03/08/matr-patti-scialfa-and-bruce-springsteen-loves-glory/", "url_meta": {"origin": 51596, "position": 1}, "title": "MatR: Patti Scialfa and Bruce Springsteen: Loves Glory", "author": "Ken", "date": "March 8, 2020", "format": false, "excerpt": "One time only: Patti Scialfa performs one of her most beautiful and unabashedly romantic songs, with her husband backing her on guitar.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/lovesglory.jpg?fit=964%2C968&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/lovesglory.jpg?fit=964%2C968&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/lovesglory.jpg?fit=964%2C968&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/lovesglory.jpg?fit=964%2C968&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 15954, "url": "https://estreetshuffle.com/index.php/2020/02/09/roll-of-the-dice-glory-road/", "url_meta": {"origin": 51596, "position": 2}, "title": "Roll of the Dice: Glory Road", "author": "Ken", "date": "February 9, 2020", "format": false, "excerpt": "Never recorded, released, or performed, Bruce's legendary \"Glory Road\" provides fascinating insight into the evolution of two of his signature songs. Check out early lyrics and artifacts inside.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/Glory-road-movie-logo.png?fit=1000%2C388&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/Glory-road-movie-logo.png?fit=1000%2C388&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/Glory-road-movie-logo.png?fit=1000%2C388&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/Glory-road-movie-logo.png?fit=1000%2C388&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 691, "url": "https://estreetshuffle.com/index.php/2018/02/16/meeting-across-the-river-bruce-springsteen-and-phish-glory-days/", "url_meta": {"origin": 51596, "position": 3}, "title": "Meeting Across the River: Bruce Springsteen and Phish, &#8220;Glory Days&#8221;", "author": "Ken", "date": "February 16, 2018", "format": false, "excerpt": "Trey and Bruce tear it up at Bonnaroo and close with an epic \"Glory Days.\"", "rel": "", "context": "In &quot;Meeting Across the River&quot;", "block_context": {"text": "Meeting Across the River", "link": "https://estreetshuffle.com/index.php/category/meeting-across-the-river/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/phish.jpg?fit=560%2C375&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/phish.jpg?fit=560%2C375&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/phish.jpg?fit=560%2C375&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 55577, "url": "https://estreetshuffle.com/index.php/2025/01/11/kingdom-of-days-january-11/", "url_meta": {"origin": 51596, "position": 4}, "title": "January 11", "author": "Ken", "date": "January 11, 2025", "format": false, "excerpt": "On this date: The Big Man is born, and Bruce wins a Golden Globe. Plus: video highlights from Springsteen on Broadway.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/01/clarence.jpg?fit=800%2C600&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/01/clarence.jpg?fit=800%2C600&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/01/clarence.jpg?fit=800%2C600&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/01/clarence.jpg?fit=800%2C600&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 61317, "url": "https://estreetshuffle.com/index.php/2025/11/09/kingdom-of-days-november-9-2/", "url_meta": {"origin": 51596, "position": 5}, "title": "Kingdom of Days: November 9", "author": "Ken", "date": "November 9, 2025", "format": false, "excerpt": "\"Santa Ana\" returns after more than three decades away, Nils steals the stage at a Seeger Sessions show in Birmingham, and Bruce debuts a brand new song: \"Yankees Win.\"", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2025/11/bs241109_01.jpg?fit=800%2C800&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2025/11/bs241109_01.jpg?fit=800%2C800&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2025/11/bs241109_01.jpg?fit=800%2C800&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2025/11/bs241109_01.jpg?fit=800%2C800&ssl=1&resize=700%2C400 2x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/51596", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=51596"}], "version-history": [{"count": 26, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/51596/revisions"}], "predecessor-version": [{"id": 67785, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/51596/revisions/67785"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/51598"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=51596"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=51596"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=51596"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}