{"id": 8769, "date": "2019-04-26T05:00:00", "date_gmt": "2019-04-26T12:00:00", "guid": {"rendered": "http://estreetshuffle.com/?p=8769"}, "modified": "2024-07-05T10:46:07", "modified_gmt": "2024-07-05T17:46:07", "slug": "roll-of-the-dice-4th-of-july-asbury-park-sandy", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2019/04/26/roll-of-the-dice-4th-of-july-asbury-park-sandy/", "title": {"rendered": "Roll of the Dice: 4th of July, Asbury Park (Sandy)"}, "content": {"rendered": "<blockquote><p><span style=\"font-size: 14pt;\">[Asbury Park] doesn&#8217;t mean a thing. It&#8217;s just a dumpy town. It doesn&#8217;t mean anything&#8230; I used to go there a lot more than I do now; I&#8217;ve hardly been there this summer at all.<br />\n</span> <span style=\"font-size: 12pt;\">&#8211;Bruce Springsteen to an interviewer in the summer of 1975</span></p></blockquote>\n<p>More than any other song before it, &#8220;4th of July, Asbury Park (Sandy)&#8221; marked the arrival of a truly skilled, nuanced artist. &#8220;Sandy&#8221; is the point at which Bruce&#8217;s rapidly maturing songwriting and arranging talents intersect at full bloom, and the result&#8211;depending on how you choose to hear the song&#8211;can be in turns poignant, hopeful, callous, and hurtful. Any parent of adult children knows what &#8220;soiling the nest&#8221; looks, sounds, and feels like, as do self-aware young adults themselves. It looks, sounds and feels a lot like &#8220;Sandy&#8221; (and also a lot like the pull quote at the top of the article).</p>\n<p>Fans debate the nature and origin of the titular character. Was it Diane, Bruce&#8217;s girlfriend at the time? Was it a one-night stand or short-lived fling? (Diane thought it might be, so evocative was Bruce&#8217;s writing.) Even the artist himself has been known to employ some misdirection, writing in <em>Songs</em> that Sandy is a composite of some of the girls he&#8217;d &#8220;known&#8221; (quotes mine) during his Asbury Park days.</p>\n<p>But for my money, the answer&#8217;s right there in the title: Sandy isn&#8217;t a girl at all. She&#8217;s just a metaphor, an affectionate nickname for the seaside town where Bruce spent much of his formative years and was now restless to escape. Hence the parenthetical.</p>\n<p>Once we realize and acknowledge this, the song becomes achingly poignant and heartfelt. If we cling to the notion of Sandy as a girl, the song&#8217;s narrator becomes insensitive and almost fatuous. (It&#8217;s interesting to note that Bruce is still working his way towards his talent for writing songs that work on multiple levels. Although &#8220;Sandy&#8221; does indeed function as a song about a town or about a girl, the two interpretations run along divergent tracks instead of parallel.)</p>\n<p>But Sandy wasn&#8217;t always about Bruce&#8217;s adopted hometown. Although Brian Hiatt writes in <em>The Stories Behind the Songs</em> that &#8220;Sandy&#8221; traces its origins to the ironic absence of fireworks in Asbury Park on July 4, 1973, evidence suggests that event (or non-event) was merely a catalyst in the song&#8217;s evolution rather than its genesis.</p>\n<p>That&#8217;s because we&#8217;re fortunate enough to have an early draft of Bruce&#8217;s lyrics for &#8220;Sandy,&#8221; and while they are unfortunately undated, we can safely assume they date back at least some months before that early summer night.</p>\n<p>In this draft, we can see that Sandy is not yet a metaphor. Instead, she&#8217;s the girl who moved away, an early prototype of &#8220;<a href=\"http://estreetshuffle.com/index.php/2018/06/19/roll-of-the-dice-bobby-jean/\">Bobby Jean</a>&#8221; perhaps, or a precursor to &#8220;<a href=\"http://estreetshuffle.com/index.php/2018/09/24/roll-of-the-dice-none-but-the-brave/\">None But the Brave</a>.&#8221;</p>\n<p><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" data-attachment-id=\"9657\" data-permalink=\"https://estreetshuffle.com/index.php/2019/04/26/roll-of-the-dice-4th-of-july-asbury-park-sandy/4thofjulyasburypark_early_lyrics/#main\" data-orig-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/04/4thofjulyasburypark_early_lyrics.jpg?fit=643%2C800&amp;ssl=1\" data-orig-size=\"643,800\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"4thofjulyasburypark_early_lyrics\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/04/4thofjulyasburypark_early_lyrics.jpg?fit=241%2C300&amp;ssl=1\" data-large-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/04/4thofjulyasburypark_early_lyrics.jpg?fit=643%2C800&amp;ssl=1\" class=\"aligncenter wp-image-9657\" src=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/04/4thofjulyasburypark_early_lyrics-241x300.jpg?resize=758%2C942\" alt=\"\" width=\"758\" height=\"942\" srcset=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/04/4thofjulyasburypark_early_lyrics.jpg?resize=241%2C300&amp;ssl=1 241w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/04/4thofjulyasburypark_early_lyrics.jpg?w=643&amp;ssl=1 643w\" sizes=\"auto, (max-width: 758px) 100vw, 758px\" /></p>\n<p>In the almost fully formed verse above, we learn that Sandy got bored and moved to the big city.</p>\n<p style=\"padding-left: 40px;\"><em>The bands, the bars, the girls, guitar, the tours</em><br />\n<em>The kids say Sandy left town and moved in with her parents in New York</em><br />\n<em>Since summer was over the lights on the boardwalk dimmed and she got bored</em><br />\n<em>She has a little apartment by the beach, the landlady told me he don&#8217;t live there no more</em><br />\n<em>Since summer&#8217;s gone I don&#8217;t get home much myself anymore</em></p>\n<p>While Bruce never outright states it, it&#8217;s clear that Sandy&#8217;s escape stirs feelings of restlessness in him, and even a visceral sense of being trapped in the life of a working, undiscovered musician:</p>\n<p style=\"padding-left: 40px;\"><em>Poor people got no money, no lights, no heat or gas for their car</em><br />\n<em>They can&#8217;t go no place and they can&#8217;t see where they are</em></p>\n<p>Whenever it was that Bruce wrote these lyrics, he was clearly grappling with the self-awareness that it was time to move on and move away from the town that had meant so much to him, but he couldn&#8217;t quite bring himself to make the break yet.</p>\n<p>By mid-summer 1973, however, Bruce had found his voice for this particular song. While it&#8217;s believed that Bruce had been performing early versions of &#8220;Sandy&#8221; since April (oh, how I wish one of those early performances would turn up on a bootleg), the first recording we can enjoy dates to just a couple of weeks before Bruce went into the studio to record &#8220;Sandy.&#8221; In this performance (just Bruce on guitar with Danny on accordion) from Max&#8217;s Kansas City on July 23, 1973, we can hear the almost final form of the song (the lyrics would change a bit, particularly the final verse), and the arrival of girl-as-metaphor-for-town.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - 4TH OF JULY ASBURY PARK (SANDY) 1973  - audio\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/CdVxk1MGz5g?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Perhaps it&#8217;s in part due to the quiet acoustic nature of the performance, but it&#8217;s also the early lyrics and vocal delivery that tinge this early version of &#8220;Sandy&#8221; with fatalism instead of the determination to leave the town behind that Bruce would infuse into the final version of the song.</p>\n<p>The original instrumental track&#8211;while livelier than the Max&#8217;s performance above&#8211;is still somewhat muted. The track below was recorded in early August 1973, and although Bruce would layer vocals and electric guitar (along with David Sancious&#8217; piano) on top of it, this is the recording that&#8217;s at the core of the finished product:</p>\n<div id=\"v-5WM3xzWL-1\" class=\"video-player\"><iframe title='VideoPress Video Player' aria-label='VideoPress Video Player' width='758' height='426' src='https://videopress.com/embed/5WM3xzWL?hd=1&amp;cover=1&amp;loop=0&amp;autoPlay=0&amp;permalink=1&amp;muted=0&amp;controls=1&amp;playsinline=0&amp;useAverageColor=0&amp;preloadContent=metadata' frameborder='0' allowfullscreen data-resize-to-parent=\"true\" allow='clipboard-write'></iframe><script data-jetpack-boost=\"ignore\" src='https://s0.wp.com/wp-content/plugins/video/assets/js/next/videopress-iframe.js'></script></div>\n<p>If you&#8217;re thinking that something&#8217;s missing (other than the vocals) from the track above, you&#8217;re right&#8211;for my money, the key element, the secret sauce in the backing track of &#8220;4th of July, Asbury Park (Sandy)&#8221; at least as much as Danny&#8217;s accordion is Bruce&#8217;s electric guitar. From the opening notes, Bruce conjures the sound of the shore, his bent guitar notes sounding for all the world like seagulls flying above us.</p>\n<p>Listen to this early-but-getting-late version&#8211;it&#8217;s the same backing track that Bruce would release on <em>The Wild, The Innocent &amp; The E Street Shuffle</em>, but the lyrics are slightly different. (You&#8217;ll hear the difference in the second line.) Still, notice the difference Bruce&#8217;s electric guitar makes&#8211;there&#8217;s a pronounced nostalgia now that was missing from the earlier version.</p>\n<div id=\"v-B2GWw56p-1\" class=\"video-player\"><iframe title='VideoPress Video Player' aria-label='VideoPress Video Player' width='758' height='426' src='https://videopress.com/embed/B2GWw56p?hd=1&amp;cover=1&amp;loop=0&amp;autoPlay=0&amp;permalink=1&amp;muted=0&amp;controls=1&amp;playsinline=0&amp;useAverageColor=0&amp;preloadContent=metadata' frameborder='0' allowfullscreen data-resize-to-parent=\"true\" allow='clipboard-write'></iframe><script data-jetpack-boost=\"ignore\" src='https://s0.wp.com/wp-content/plugins/video/assets/js/next/videopress-iframe.js'></script></div>\n<p>Here&#8217;s the final version that appears on the album. The production is still uneven and somewhat muddy (as is the case with most of Bruce&#8217;s first two albums), but in this case, it&#8217;s part of the charm. If it were any more polished, it would be a lot less effective.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"4th Of July, Asbury Park (Sandy) - Bruce Springsteen (Studio Version)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/KgFHM8HMbWQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>I wrote at the top that &#8220;Sandy&#8221; works a <em>lot</em> better as a town than as a girl; let&#8217;s take a walk through the lyrics, and I&#8217;ll explain what I mean.</p>\n<p>The first verse is deceptively formulaic (for Bruce, anyway). If it&#8217;s the only part of the song we heard, we&#8217;d think this was just another of Bruce&#8217;s street painting songs, all scene and no action:</p>\n<p style=\"padding-left: 40px;\"><em>Sandy, the fireworks are hailing over Little Eden tonight</em><br />\n<em>Forcing a light into all those stony faces left stranded on this warm July</em><br />\n<em>Down in the town, the Circuit&#8217;s full of switchblade lovers, so fast, so shiny, so sharp</em><br />\n<em>As the wizards play down on Pinball Way on the boardwalk way past dark</em><br />\n<em>And the boys from the casino dance with their shirts open like Latin lovers on the shore</em><br />\n<em>Chasing all them silly New York virgins by the score</em></p>\n<p>But even as Bruce sets the stage, there&#8217;s a lot to unpack:</p>\n<p>First, yes, it&#8217;s interesting to note the fireworks reference right off the top given that 1973 was the one year that fireworks were absent from Asbury Park. But I think it&#8217;s the &#8220;Little Eden&#8221; reference that&#8217;s more important here, as it gives us immediate insight into the dual ways in which Bruce viewed Asbury Park at that time: on the surface, it&#8217;s a true paradise for a young musician, but there&#8217;s a hint of sarcasm here as well&#8211;as if the notion of a seaside paradise masks the true face of the town and its inescapable gravitational pull.</p>\n<p>We immediately realize that Bruce is feeling somewhat alienated from his home, even if he never overtly states it. The stony faces of the stranded&#8211;that phrase suggests to us that Bruce considers himself among them, and he underscores it by describing the pinball wizards, the Latin lovers, the New York virgins as if he&#8217;s a detached observer. Which of course, he is, at least emotionally.</p>\n<p>By the time we finish this verse, we start to worry&#8211;just how bleak of a journey are we in for? But immediately, Bruce introduces the chorus, and it&#8217;s one of his most beautiful:</p>\n<p style=\"padding-left: 40px;\"><em>Sandy, the aurora is rising behind us</em><br />\n<em>This pier lights our carnival life forever</em><br />\n<em>Oh, love me tonight, for I may never see you again</em><br />\n<em>Hey, Sandy girl</em><br />\n<em>My, my, baby</em></p>\n<p>I&#8217;ve heard many fans argue that the aurora represents either a real or fictional roller coaster, ferris wheel, or some other immense amusement park ride. But again, I don&#8217;t think so&#8211;I think the reference is literal.</p>\n<p>&#8220;Aurora&#8221; is another word for dawn. Bruce is saying that dawn is approaching, and approaching both him and the town from behind, which means they&#8217;re facing west. That&#8217;s a beautiful notion: it conjures up a beautiful and literal sunrise over the ocean while also making it clear that Bruce is not yet ready to face it. A new day is approaching, and although he&#8217;s resolute to leave, he wants one last night alone, on his own, in his town. His plea for Sandy to love him tonight isn&#8217;t one last hook-up request with a factory girl; it&#8217;s just his desire for one last night reliving his glory days before he follows the rising aurora.</p>\n<p>And for the rest of the song, Bruce wanders the town, lost in thought and memory, the night playing out around him. Bruce was once one of the principal actors, but now he&#8217;s just an observer.</p>\n<p style=\"padding-left: 40px;\"><em>Now, the greasers, ah, they tramp the streets or get busted for sleeping on the beach all night</em><br />\n<em>Them boys in their high heels, ah, Sandy, their skins are so white</em><br />\n<em>And me, I just got tired of hanging in them dusty arcades, banging them pleasure machines</em><br />\n<em>Chasing the factory girls underneath the boardwalk where they all promise to unsnap their jeans</em></p>\n<p>Let&#8217;s pause for a moment to admire Bruce&#8217;s slyness&#8211;notice how he places that phrase &#8220;banging them pleasure machines&#8221; just after the arcade and just above the boardwalk. You can interpret that phrase in reference to either the arcades or the factory girls, but either way it illustrates boredom bordering on disdain and an emotional detachment from the people and places around him. I think it&#8217;s my single favorite lyrical device in the entire song.</p>\n<p>(Let&#8217;s also take a moment to think about how ridiculous the song becomes if we take it literally: It&#8217;s not exactly a wise seduction technique to complain about being bored by all the girls you hooked up with.)</p>\n<p style=\"padding-left: 40px;\"><em>And you know that tilt-a-whirl down on the south beach drag</em><br />\n<em>I got on it last night and my shirt got caught</em><br />\n<em>And they kept me spinning, babe, didn&#8217;t think I&#8217;d ever get off</em></p>\n<p>Those lines seem like just a seaside summer anecdote, but it&#8217;s not. The tilt-a-whirl is just part of the Sandy-as-Asbury conceit, a playful way of describing the hold that the town has on him, and how easy it is to get and stay caught up and trapped in it.</p>\n<p>(Again, if we interpret Sandy as an actual girl, we now have a narrator who has humblebragged about his conquests (including, in the next chorus, his boss&#8217;s daughter, which he remembers with more fondness) and confessed his clumsiness, both as seduction technique.)</p>\n<p>Now we arrive at the third and final verse, and it&#8217;s a curious one. Perhaps no other single verse in any Springsteen song has been as volatile, as changeable as this one.</p>\n<p style=\"padding-left: 40px;\"><em>Sandy, that waitress I was seeing lost her desire for me</em><br />\n<em>I spoke with her last night, she said she won&#8217;t set herself on fire for me anymore</em><br />\n<em>She worked that joint under the boardwalk, she was always the girl you saw bopping down the beach with the radio</em><br />\n<em>The kids say last night she was dressed like a star in one of them cheap little seaside bars, and I saw her parked with lover boy out on the Kokomo</em></p>\n<p>In that first July 1973 live recording above, the waitress is &#8220;them north side angels&#8221; who simply come and go as the weather changes.  In the early studio version from August, &#8220;northern&#8221; angels &#8220;ride that crazy road down from heaven on their Harleys every season.&#8221;</p>\n<p>But here on vinyl, Bruce settles on a waitress working a joint under the boardwalk (um&#8230;) and bopping down the beach with a radio by day, dressed like a star at night.</p>\n<p>Except that not even five months after the song&#8217;s released&#8211;before the album&#8217;s tour had even ended&#8211;Bruce ditched the lyrics and ran back to the angels until Bruce inexplicably switched back to the waitress <em>again </em>31 years later. (The waitress remains part of the song to this day.)</p>\n<p>In any and every version, though, Bruce wraps the final verse with one of his funniest and most telling lines:</p>\n<p style=\"padding-left: 40px;\"><em>Did you hear the cops finally busted Madame Marie for telling fortunes better than they do</em></p>\n<p>What a wonderful line that is: it simultaneously evokes the boardwalk carnival life one final time, honors it by instilling an ironic sense of honesty into something so innately make-believe, and conveys a sense of &#8220;it&#8217;s time to get out of here&#8221; finality that propels the song into the final chorus through a final couplet that succeeds on the nuance of Bruce&#8217;s vocal delivery&#8211;an almost paradoxical mix of resignation, acceptance, and determination:</p>\n<p style=\"padding-left: 40px;\"><em>For me this boardwalk life is through, babe</em><br />\n<em>You ought to quit this scene too</em></p>\n<p>I think the thing that fascinates me the most about &#8220;4th of July, Asbury Park (Sandy)&#8221; is the mix of both deep affection and simmering resentment that Bruce has for Asbury. That resonates with me: when I left my hometown of Philadelphia at about the same age, I remember feeling that curious mix of attachment and repulsion. I think that&#8217;s how we force ourselves to move on when we realize our time is up in a place that we&#8217;ve loved&#8211;we convince ourselves that our home is a place of limitation rather than potential, and we focus on its underbelly rather than its face.</p>\n<p>The quote that opened this essay was from the summer of 1975&#8211;two years after Bruce had written and released his song. He hadn&#8217;t quite made it out yet, and his ambivalence toward the town seems to have hardened into dismissive callousness. But more than four decades on, we know that Bruce chose to re-embrace both his actual and adopted hometowns, so we recognize that quote for what it is&#8211;the coping mechanism of a young man trying to figure out how to co-exist with his past even as he defines his present and future.</p>\n<p>That&#8217;s something we all grapple with&#8211;but not always with the grace and success of Bruce Springsteen.</p>\n<hr />\n<p>Bruce has performed &#8220;4th of July, Asbury Park (Sandy)&#8221; in concert hundreds of times, making it almost impossible to pick out just a few standouts. But I&#8217;ll share two of my favorites, because I think they pair well together.</p>\n<p>The first is from the Darkness Tour in 1978, from Bruce&#8217;s legendary shows at the Capitol Theater in Passaic. I love the clip below in part because of the joy and freedom in his performance. By this time, he&#8217;d successfully established himself as a successful rock star, and even though his vocals are as passionate (or even more so) than ever, there&#8217;s a sense of the artist at peace.</p>\n<p>But I also love this clip for the interplay between Bruce and Danny.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Live at the Capitol Theatre, Passaic, NJ - 19/09/78 - Encores\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/Tg7sAc7rt04?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>There&#8217;s probably no song in Bruce&#8217;s catalog more closely associated with Danny Federici than &#8220;Sandy,&#8221; and with good reason&#8211;it&#8217;s Danny&#8217;s gorgeous accordion performance that transports us to the Jersey Shore every time the E Street Band plays the song.</p>\n<p>Which is what makes the second clip so powerful.</p>\n<p>When Danny was nearing the final days of his battle with melanoma, Bruce invited him to join his bandmates for one final performance, (Danny had left the band to focus on his health months earlier.)</p>\n<p>When Danny took the stage, there wasn&#8217;t really a question in anyone&#8217;s mind what song they were going to play.</p>\n<p>And as they started to play, it became clear to those assembled that at least for that night, &#8220;Sandy&#8221; had a new layer. Watch Bruce&#8217;s face during each chorus, and it&#8217;s clear that he&#8217;s not singing about a girl, and he&#8217;s not singing about a town. And that plea, echoed in sing-along by the crowd, for just one more night&#8230;</p>\n<p>Just one more night.</p>\n<p>And we&#8217;ll love you forever.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"4th Of July, Asbury Park (Sandy) (Live Video Version featuring Danny Federici)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/kB1d0eey5ho?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>4th of July, Asbury Park (Sandy)<br />\nRecorded: </strong>August 9 &#8211; September 23, 1973<br />\n<strong>Released: </strong><em>The Wild, The Innocent &amp; The E Street Shuffle</em> (1973), <em>The Essential Bruce Springsteen </em>(2003), <em>Chapter and Verse</em> (2016)<br />\n<strong>First performed: </strong>April 23, 1973 (Hartford, CT)<br />\n<strong>Last performed: </strong>November 16, 2019 (Asbury Park, NJ)</p>\n<p><span style=\"caret-color: #3d3d3d; color: #3d3d3d; font-family: Lato, sans-serif; font-size: 16px; font-style: normal; font-variant-caps: normal; font-weight: normal; letter-spacing: normal; orphans: auto; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-tap-highlight-color: rgba(26, 26, 26, 0.301961); -webkit-text-size-adjust: 100%; -webkit-text-stroke-width: 0px; background-color: #ffffff; text-decoration: none; display: inline !important; float: none;\">Looking for your favorite Bruce song? Check our </span><a style=\"box-sizing: inherit; border: 0px; font-family: Lato, sans-serif; font-size: 16px; font-style: normal; font-weight: normal; margin: 0px; outline: 0px; padding: 0px; vertical-align: baseline; background-color: transparent; color: #9b59b6; text-decoration: none; font-variant-caps: normal; letter-spacing: normal; orphans: auto; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-tap-highlight-color: rgba(26, 26, 26, 0.301961); -webkit-text-size-adjust: 100%; -webkit-text-stroke-width: 0px;\" href=\"http://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">full index</a><span style=\"caret-color: #3d3d3d; color: #3d3d3d; font-family: Lato, sans-serif; font-size: 16px; font-style: normal; font-variant-caps: normal; font-weight: normal; letter-spacing: normal; orphans: auto; text-align: start; text-indent: 0px; text-transform: none; white-space: normal; widows: auto; word-spacing: 0px; -webkit-tap-highlight-color: rgba(26, 26, 26, 0.301961); -webkit-text-size-adjust: 100%; -webkit-text-stroke-width: 0px; background-color: #ffffff; text-decoration: none; display: inline !important; float: none;\">. New entries every week!</span></p>\n", "protected": false}, "excerpt": {"rendered": "<p>&#8220;4th of July, Asbury Park (Sandy)&#8221; reveals Bruce Springsteen at a crossroads, caught between his attraction to and rejection of his adopted hometown. Backstory, insights, and great performances inside.</p>\n", "protected": false}, "author": 1, "featured_media": 9666, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [1470, 504, 1826], "class_list": ["post-8769", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-4th-of-july-asbury-park-sandy", "tag-danny-federici", "tag-the-wild-the-innocent-and-the-e-street-shuffle"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/04/4thofjulyasburypark_sin-de.jpg?fit=800%2C800&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-2hr", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 2603, "url": "https://estreetshuffle.com/index.php/2018/06/24/cover-me-ben-e-king-4th-of-july-asbury-park-sandy/", "url_meta": {"origin": 8769, "position": 0}, "title": "Cover Me, Ben E. King: 4th of July, Asbury Park (Sandy)", "author": "Ken", "date": "June 24, 2018", "format": false, "excerpt": "Ben E. King gives \"Sandy\" the Drifters treatment, and it works splendidly.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/06/ben-e-king-4th-of-july-asbury-park-sandy-the-right-stuff-e1529355386275.jpg?fit=400%2C400&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 14029, "url": "https://estreetshuffle.com/index.php/2019/11/11/cover-me-jason-heath-and-the-greedy-souls-4th-of-july-asbury-park-sandy/", "url_meta": {"origin": 8769, "position": 1}, "title": "Cover Me, Jason Heath and The Greedy Souls: 4th of July, Asbury Park (Sandy)", "author": "Ken", "date": "November 11, 2019", "format": false, "excerpt": "If Jason Heath and The Greedy Souls' cover of \"4th of July, Asbury Park (Sandy)\" sounds so perfect, maybe it's because of the family connection.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/11/jasonheathngreedysouls.jpg?fit=1024%2C576&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/11/jasonheathngreedysouls.jpg?fit=1024%2C576&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/11/jasonheathngreedysouls.jpg?fit=1024%2C576&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/11/jasonheathngreedysouls.jpg?fit=1024%2C576&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 23065, "url": "https://estreetshuffle.com/index.php/2021/03/17/cover-me-air-supply-4th-of-july-asbury-park-sandy/", "url_meta": {"origin": 8769, "position": 2}, "title": "Cover Me, Air Supply: 4th of July, Asbury Park (Sandy)", "author": "Ken", "date": "March 17, 2021", "format": false, "excerpt": "Did a surprising E Street through-line inspire Air Supply's 1983 cover of Bruce's 1973 classic?", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/airsupply.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/airsupply.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/airsupply.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/airsupply.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/airsupply.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 4182, "url": "https://estreetshuffle.com/index.php/2011/01/20/roll-of-the-dice-jesse/", "url_meta": {"origin": 8769, "position": 3}, "title": "Jesse", "author": "Ken", "date": "January 20, 2011", "format": false, "excerpt": "\"Jesse\" is a lost demo from the pre-Columbia years, but its DNA would turn up later in \"Sandy\" and \"New York City Serenade.\" It's well worth a listen and deserves an official release.", "rel": "", "context": "In &quot;Greetings&quot;", "block_context": {"text": "Greetings", "link": "https://estreetshuffle.com/index.php/category/greetings/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/08/jesse.jpg?fit=550%2C377&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/08/jesse.jpg?fit=550%2C377&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/08/jesse.jpg?fit=550%2C377&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 28158, "url": "https://estreetshuffle.com/index.php/2021/06/21/roll-of-the-dice-girlfriend-blues/", "url_meta": {"origin": 8769, "position": 4}, "title": "Roll of the Dice: Girlfriend Blues", "author": "Ken", "date": "June 21, 2021", "format": false, "excerpt": "This remarkable (and remarkably clear) 1970 blues is marred only by Bruce's cringe-y (but historically significant) on-stage story.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/gfblues.png?fit=1200%2C712&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/gfblues.png?fit=1200%2C712&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/gfblues.png?fit=1200%2C712&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/gfblues.png?fit=1200%2C712&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/gfblues.png?fit=1200%2C712&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 4448, "url": "https://estreetshuffle.com/index.php/2018/09/21/roll-of-the-dice-sherlock-goes-holmes/", "url_meta": {"origin": 8769, "position": 5}, "title": "Roll of the Dice: Sherlock Goes Home", "author": "Ken", "date": "September 21, 2018", "format": false, "excerpt": "Want to know why Bruce Springsteen became known as the \"Fastest Guitar in Asbury Park?\" Listen to this.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/09/sherlock-1.jpg?fit=1000%2C749&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/09/sherlock-1.jpg?fit=1000%2C749&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/09/sherlock-1.jpg?fit=1000%2C749&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/09/sherlock-1.jpg?fit=1000%2C749&ssl=1&resize=700%2C400 2x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/8769", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=8769"}], "version-history": [{"count": 17, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/8769/revisions"}], "predecessor-version": [{"id": 52491, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/8769/revisions/52491"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/9666"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=8769"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=8769"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=8769"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}