{"id": 20444, "date": "2020-10-17T05:00:00", "date_gmt": "2020-10-17T12:00:00", "guid": {"rendered": "http://estreetshuffle.com/?p=20444"}, "modified": "2024-01-02T13:47:10", "modified_gmt": "2024-01-02T21:47:10", "slug": "american-babylon-a-retrospective", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2020/10/17/american-babylon-a-retrospective/", "title": {"rendered": "American Babylon: A Retrospective"}, "content": {"rendered": "<div class=\"su-box su-box-style-default\" id=\"\" style=\"border-color:#000000;border-radius:3px;\"><div class=\"su-box-title\" style=\"background-color:#333333;color:#FFFFFF;border-top-left-radius:1px;border-top-right-radius:1px\">Editor's Note</div><div class=\"su-box-content su-u-clearfix su-u-trim\" style=\"border-bottom-left-radius:1px;border-bottom-right-radius:1px\">\n<p><span style=\"font-size: 12pt;\"><strong><em>Updated November 2, 2021:</em></strong></span> <span style=\"font-size: 16px;\"><i>The 25th anniversary edition of American Babylon is available now, featuring bonus tracks Joe only hinted at during our original July 2020 interview below, and a tremendous live concert recording with Bruce from 1995. Well worth picking up &#8211;get it <a href=\"https://orcd.co/JoeGrusheckyAmericanBabylon25\">here</a>.</i></span></p>\n</div></div>\n<p>In 1993, Bruce Springsteen had just finished a year-long world tour with his new band and was, as the saying goes, between projects.</p>\n<p>It was a good time for a friend to ask him for a favor, and Joe Grushecky needed a favor.</p>\n<p>In 1993, Joe was at a career nadir. Financially struggling and creatively blocked, Joe was working constantly and unable to see a path forward to a new album. At his wife’s suggestion, he called Bruce and asked him if he could help jumpstart a new record by recording a couple of songs with him.</p>\n<p>As a good friend would, Bruce said yes. Over the next year and a half, those couple of songs developed into a full album: Joe’s 1995 Bruce-produced masterpiece, <em>American Babylon, </em>featuring two songs co-written by Bruce and an album full of standout tracks.</p>\n<p><em>American Babylon</em> turns 25 today, and in anticipation of the milestone Joe and I sat down a couple of months ago to take a look back at the making and meaning of his landmark album. While some of this story has been told before, Joe shared new detail and revelations that are sure to raise the eyebrows of both Grushecky and Springsteen fans alike.</p>\n<p>I originally planned to feature excerpts from the interview in a retrospective essay, but our conversation proved too rich and illuminating to cut any of it. So without further ado, let’s take a trip back to <em>American Babylon</em> with Joe Grushecky.</p>\n<hr />\n<p><strong>Ken: First of all, Joe, thanks for making time to talk. I&#8217;ve been looking forward to this conversation for a long time. I&#8217;m a big fan of your music, but <em>American Babylon</em> has a special place for me. It&#8217;s not only my favorite of your albums, it&#8217;s my favorite album that came out that year. It&#8217;s probably one of my favorite albums of that entire decade, and since I don&#8217;t really get a chance very often to say to an artist how much I appreciate their work, I just want to thank you for that.</strong></p>\n<p>Joe: Oh, I&#8217;m glad you liked it!</p>\n<p><strong>I&#8217;m a big fan. So I&#8217;m curious: where does <em>American Babylon</em> rank in <em>your</em> perception of your catalog?</strong></p>\n<p>It&#8217;s near the top. I mean, there was <a href=\"https://estreetshuffle.com/index.php/2020/05/22/have-a-good-time-but-get-out-alive/\"><em>Have a Good Time But Get Out Alive</em></a>, the 40th anniversary edition that we&#8217;re promoting now. That was the record that&#8230; my life began to change with <em>Love’s So Tough</em>, but it <em>really</em> hit a different level with <em>Have a Good Time But Get Out Alive.</em></p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Have a Good Time but... Get out Alive\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/videoseries?list=OLAK5uy_m8XucNiryNwVfJUu1EI206RMqA_KaLTK8\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>But when I made <em>American Babylon</em>, I was down about as far as you could go. I mean <em>nothing</em> was going right. We couldn&#8217;t get an agent. We had put out several good records in a row and nothing happened. Nobody was interested in anything that I was doing, and I was working like crazy. I was playing at least two nights a week, sometimes three. I had a day gig working with these really poorly behaved kids, and then I was teaching GED at night. So I basically was working myself to death.</p>\n<p><em>American Babylon</em> changed things for me in a good way, sort of beginning of an uphill climb again. I was very thankful&#8211;I don&#8217;t know what I&#8217;d have done without that record. I mean I&#8217;d have kept on making music, but it got us a lot of attention again.</p>\n<p>It also cemented my relationship with Bruce. We&#8217;ve been really good friends ever since.</p>\n<p><strong>There&#8217;s a lot of questions I want to ask you about the album and the songs themselves, but since you just brought him up, I&#8217;m curious: you&#8217;ve known Bruce a long time, well before <em>American Babylon</em>. I’ve read different accounts of how you guys first met.</strong></p>\n<p>Well, Steven [Van Zandt] worked on <em>Have a Good Time But Get Out Alive</em>. I probably told you that before.</p>\n<p><strong>Yeah. So it was back on the recording of that.</strong></p>\n<p>Yeah. And Steve would work with us during the day and then go down and work with Bruce at the Power Station later. I can remember him telling us, &#8220;Bruce would really like this record. I&#8217;ve been telling Bruce about this record. He&#8217;d really like your band.&#8221;</p>\n<p>After the initial tracks were done, we took about a two-to-three week break, and then I came back on my own to do overdubs, do some singing, and mixed the record with Mick Ronson and Ian Hunter. Mick was working with Meat Loaf on a follow-up to <em>Bat Out of Hell</em>. And one night when I got to New York, I called Mick, and he said “oh yeah, come down.”</p>\n<p>He was working at the Power Station, and they just had a phenomenal band: Max, Garry, Nicky Hopkins, Davey Johnstone from Elton John&#8217;s band, and Mick Ronson playing guitar. They were cutting tracks with that band, and I was hanging in one room just meeting Mick, figuring out what we&#8217;re going to do the next day. And Steve and Bruce came up, and I had a short conversation with both of them, because they were working.</p>\n<p>That&#8217;s the first time I met Bruce. And I guess he just took a liking to that record. Then what really cemented it was one night in 1982, he came to see us play at Big Man’s West and sat in with us, and we went out after and basically hung out the whole night, and just… you know, why do you become friends with a person? We just hit it off. Same age, same influences, sort of same upbringing, real working-class families.</p>\n<p><iframe title=\"VideoPress Video Player\" aria-label='VideoPress Video Player' width='758' height='426' src='https://videopress.com/embed/vfcrn5r7?hd=0&amp;cover=1' frameborder='0' allowfullscreen allow='clipboard-write'></iframe><script src='https://v0.wordpress.com/js/next/videopress-iframe.js?m=1674852142'></script></p>\n<p><strong>Yeah. It&#8217;s easy to see. I mean, I don&#8217;t know Bruce, but just from what I know about you guys, I can see why you would click and become friends. It&#8217;s another thing, though, to collaborate the way you guys have. Bruce hasn’t really done that with that many people and certainly with no one outside of Steve to the extent that you guys have. I&#8217;d love to know a little bit more about your collaborating relationship. You guys wrote several songs together. How does that work?</strong></p>\n<p>Well, the first one, I went out to Los Angeles. He invited me to Los Angeles, and we did “Chain Smokin&#8217;” and&#8230;</p>\n<p><strong>“<a href=\"http://estreetshuffle.com/index.php/2018/04/03/meeting-across-the-river-joe-grushecky-and-bruce-springsteen-never-be-enough-time/\">Never Be Enough Time</a>,” right?</strong></p>\n<p>Yeah. “Never Be Enough Time,” and I played him a bunch of other songs, but they weren&#8217;t very good. I mean, like I said: I was almost flatlined. I had “<a href=\"https://estreetshuffle.com/index.php/2021/05/25/matr-joe-grushecky-and-bruce-springsteen-chain-smokin/\">Chain Smokin&#8217;,</a>” but the rest of the songs were very forgettable.</p>\n<p>So when the sessions were coming to an end he said, &#8220;You know, you gotta write some better songs. The songs aren&#8217;t very good.&#8221; And he was right. They <em>weren&#8217;t</em> very good songs. He said, &#8220;You write so much better than this. These aren&#8217;t up to any kind of standard.&#8221; They were pretty lousy.</p>\n<p>As fate would have it, I came home and we played a gig somewhere, and one of my old-time fans came up, and he handed me a book called <em>Homestead</em>.</p>\n<p><strong>I was going to ask what prompted you to write that.</strong></p>\n<p>Yeah, he handed me a book called <em>Homestead</em>, and I start reading it. Especially the historical part about the strikes, and all that.</p>\n<p>With the Iron City Houserockers, we had helped establish the first food bank in America, for steel workers. I think it was the first one, and actually Dan Rather did a story on us on CBS News. And through the years, I had become friends with the people who we helped out. So I was familiar with some of the guys, this guy Ron Wyden and Jay Weinberg and Mike Stout. They were the real&#8211;almost radical&#8211;end of the steel workers, the real pro-union guys when the whole thing was collapsing.</p>\n<p>I read the book, and I think it mentioned Bruce. I&#8217;m sure it mentioned Bruce, because he became involved. It also mentioned us, it&#8217;s something we have in common.</p>\n<p>I live in the South Hills of Pittsburgh, and every day when I’d go to work, I go through a tunnel. I had to cross the river in a tunnel, and I can remember coming out of this tunnel, and this song just came to me about Homestead. So I started writing it down, and in the meantime we were going to go to New York to finish those first two songs.</p>\n<p>So I wrote these lyrics, but I just didn&#8217;t have any good music for him. I tried to come up with stuff, and it just wasn&#8217;t happening. So we finished recording “Chain Smokin&#8217;” and “Never Be Enough Time,” and  I thought, at least this is going to get me started again. Right at the end of our session, I pulled out the paper I had in my notebook and I said, &#8220;Hey, you know, if you feel like it… if you get the urge, here&#8217;s some lyrics. I think the lyrics are really good, but I don’t have any good music for it.&#8221;</p>\n<p>So I get back to Pittsburgh, and I go to work. I used to work at a school where we had the worst-behaved kids in eighty different school districts. These kids were just terribly behaved. Most of them were criminals. I had a class of kids where everyone had a P.O. and you were with them all day long. They never changed classes. You had to eat with them, had to take them to the bathroom. It was unrelenting. There were no breaks. It was not a union job for us.</p>\n<p>Well, I had been calling off. I was real honest with my supervisor, and I was telling her, &#8220;Well, I have a chance to go to Los Angeles to record with Bruce Springsteen, and then I have a chance to go to New York.” So I was working, but I was [paid next to nothing] to begin with, and this place was so wild to work in. I mean we were licensed to restrain. It was so crazy. They couldn&#8217;t keep anybody working there.</p>\n<p>And if nothing else, I have a good work ethic. I showed up every day, I did my job, rarely missed. Anyway, so she calls me in the office, this is right before the weekend I go back, and she says &#8220;This is not coming from me, but the head honcho&#8230;&#8221; His name was&#8230; fuck was his name? First name was Dick. I remember, because he was a dick. (laughs)</p>\n<p><strong>We probably want to protect the guilty anyway. [laughs]</strong></p>\n<p>Yeah! [laughs] Anyways, he says, &#8220;If you go to work with Bruce Springsteen again, we&#8217;re firing you.&#8221; And I go, &#8220;What?? Fire me? Are you crazy? You can&#8217;t even get people to work here!&#8221; And I said, &#8220;I&#8217;m taking off without pay.&#8221;</p>\n<p>But for some reason, he had it in for Bruce Springsteen. He did <em>not</em> like Bruce Springsteen, and he didn&#8217;t want me to work with Bruce Springsteen. For whatever reason, I never found out.</p>\n<p>So the following weekend comes, and it&#8217;s Sunday night, and my wife comes and hands me the phone and says it’s Bruce. Bruce goes and starts playing “<a href=\"https://estreetshuffle.com/index.php/2022/06/25/rotd-matr-joe-grushecky-and-bruce-springsteen-homestead/\">Homestead</a>” on the phone. And I said, &#8220;Oh man, that&#8217;s <em>great</em>!&#8221; He said “we got to record this!” I said, &#8220;Oh, that&#8217;s fabulous! When?&#8221; He says, &#8220;Tuesday.&#8221;</p>\n<p>So now I go into work on Monday. Monday night, I call in sick. Now I&#8217;m being a little bit sneaky instead of being honest, because who&#8217;s going to pass up the chance to do that? Lee Ann and I flew up to New York, and somebody picked us up and took us to Bruce&#8217;s in Jersey.</p>\n<p>The next day we get up, and we&#8217;re working on a song in Bruce&#8217;s study. I had my mom and dad at home watching my kids, and in the midst of working on this song… I was a bit nervous, to tell you the truth, because Bruce was using Drop D tuning, and I was not familiar with it at that time. I couldn&#8217;t figure out what the hell he was playing! I should have just asked him, but I guess…I don&#8217;t know, I was almost overwhelmed because Bruce Springsteen is recording one of my songs that we&#8217;re writing together!</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Homestead\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/rNH1lwkS-B8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>So we&#8217;re going over the music that he wrote for this, and Patti comes into his study and she has the phone. (This is pre-cell phone days.) And it&#8217;s my mom. Patti said, &#8220;Your mom wants you to call. She just called and left a message.&#8221; So right away, you think the worst&#8211;you think that somethings wrong with the kids, blah blah blah, something&#8217;s terribly wrong.</p>\n<p><strong>But you were busted!</strong></p>\n<p>Yeah. [laughs] So I called, and she said “Joey,” (she always called me Joey) &#8220;Joey, you gotta call work right away.&#8221; And I said, &#8220;What&#8217;s wrong?&#8221; And my mom said, &#8220;If you don&#8217;t call them in fifteen minutes they&#8217;re firing you.&#8221; I said, &#8220;Get out!&#8221;</p>\n<p>So I called, and Dick got on the phone and he says, &#8220;Where are you?&#8221; And I said, &#8220;Well, you know, I&#8217;m sick.&#8221; He says, “So why didn&#8217;t you answer the phone?” I said, &#8220;Well I was in the bathroom! I&#8217;m sick.&#8221; He said, &#8220;You&#8217;re not with Bruce Springsteen are you?&#8221; And Bruce is two feet away. I said, &#8220;No, I&#8217;m not at Bruce Springsteen&#8217;s. I&#8217;m home in Pittsburgh.&#8221; And then he made me come in with a doctor&#8217;s excuse, so I had to go to my buddy who was a doctor and tell him the whole story and get a doctor&#8217;s excuse. I ended up taking off three days of work just because I was pissed off then, instead of just doing what I had to do.</p>\n<p><strong>That’s really funny. This is the kind of thing that makes me think of the butterfly effect, you know? Little things that have these big ripples. This guy, if you had listened to him, not only would your career have gone a different way….  If you look at Bruce&#8217;s career during the back half of the nineties, it&#8217;s pretty obvious that the work he did with you kind of led him down that <em><a href=\"https://estreetshuffle.com/index.php/2023/06/03/album-companion-the-ghost-of-tom-joad/\">Ghost of Tom Joad</a> </em>path, because you can see a lot of parallels between “<a href=\"https://estreetshuffle.com/index.php/2022/06/25/rotd-matr-joe-grushecky-and-bruce-springsteen-homestead/\">Homestead</a>” and  &#8220;<a href=\"https://estreetshuffle.com/index.php/2023/05/01/roll-of-the-dice-youngstown/\">Youngstown</a>.” And then I remember reading that when he came off of that tour, he reconnected with you and you guys did “<a href=\"http://estreetshuffle.com/index.php/2018/08/27/codeofsilence/\">Code of Silence</a>” and “Another Thin Line.”</strong></p>\n<p>Yep.</p>\n<p><strong>And that kind of bridged him back into his “rock voice.” And so… boy, if you had listened to that guy, it might have single-handedly derailed both of you guys.</strong></p>\n<p>Luckily I didn’t listen to him. I still got a little rebellion left in me!</p>\n<p><strong>I&#8217;m glad! [laughs]</strong></p>\n<p>So I went in and asked for a leave of absence to go out on that October Assault. He wouldn&#8217;t let me take two weeks off! So I said, &#8220;Fuck that, I quit.&#8221; I quit right there. I said, &#8220;I even don&#8217;t know what&#8217;s wrong with you people.&#8221; Like I said, they couldn&#8217;t keep people there. Me and this other older guy, we had the worst of the worst. We had the most terribly behaved kids in the whole school, he and I together. All day long all by ourselves. And his son got really sick, and then his father got really sick, so he kept missing all kinds of work. And I was there by myself, basically holding the fort down and it was almost unspeakable.</p>\n<p>They had something against Bruce Springsteen. I don&#8217;t know what it was.</p>\n<p><strong>That&#8217;s crazy. Hey, can I ask you some questions about the album?</strong></p>\n<p>Sure.</p>\n<p><strong>All right, let&#8217;s start with the title. One of the things that&#8217;s always struck me about <em>American Babylon</em> is that it&#8217;s like two albums in one. Half the songs are love songs, relationship songs. The other half are in the civic or political vein. You could have gone either way with it, but you went both. I&#8217;ve always thought that title tracks or titles make a statement about how you view the work. And you went with <em>American Babylon</em>. Why? What was the significance of that for you?</strong></p>\n<p>Well, probably because of the job I was working in. The kids stole my car the other day. They did! They stole my car, they broke my car, the kids I was working with. I mean right off the bat that&#8217;s a true statement. And I just felt, my god, what&#8217;s the country coming to?&#8221; We had the Rodney King thing going on at that time, and we had just fought the Iraq war (the first one). It just seemed like everything was crazy, and I myself was intimately involved with in some cases horrific stories about maltreatment of children. I had a lot of kids who were just physically, mentally, sexually abused.</p>\n<p>I actually wrote “No Strings Attached” and “<a href=\"https://estreetshuffle.com/index.php/2020/12/11/matr-joe-grushecky-and-bruce-springsteen-american-babylon/\">American Babylon</a>” on the same night. I came home, and I had a lot of slow songs. I thought, I gotta get some rock and roll stuff here. I was really excited by “American Babylon.” I thought I was on to something.</p>\n<p>Before the final recording sessions in L.A., we recorded &#8220;American Babylon&#8221; here in Pittsburgh as a demo. Bruce heard it and said, “man, that’s the title.&#8221; I didn&#8217;t have a title up until then, and I was fishing for one.</p>\n<p><strong>And that&#8217;s the one track that didn&#8217;t have Bruce&#8217;s involvement in it, right?</strong></p>\n<p>No, because I was so excited when I wrote it! I went down to the studio with Rick Witkowski who I always worked with. And we did a version there, and it was just boom, boom, boom, one take&#8211;couple of overdubs for guitar stuff and that was it. That was the record. I hadn&#8217;t planned to do a finished master. I was excited about the song and I wanted to present it to Bruce. He heard it one time, and he said “Here&#8217;s your title track. There&#8217;s no reason to re-record that one.”</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"American Babylon\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/it0MaZc8ewg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>It&#8217;s funny you say that. I&#8217;m flashing back to <a href=\"http://estreetshuffle.com/index.php/2020/05/22/have-a-good-time-but-get-out-alive/\">our <em>Have a Good Time</em> conversation</a> and how when you put those bonus tracks out there was that demo of “Don&#8217;t Let Them Push You Around” that was wildly different from the final version.</strong></p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Dont Let Them Push You Around (Demo)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/39gDr_UAxSU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Do you have any demos lying around of any of the <em>American Babylon</em> material that are significantly different in arrangement or sound compared to the final version?</strong></p>\n<p>No, pretty much not. We were very efficient in that record. That&#8217;s the only song I cut somewhere else. So usually when we were doing the <em>American Babylon</em> stuff, it was just whatever I brought into the studio. The band usually had a pretty good idea of what I wanted to do, because we rehearsed it before we went, before we would go to Los Angeles. We wanted to make our time there as productive as possible.</p>\n<p>With the stuff I did for MCA when I was on Cleveland International, they would actually give me a budget to go do demos, so I would go fish around in the studio. Sometimes I would write stuff right in the studio. It was a whole different approach, but the <em>American Babylon</em> record was pretty much planned out before we went. I mean, with regard to what songs we were going to do. I didn&#8217;t have a lot of&#8230; I wasn&#8217;t on a hot streak then. I didn&#8217;t have a lot of songs that I could just throw out there and see what was going to stick.</p>\n<p><strong>Well, I know the order of recording. I know you started with “<a href=\"https://estreetshuffle.com/index.php/2021/05/25/matr-joe-grushecky-and-bruce-springsteen-chain-smokin/\">Chain Smokin&#8217;</a>” and “Never Be Enough Time”&#8211;which by the way, I think are two of your best songs.</strong></p>\n<p>I’m really happy with both of those.</p>\n<p><strong>I love the fact that “Chain Smokin&#8217;” <em>sounds</em> like someone chain smoking. It’s just… musically tremendous. </strong></p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Chain Smokin&#039;\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/8wQfzwQSSAU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>“Never Be Enough Time” has, I think, my single favorite lyric of yours&#8211;the Miracles and Temptations line, which I think is brilliantly clever in how it works on multiple levels. </strong><strong>I have trouble reconciling how strong those songs are with your statement&#8211;which I absolutely believe&#8211;but it&#8217;s mind-boggling to me that the rest of your songs were so (as you put it) sub-par. Why weren&#8217;t you able to uncork that bottled lightning?</strong></p>\n<p>Well, “Chain Smokin&#8217;” was a song that I&#8217;d been playing around with for a while. I started taking some acoustic gigs, and I was never a “copy” guy. It never appealed to me, first of all, doing a whole night of  covers. And second of all, I was never very good at it. So I had been working on “Chain Smokin&#8217;” for a while, and I just thought it was a <em>really</em> good song.</p>\n<p><strong>It is.</strong></p>\n<p>“Never Be Enough Time” was actually a song that I recorded with the Iron City Houserockers on our last record, <em>Cracking Under Pressure</em>. We did a completely different version of it.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Joe Grushecky &amp; the Houserockers - Never Be Enough Time 1988\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/qh3pAs3LMjM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>So I was playing those two acoustically when I went out to work with Bruce, and I had a couple other songs, but I was just glad that he picked those two.</p>\n<p>We were just going to do “Chain Smokin&#8217;” initially. I knew I had one good song, and the rest of them weren&#8217;t very good. I can&#8217;t even remember what they were. I&#8217;m sure I got them stashed somewhere, but I played them. He said, &#8220;Well… you got anything else?&#8221;</p>\n<p>So I played him “Never Been Enough Time.” And he <em>loved</em> it right off the bat. I said, &#8220;well, I already recorded this one.&#8221; But he said, &#8220;Let&#8217;s hear your version of it.&#8221; So I played him the version we did with the Iron City Houserockers, and then I played the version we were doing now and they were <em>really</em> different. And he said, &#8220;This is a great song.&#8221; I had a blast doing that one.</p>\n<p><strong>You both sounded like you had a blast. I can <em>feel</em> you guys having so much fun there.</strong></p>\n<p>Because we were face to face singing! All these vocals are live, you know. It was a stormy night in Los Angeles, and he had the skylights and the thunder and lightning was going off, and we&#8217;re just standing at this microphone going at it face-to-face.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Joe Grushecky &amp; The Houserockers - Never Be Enough Time\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/6Qe0HaOEKoM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>But like I said, after I did those two, I knew I needed some better songs, because the ones that I had didn&#8217;t stand up. So that&#8217;s it, and I was fortunate enough to come up with “Homestead.” So I had a three-pack that was pretty good.</p>\n<p><strong>By the way, Grzybowski is <em>not </em>an easy name to sing. Was that an Easter egg in “Homestead”? When I was doing research, I found a newspaper reference to a guy at Craig House, where you worked at the time…</strong></p>\n<p>Named Grzybowski.</p>\n<p><strong>Yeah! Is that…?</strong></p>\n<p>His dad worked in Homestead.</p>\n<p><strong>I was wondering where that name came from.</strong></p>\n<p>Well, I grew up in a coal mining town. My family was all coal miners, both sides of the family. My dad dropped out of school when he was twelve years old to work in a coal mine. So he really… I don&#8217;t want to say <em>forced</em> me, but he highly encouraged me to get my education. That&#8217;s why I have a teaching degree. I would never have done it on my own.</p>\n<p>The town we grew up in, the coal mines were dead by the time I was born in that particular area. So all the guys, all the Serbians and Italians, they all worked at Homestead. So in the summer, they&#8217;d have an open house, and they&#8217;d take us. My neighbors would take us down and say, &#8220;look where we work!&#8221;</p>\n<p>It was horrifying. You&#8217;d see all this molten steel and the noise and the dirt, but everybody worked there. So I just picked his name out of a hat. I could have picked a lot of other ones. I just liked the way it sounded and it was so Pittsburgh: Grzybowski.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Dark and Bloody Ground\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/rGL4zbzeclA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Yeah. It works. So you guys you did “Homestead,” and I think you did “Dark and Bloody Ground” at the same time?</strong></p>\n<p>No… I don&#8217;t know if I have a&#8230; Do you have the sequence?</p>\n<p><strong>I do. But I thought those two&#8211;</strong></p>\n<p>We did “Homestead” in November at The Hit Factory, but the next songs we did after that were “Talk Show” and “<a href=\"https://estreetshuffle.com/index.php/2021/09/05/matr-joe-grushecky-bruce-springsteen-and-patti-scialfa-comin-down-maria/\">Comin&#8217; Down Maria.</a>” We did “<a href=\"https://estreetshuffle.com/index.php/2021/06/27/matr-joe-grushecky-and-bruce-springsteen-only-lovers-left-alive/\">Only Lovers Left Alive</a>,” too, but I ended up re-recording that one with the band.</p>\n<p><strong>Okay&#8230; That&#8217;s not what I saw reflected in Brucebase, so this is new info. Brucebase has “Talk Show” and “Comin’ Down Maria” pinned to October &#8217;94, almost a year later, with no mention of “Only Lovers Left Alive.” The chronology I have—and please correct me if I&#8217;m wrong—is October/November &#8217;93, you guys did “Chain Smokin&#8217;” and “Never Be Enough Time,” and there was a February session in &#8217;94 which I thought was “Homestead,” “Dark and Bloody Ground,” and “<a href=\"https://estreetshuffle.com/index.php/2022/05/08/matr-joe-grushecky-and-bruce-springsteen-labor-of-love/\">Labor of Love</a>.”</strong></p>\n<p>No. “Comin&#8217; Down Maria” and “Talk Show” were the next two we did. The Pirates had an All-Star game here in Pittsburgh&#8211;I took my son to the Home Run Derby, and the next day I flew to New Jersey when we worked on those two songs. We also did “<a href=\"https://estreetshuffle.com/index.php/2021/06/27/matr-joe-grushecky-and-bruce-springsteen-only-lovers-left-alive/\">Only Lovers Left Alive</a>,” which Bruce helped arrange and played a long guitar solo on, but ultimately I thought that should be a band song. When I recorded it later with the band, Bruce opted to sit that one out. I have an outtake of it somewhere, though.</p>\n<p><strong>Okay, so this is July ‘94?</strong></p>\n<p>Yeah. And then at some point we didn&#8217;t do anything for a while, and then March ’95, I went out with the band and we finished the record. I went back out in May and did overdubs.</p>\n<p><strong>Okay, so July ’94 for “<a href=\"https://estreetshuffle.com/index.php/2021/09/05/matr-joe-grushecky-bruce-springsteen-and-patti-scialfa-comin-down-maria/\">Comin’ Down Maria</a>,” “Talk Show” and the “Lovers” outtake, and then August for “Dark and Bloody Ground” and “Labor of Love”? Brucebase has those two and a few others pegged to August ’94.</strong></p>\n<p>It wasn’t August. The next time we went out was in March of ‘95. It&#8217;d be before May, because May was my last session with Bruce. We basically finished the record in May. I went out in March with the band and we recorded. I brought “American Babylon” with me, and then we did all the rest of the record.</p>\n<p><strong>And “Dark and Bloody Ground” is another one that you and Bruce wrote together, right?</strong></p>\n<p>Yes. I&#8217;ll tell you the &#8220;Dark and Bloody Ground&#8221; story. We were recording “Homestead” at The Hit Factory, and the assistant engineer came up to me and said, &#8220;Hey, are you from Kentucky?&#8221; And I said no, why do you ask? He said, &#8220;Well the first line is <em>I was born in the corn fields of Kentucky</em> from “Homestead.&#8221;</p>\n<p>I said, &#8220;This guy that I&#8217;m sort of building a character on is from Kentucky, and I&#8217;m just sort of telling his story along with all the people I knew back home that worked in Homestead. He said, &#8220;Did you ever hear of the Kentucky Cycle?” Have <em>you</em> ever heard of the Kentucky Cycle, written by Robert Schenkkan?</p>\n<p><strong>I&#8217;m not familiar with it.</strong></p>\n<p>Okay, well the Kentucky Cycle is a play that was on Broadway. It was a six-hour play, so it didn&#8217;t last too long, but it was about the struggle of land in Kentucky. In American history, the native Americans called Kentucky the dark and bloody ground, because people would fight over it. So in this play, it starts out white man against red man and goes on to the Civil War, the Hatfield-McCoy fights, the coal companies against the miners… It&#8217;s all this struggle, struggle, struggle.</p>\n<p><strong>And you&#8217;re like, “six hours! I can do that in six minutes.”</strong></p>\n<p>Yeah, right. [laughs] So anyways, for some reason I was aware of it. I had read about it. The play had come and gone already, but I was aware of the storyline and the play. Don&#8217;t ask me how, but I knew about it, and this is another one of these moments…</p>\n<p>I get back after recording “Homestead” and I was working at night, like I said. I was working in the day with these emotionally needy kids, and then at night I was teaching people to get their GED. I was still doing it. I went back and they asked me to help for a while.</p>\n<p>Oh, and another thing I&#8217;ve done over the years is I helped establish this library.</p>\n<p>People don&#8217;t know about it, because it&#8217;s so far in the past, but I tell people this should have been the Joe Grushecky Memorial Library. They look at me like I&#8217;m crazy. We had all these books from the Catholic schools that were closing, and I went through thousands and thousands of books, got rid of the old textbooks and kept all the rest and started this library.</p>\n<p>So I was sitting in a desk in this library where I taught GED, and it was my first night back from doing “Homestead,” and I walk in, and there&#8217;s the play sitting on my desk. Sitting right there in front of me and I said, &#8220;Holy shit!&#8221;</p>\n<p>So I took the book home and read it before I gave it back. I probably should have kept it. Anyway, that became the basis of the song. So in my mind, Bruce had to do the music to that one, because of “Homestead.” It was sort of a similar situation. It tied things together for me mentally, so when we were doing the sessions, I gave him the lyrics and I said. &#8220;I got something here that I think would work great for us.&#8221;</p>\n<p>I thought it would be logical. You know, he primarily did the music and I primarily did the lyrics on those two. So he wrote the music for that one. Actually, I got a tape of him singing it somewhere.</p>\n<p><strong>That would be cool to hear someday!</strong></p>\n<p>So that&#8217;s how that came about. And then we just sort of pieced the rest of the record together from the songs that I had written, and like I said, before we went out for the final sessions, I was determined to write some more rock and roll songs, because I was writing all these slower mid-tempo things.</p>\n<p><strong>There are some really great up-tempo songs on that album. “No Strings Attached” is an awesome song. I love that song because it sounds from the title and the sound like it&#8217;s a casual hookup song, but it&#8217;s deeply romantic if you listen to it. That&#8217;s a great one.</strong></p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"No Strings Attached\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/-hrohc583Gc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>And then “Labor of Love,” of course. That&#8217;s a song that you had written on your own. Bruce doesn&#8217;t have any co-writing credit on that. Right?</strong></p>\n<p>Right.</p>\n<p><strong>And yet, there&#8217;s that whole mandolin part—</strong></p>\n[sings the mandolin part]\n<p><strong>&#8211;exactly! That shows up later in “<a href=\"http://estreetshuffle.com/index.php/2018/01/05/roll-of-the-dice-land-of-hope-and-dreams/\">Land of Hope and Dreams</a>.” When I first heard that I was like, &#8220;Whoa! That&#8217;s instantly recognizable.&#8221; Did he ask you if he could use that?</strong></p>\n<p>That was just his bit to begin with. Bruce played that part on guitar and mandolin on “Labor of Love.” We trade ideas back and forth, so we both used it.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Labor of Love\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/DSdpmShd7e4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>How did Patti&#8217;s contribution come about for “Comin&#8217; Down Maria”?</strong></p>\n<p>I just had that song. It was just Bruce and I recording it. And one of us (probably me) said, &#8220;Hey Patti, want to sit in on this?&#8221; So she came over.</p>\n<p>“Comin&#8217; Down Maria” and “Talk Show” are both just me and Bruce. We&#8217;re the only guys playing instruments on those. If there&#8217;s drum sets, it&#8217;s probably electronic drums somehow that we did, plus Patti singing on “Comin’ Down Maria.” The rest of the stuff is just he and I.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Comin&#039; Down Maria\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/WLshTQTt0Rg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Wait. I did not know that. I’m not sure <em>anybody </em>knows that, actually.</strong></p>\n<p>Well… I don&#8217;t think at that point&#8230; [laughs sheepishly]\n<p>We didn’t actually want to say how much he had done on the record, because he’s pretty much all over it. He&#8217;s on every track except “No Strings Attached” and “American Babylon.” On every other song he is playing or singing or something.</p>\n<p><strong>Huh. So, he’s on “Talk Show”?</strong></p>\n<p>Yeah, that&#8217;s <em>all</em> him.</p>\n<p><strong>Wow. I did not know that.</strong></p>\n<p>Well, <em>nobody</em> does. I’m spilling the beans. You&#8217;re the first guy to know.</p>\n<p><strong>Ooh, I get to break an exclusive?</strong></p>\n[laughs] You know, I don&#8217;t say much about anything, but it’s been 25 years&#8230;</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Talk Show\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/d2OCZHh7w_0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Okay, “Only Lovers Left Alive.” Like I said earlier, title tracks are interesting to me. Album sequences are interesting to me. That is a <em>dark</em> note to close that album on.</strong></p>\n<p>Yeah, well it&#8217;s sort of a dark record. It started with “Dark and Bloody Ground” and we have “American Babylon” in the middle and then “<a href=\"https://estreetshuffle.com/index.php/2021/06/27/matr-joe-grushecky-and-bruce-springsteen-only-lovers-left-alive/\">Only Lovers Left Alive</a>.” But I did purposely try to put in some lighter moments in with “No Strings Attached” and also “Labor of Love.”</p>\n<p><strong>It&#8217;s really interesting to me that you see it as a dark album. I&#8217;ve always heard it as equal parts light and dark. I think it’s literally half and half, six and six. It feels very yin and yang, and I wondered whether that was deliberate. But it sounds like you think of it as a darker album&#8211;a dark album with some light songs.</strong></p>\n<p>Yeah. I tried to lighten it up a little bit. I didn&#8217;t want people slitting their wrists listening to the record, but “Only Lovers Left Alive,” I was sitting on that title for years and years. I actually had a book called <em>Only Lovers Left Alive</em> when I was in high school, because I read that the Rolling Stones had licensed that book to make a movie. This is back when I was&#8230; this is early, like when the Stones first hit. I had the book for years and years. It probably just fell apart, it was a little paperback, and I always liked the title of it: <em>Only Lovers Left Alive</em>.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Only Lovers Left Alive\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/_JGAd81f--4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>That&#8217;s a great title.</strong></p>\n<p>So I fashioned a story. If you go back and listen to the record, there&#8217;s a lot of stuff about kids and families in that record.</p>\n<p><strong>Yeah. It ends on a really ambiguous note, because is this kid going to follow in the footsteps of his father?</strong></p>\n<p>Yeah, and that&#8217;s a question I would always ask myself almost every day after work. Am I making a difference with these kids? Because some were so far gone, like I said. I had kids that&#8230; I don&#8217;t even want to tell you what happened to them, because they were so horribly abused and neglected. It was just unspeakable, some of the stuff that happened to these kids. And I&#8217;d always think, honestly, are they going to make it? And it&#8217;s always a thrill… actually one of them just popped up on my Facebook about two weeks ago, he was one of my favorites.</p>\n<p><strong>Is he in a good place?</strong></p>\n<p>You know, I always feel weird about following up on them, because you have to be respectful of their rights to privacy, but he has a business down in Florida. He has a wife, a couple of kids, so he seemed to be doing pretty good. Most of the kids that I run into that I&#8217;ve worked with always thank me for helping them because I would always tell them, the moment I let you do anything that you want to do, that means I don&#8217;t care. I said, &#8220;I care enough about you to correct your bad behavior.&#8221; I would always tell them.</p>\n<p><strong>I think I told you last time we talked. My wife&#8217;s a special ed teacher and she has these crises of confidence sometimes, like how do I know if what I&#8217;m doing matters? If it&#8217;s going to make a difference? And we&#8217;re always like, &#8220;You&#8217;ll know way down the line.&#8221; Or you know any day you open up the paper and there&#8217;s not like an article written about a kid being shot or in jail or whatever, but that&#8217;s kind of the way you know, I guess for the time being.</strong></p>\n<p>Yeah. When I first started, I worked with really severely disabled mentally and physically handicapped kids. I mean severely institutionalized. I could see results with them, because I was teaching them how to eat, how to go to the bathroom and stuff. So I could see results, but when I was working this job, when I was doing <em>American Babylon</em>, it was just like these really terribly abused and neglected kids and they acted out all day long. So you&#8217;re saying, &#8220;Oh my God.&#8221; It was relentless, but a lot of them have contacted me later in life, and it always gives me a boost to know that they are doing well.</p>\n<p><strong>I&#8217;m glad you have that. Hey, I know we’ve been talking a long time now, but just a couple more questions I’d like to ask you&#8211;I guess the big one is, looking back on this, why <em>didn&#8217;t</em> this album become the monster it should have been?</strong></p>\n[laughs] I don&#8217;t know… I mean why didn’t <em>Have a Good Time But Get Out Alive</em> become the monster it should&#8217;ve been? I mean, you got to have everything going. You got to have the good agents. We couldn&#8217;t find a good agent. We couldn&#8217;t get on a good tour. We had no money behind us. Nobody could afford to quit their job and go at it full time. You have to have everything firing all at the same time.</p>\n<p><strong>It’s just mind-boggling to me. I mean&#8230; jeez, you even had Bruce out on tour with you!</strong></p>\n<p><iframe title=\"VideoPress Video Player\" aria-label='VideoPress Video Player' width='758' height='426' src='https://videopress.com/embed/WoQylHbz?hd=0&amp;cover=1' frameborder='0' allowfullscreen allow='clipboard-write'></iframe><script src='https://v0.wordpress.com/js/next/videopress-iframe.js?m=1674852142'></script></p>\n<p><strong>Do you ever look back on it and go, &#8220;Boy, if we had done this or tried this maybe&#8230;&#8221; Or do you think it was just kind of the cards that were just dealt at the time?</strong></p>\n<p>I think on this one it was probably the cards were dealt at the time. I mean we couldn&#8217;t have done much more than we did given our situation. Like I said, we&#8217;ve never had the luxury of not working. Everybody in our band had a day gig. I mean we <em>still</em> have day gigs. Everybody in my band works, and we just were  never able to crack through in a big way. We never got that big radio song.</p>\n<p><strong>I don&#8217;t know, man. You certainly had at least a half dozen of them on the album.</strong></p>\n<p>Well, according to <em>you</em>, but… [laughs]\n<p><strong>I told you at the top of the call the reason that this album means so much to me is at that point in my life I felt like music had pretty much left me behind. What I loved about rock and roll… it seemed like nobody was doing it at the time. It was just going in a totally different direction. I had just moved to the Northwest and everything was all grunge and it just never resonated with me.</strong></p>\n<p>Yeah, I never got behind grunge at all.</p>\n<p><strong>And then even Bruce was going in a different direction, but then your album came out. I was like, &#8220;Yes! This is rock and roll.&#8221; And what was great about it is that it was fresh. It didn&#8217;t sound dated, and it sounded like rock. And it felt like rock that nobody else was making at the time. I only wish I had been able to catch you guys on that tour.</strong></p>\n<p>Oh, it&#8217;s a great album. I mean I can still&#8230; on any given night we play a ton of songs off it. “Homestead” is probably one of the best songs I ever wrote.</p>\n<p><strong>It is. It&#8217;s fantastic. I don&#8217;t know why Bruce doesn&#8217;t play it more often, or at all really.</strong></p>\n<p>Bruce has a version of it. You heard that, right, on E Street Radio?</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - HOMESTEAD Rare Studio Recording Joe Grushecky 2013\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/qmmxYCR52rY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>I <em>have</em> heard it, but live, I mean&#8211;you guys have done it live together, but I don&#8217;t think he&#8217;s played it on his own without you, or with the band at all.</strong></p>\n<p>Did you hear the “<a href=\"https://estreetshuffle.com/index.php/2021/03/12/rotd-matr-joe-grushecky-and-bruce-springsteen-idiots-delight/\">Idiot’s Delight</a>” he did?</p>\n<p><strong>[Blogger&#8217;s Note: Bruce and Joe wrote &#8220;Idiot&#8217;s Delight&#8221; together.] I did! I did, when he played it on his radio show recently. I was like, hello! Where did <em>you</em> come from?</strong></p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Idiot&#039;s Delight\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/oiQ5QgBUUAg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>So the last question I have&#8230; well, you emailed me a month or so back and asked if  I knew how many times you and Bruce had played together, and I sent you a list of 53 times. Did you even realize that it had been that many times?</strong></p>\n<p>No, I didn&#8217;t!</p>\n<p><strong>That&#8217;s a lot of times.</strong></p>\n<p>The reason I e-mailed, we were having some type of discussion sitting on my patio with my wife and kids about how many times I&#8217;ve played with Bruce, and I said I had written a bunch of them down when we first started, but then I got lax, so I had no idea. I figured you must&#8217;ve known because shortly after, you put out that little blurb about, was it “<a href=\"http://estreetshuffle.com/index.php/2020/06/12/matr-joe-grushecky-and-bruce-springsteen-talking-to-the-king/\">Talking to the King</a>?”</p>\n<p><strong>Yeah.</strong></p>\n<p>So I said if anybody would know, Ken would know. Actually, I&#8217;m very glad I have that.</p>\n<p><strong>Hopefully you have recordings of all those times too because if not…</strong></p>\n<p>You can send me anything you want. [laughs] I&#8217;d be glad to have it.</p>\n<p><strong>Cool. I&#8217;m curious though: so you guys definitely have some reliables that you play together, both from your catalog and his. Who chooses the Springsteen songs that you include, you or him? Do you have favorite songs that you guys like to play?</strong></p>\n<p>Well I try to&#8230; I rehearse the band, and I try to pick songs that I think my band could do justice to. Obviously, the big saxophone solos are not something that we could do in an appropriate fashion. And some of the songs that I like to hear, I present them to Bruce. And he picks the ones he wants to play and then occasionally he&#8217;ll say, &#8220;Well, let&#8217;s do <em>this</em> one.&#8221; That&#8217;s why we started to do [singing] <a href=\"http://estreetshuffle.com/index.php/2019/07/16/roll-of-the-dice-save-my-love/\"><em>save my love for you</em></a>. We started doing that one.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen with Joe Grushecky and the Houserockers-Save My Love\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/dptZn4uH4iA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Yeah. And you guys did “<a href=\"http://estreetshuffle.com/index.php/2018/02/12/roll-of-the-dice-frankie-fell-in-love/\">Frankie Fell in Love.</a>” I think you guys were the first ones to play both of those.</strong></p>\n<p>Yeah. We were the first ones. I think I suggested that because it had that Stones vibe. I&#8217;m a big Stones fan.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"&quot;Frankie Fell In Love&quot; Bruce Springsteen ~ LOD 14 ~ Video by Rose A Montana\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/V7Uvg3flrrU?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>That&#8217;s such a great song. I was wondering what the dynamic was there. It&#8217;s funny because he blends right into your band.</strong></p>\n<p>Oh yeah…</p>\n<p><strong>I mean yes, the audience will fixate on him because he&#8217;s Bruce Springsteen, but sonically it&#8217;s like he&#8217;s part of the band.</strong></p>\n<p>People have asked me what it&#8217;s like playing with Bruce Springsteen. I say it’s just like having Roberto Clemente on your team or Mickey Mantle. Or Joe Montana. You are a better team.</p>\n<p><strong>Alright, so absolutely last question, I promise. You guys did a big blitz for <em>Have A Good Time</em>. This is kind of a milestone anniversary and a milestone record. Anything you guys have planned?</strong></p>\n<p>We&#8217;re working on it. We&#8217;re in the midst of recording a new record, also.</p>\n<p><strong>I&#8217;m <em>so</em> glad to hear that!</strong></p>\n<p>I got some really good songs that I was excited about, and this pandemic just brought everything to a screeching halt. We&#8217;ve done some live-in-the-studio filming that we&#8217;re going to throw out there.</p>\n<p><strong>Yeah, I saw the video you guys did the other day. I bookmarked it to make sure because I was actually out somewhere when I saw it. You did&#8230;</strong></p>\n<p>“<a href=\"https://estreetshuffle.com/index.php/2021/05/09/matr-joe-grushecky-and-bruce-springsteen-everythings-going-to-work-out-right/\">Everything&#8217;s Going to Work Out Right</a>.”</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Rock For Relief - Joe Grushecky and The Houserockers - &quot;Everything&#039;s Gonna Work Out Right&quot;\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/M6sFMtDO6iM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>We&#8217;re going to put up “Have a Good Time (But Get Out Alive)” today.</p>\n<p><strong>Nice! I&#8217;ll look for that.</strong></p>\n<div class=\"fb-video\" data-allowfullscreen=\"true\" data-href=\"https://www.facebook.com/watch/?v=1259659327717948\" style=\"background-color: #fff; display: inline-block;\"></div>\n<p>And then next year we have the 40th anniversary of <em>Blood on the Bricks</em>. I’m gonna start working on it at some point, because I do have outtakes for that one. Like I said, I had the luxury of going in the studio for a couple of weeks. It cost us&#8230; I mean the budgets were $75,000, $80,000 in those days. A thousand dollars would go a long way in Pittsburgh. So we could go book a studio for a couple of weeks for a thousand dollars and we would just go there and do our&#8230; I always come in with songs and say, &#8220;Listen to this one, listen to this.&#8221; And then we&#8217;ll work them out in the studio and then we would present them to the producers or in this case, with <em>Blood in the Bricks</em>, it was Steve Cropper. He actually came into Pittsburgh and we did probably six, eight days of pre-production. So we rehearsed every day for six to eight hours with him.</p>\n<p><strong>So 40 years is the magic number for getting some anniversary love, or can we look forward to something for American Babylon&#8217;s 25th?</strong></p>\n[laughs] I&#8217;ll tell you, American Babylon… that&#8217;s a hell of an album, man!</p>\n<p><strong>It is!</strong></p>\n<p>It’s a great record.</p>\n<p><strong>I know, that&#8217;s why you gotta do <em>something</em>! I mean, maybe you can’t tour right now, but you’ve got to do <em>something. </em>Cleveland International has been doing such a great job of promoting the <em>Have a Good Time</em> anniversary&#8230; I know American Babylon wasn&#8217;t on that label originally, but maybe&#8230;?</strong></p>\n<p>Well, the reason we were able to do so much stuff with <em>Have a Good Time But Get Out Alive</em> is that Cleveland Entertainment got back online, so we&#8217;re hooking up with Steve Popovich Jr. and Cleveland International again. We have several projects we are working on. I wanted to find a home for all my music, so it feels right to be working with Steve. It feels I&#8217;ve come full circle. More to come&#8230;</p>\n<p><strong>Well, here&#8217;s hoping! </strong><b>You got a whole bunch of great albums, man. Please keep adding to them, and hopefully we will get a chance to meet up in person at a show sometime. When you guys are back on the road I&#8217;ll be there.</b></p>\n<p>Well, I saw you at the last Light of Day, right? You were on stage.</p>\n<p><strong>I was. I&#8217;m so glad I did that, too, because that was <em>this year, </em>2020.</strong></p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Grushecky &amp; Houserockers Bruce Springsteen “Talking to the King” ~ Rose A Montana Video\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/JnFv1WiWmeo?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>It’s <em>crazy</em> that was this year. It just seems like it was <em>forever</em> ago.</strong></p>\n<p>Well, it&#8217;s going to be virtual next year. Nobody&#8217;s opening back up.</p>\n<p><strong>How do you&#8230; When will you feel ready, do you think? What would it take for you to feel okay going back out there?</strong></p>\n<p>You know, I don&#8217;t even know. Probably a vaccine. I had pneumonia a couple years ago, so…</p>\n<p><strong>Yeah, you don’t want to chance that.</strong></p>\n<p>No.</p>\n<p><strong>It&#8217;s going to be a long&#8230; a friend of mine who works at Google just sent me a link today that they just announced that they&#8217;re keeping their employees home through next July. Not working in the office.</strong></p>\n<p>Yeah, I heard that today too.</p>\n<p><strong>Feels like we&#8217;re all going to have to get pretty inventive for a while in our entertainment options.</strong></p>\n<p>Well, we need some leadership. They need to shut the country, the whole place down. I&#8217;m old, but they&#8217;re talking about going back to school…</p>\n<p><strong>We have a shared vested interest, because two people in my house are teachers.</strong></p>\n<p>It’s frightening. I can&#8217;t believe they&#8217;re even discussing it.</p>\n<p><strong>It&#8217;s infuriating, because I mean if we had the leadership to just say, &#8220;Look, we&#8217;re going to give you guys a week or two-week notice. We&#8217;re going to go into lockdown—the whole country. Stock up your food. Do what you need to do. Make your preparations and then just hunker down.&#8221; We get through it. Right?</strong></p>\n<p>Yeah.</p>\n<p><strong>But no one wants to just come to terms with that, and it seems like a lot of folks are going to die and a lot of jobs are going to be lost, and a lot of damage is going to be wreaked before eventually someone will.</strong></p>\n<p><strong>Anyway… that&#8217;s a dark note to end on! Although I guess it&#8217;s appropriate for <em>American Babylon</em>. [laughs]</strong></p>\n<p>Well… [laughs] what’s more <em>American Babylon</em> than a fricking pandemic and a depression at the same time?</p>\n<p>&nbsp;</p>\n", "protected": false}, "excerpt": {"rendered": "<p>On the 25th anniversary of American Babylon, Joe Grushecky and I take a look back at the making and meaning of Joe&#8217;s landmark album and his decades-long friendship with producer, co-writer, and collaborator Bruce Springsteen.</p>\n", "protected": false}, "author": 1, "featured_media": 20449, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [5, 3], "tags": [269, 1298, 2853, 1570, 2851, 56, 653, 2855, 2854], "class_list": ["post-20444", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-meeting-across-the-river", "category-roll-of-the-dice", "tag-american-babylon", "tag-chain-smokin", "tag-comin-down-maria", "tag-homestead", "tag-joe", "tag-joe-grushecky", "tag-never-be-enough-time", "tag-only-lovers-left-alive", "tag-talk-show"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/08/american-babylon.jpg?fit=600%2C600&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-5jK", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 27045, "url": "https://estreetshuffle.com/index.php/2021/05/25/matr-joe-grushecky-and-bruce-springsteen-chain-smokin/", "url_meta": {"origin": 20444, "position": 0}, "title": "MatR: Joe Grushecky and Bruce Springsteen: Chain Smokin&#8217;", "author": "Ken", "date": "May 25, 2021", "format": false, "excerpt": "The origin of American Babylon starts with Bruce and Joe's first-ever studio collaboration.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/05/chainsmokin.jpg?fit=599%2C593&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/05/chainsmokin.jpg?fit=599%2C593&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/05/chainsmokin.jpg?fit=599%2C593&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 19801, "url": "https://estreetshuffle.com/index.php/2020/12/11/matr-joe-grushecky-and-bruce-springsteen-american-babylon/", "url_meta": {"origin": 20444, "position": 1}, "title": "MatR: Joe Grushecky and Bruce Springsteen: American Babylon", "author": "Ken", "date": "December 11, 2020", "format": false, "excerpt": "American Babylon's title track is one of the only tracks Bruce had nothing to do with on the album, but that hasn't stopped Bruce and Joe from teaming up to play it on stage.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/11/american-babylon.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/11/american-babylon.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/11/american-babylon.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/11/american-babylon.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/11/american-babylon.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 565, "url": "https://estreetshuffle.com/index.php/2018/02/05/matr-joe-grushecky-and-bruce-springsteen-lighten-up/", "url_meta": {"origin": 20444, "position": 2}, "title": "MatR: Joe Grushecky and Bruce Springsteen, &#8220;Lighten Up&#8221;", "author": "Ken", "date": "February 5, 2018", "format": false, "excerpt": "A one-off performance of Joe Gruchecky's \"Lighten Up\" with Bruce from the American Babylon tour.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/lighten.jpg?fit=640%2C640&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/lighten.jpg?fit=640%2C640&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/lighten.jpg?fit=640%2C640&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 23584, "url": "https://estreetshuffle.com/index.php/2021/01/09/matr-joe-grushecky-and-bruce-springsteen-billys-waltz/", "url_meta": {"origin": 20444, "position": 3}, "title": "MatR: Joe Grushecky and Bruce Springsteen: Billy&#8217;s Waltz", "author": "Ken", "date": "January 9, 2021", "format": false, "excerpt": "Bruce plays a beautiful, evocative mandolin and adds his backing vocals on this beautiful American Babylon deep cut.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/08/american-babylon.jpg?fit=600%2C600&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/08/american-babylon.jpg?fit=600%2C600&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/08/american-babylon.jpg?fit=600%2C600&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 1410, "url": "https://estreetshuffle.com/index.php/2018/04/03/meeting-across-the-river-joe-grushecky-and-bruce-springsteen-never-be-enough-time/", "url_meta": {"origin": 20444, "position": 4}, "title": "Meeting Across the River: Joe Grushecky and Bruce Springsteen, Never Be Enough Time", "author": "Ken", "date": "April 3, 2018", "format": false, "excerpt": "\"Never Be Enough Time\" is a standout track from a stellar album, and a joyous collaboration between Joe Grushecky and Bruce.", "rel": "", "context": "In &quot;Meeting Across the River&quot;", "block_context": {"text": "Meeting Across the River", "link": "https://estreetshuffle.com/index.php/category/meeting-across-the-river/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/04/neverbe.jpg?fit=480%2C360&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 23951, "url": "https://estreetshuffle.com/index.php/2021/01/21/matr-joe-grushecky-and-bruce-springsteen-a-good-life/", "url_meta": {"origin": 20444, "position": 5}, "title": "MatR: Joe Grushecky and Bruce Springsteen: A Good Life", "author": "Ken", "date": "January 21, 2021", "format": false, "excerpt": "In their first studio collaboration since American Babylon, Joe Grushecky and Bruce Springsteen sing the joys of domesticity.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/goodlife.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/goodlife.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/goodlife.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/goodlife.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/goodlife.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/20444", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=20444"}], "version-history": [{"count": 26, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/20444/revisions"}], "predecessor-version": [{"id": 47578, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/20444/revisions/47578"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/20449"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=20444"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=20444"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=20444"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}