{"uuid": "c73608b8-4fe3-423c-b729-fc1533e7d172", "id": 4719, "date": "2018-10-03T05:24:16", "date_gmt": "2018-10-03T12:24:16", "guid": {"rendered": "http://estreetshuffle.com/?p=4719"}, "modified": "2022-09-25T13:36:46", "modified_gmt": "2022-09-25T20:36:46", "slug": "where-the-man-was-broadway-october-3-2017", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2018/10/03/where-the-man-was-broadway-october-3-2017/", "title": {"rendered": "Where the Band Was: Broadway, October 3, 2017"}, "content": {"rendered": "<div class=\"postbody\">\n<div class=\"content\">\n<p><strong>Note</strong>: A little further down the page, you&#8217;l find my original review of the very first night of Springsteen on Broadway, which I originally posted on Backstreets.com. It&#8217;s presented here unaltered and unedited, except for some typo corrections and the addition of a couple of my photos and in-line insertion of comments I&#8217;d added in replies. It therefore has <strong>LOTS OF SPOILERS</strong>. I&#8217;ve scrupulously avoided revealing spoilers all year long for those who have yet to see the show, but one year later, I feel like I can start talking about the show more openly. If you&#8217;re averse to spoilers, then just stop scrolling after you see the big &#8220;<strong>***SPOILERS FOLLOW***</strong>&#8221; warning below.</p>\n<p>But first let me share my story about how I ended up <em>in the front row for opening night, </em>because I am honestly still in shock every time I think about it.</p>\n</div>\n</div>\n<p>Like many, I dutifully and optimistically registered for the Verified Fan lottery when it was announced.</p>\n<p>When the lucky winners were notified, however, I was not among them. I didn&#8217;t even make the secondary standby list, and yes, that stung. Luckily, my brother and a friend both received codes, and both got tickets&#8211;so I knew I&#8217;d have a chance to be a plus-one mid-way into the run.</p>\n<p>Weeks later, I was on a flight from Seattle to Orlando for a work conference, and just as we started to descend, my social media messages and e-mail went nuts&#8211;it turns out that a new block of bystanders were receiving codes to go get remaining tickets. What lousy timing, though: it would be at least another 20 minutes before we touched ground and I could check my texts, and surely the tickets would be gone by then.</p>\n<p>The instant we were wheels-down, I switched on my phone, and sure enough&#8211;there was the text, with my personal code&#8211;FINALLY&#8211;to get my own tickets, along with a strong recommendation to focus on the end of the run for the best chance of finding available seats.</p>\n<p>But it had already been almost a half hour, and I couldn&#8217;t find anything available using the Ticketmaster app on my phone. As soon as I made it off the plane&#8211;another ten minutes&#8211;I parked myself in the gate area, fired up my laptop, and started searching fruitlessly for available tickets. I spent about 20 more minutes&#8211;now a full hour after the notifications had been sent out&#8211;looking for a single seat, show after show, to no avail.</p>\n<p>I even searched early in the run, just in case some last minute tickets had been released, but of course nothing had.</p>\n<p>Finally, just as a lark, I looked at opening night.</p>\n<p>And in my cart appeared a front row seat on the right aisle.</p>\n<p>I just stared at it. And I stared at the price tag.</p>\n<p>I did the math in my head: not only would I be shelling out $850 plus fees for the ticket, but I&#8217;d also have to change my flights (I was due to fly home from Boston to Seattle the day of the show, and changing not just the date but also the origination from Boston to JFK was probably going to cost a fortune). Lodging wasn&#8217;t an issue&#8211;I had the use of a corporate apartment when I was in the NJ area for work&#8211;but I couldn&#8217;t justify the ticket and the flight change.</p>\n<p>So I tossed it back.</p>\n<p>I got about halfway to baggage claim before it sunk in: I&#8217;d just thrown away the opportunity to be <em>front row</em>  on opening night. What the heck was I thinking?</p>\n<p>I kicked myself for blowing my opportunity, and just to torture myself, I searched again for opening night tickets, sure there&#8217;d be nothing left now.</p>\n<p>The same exact ticket appeared in my cart.</p>\n<p>I stared at the screen, as the 8-minute clock started to tick on the site, counting down the time until the decision would be taken out of my hands. I did the math again, and I decided that if I could change my flight for a reasonable price, and if I could get Delta to do it within 7 minutes and 30 seconds, I&#8217;d consider it.</p>\n<p>I called Delta, and an agent answered within ten seconds (thank goodness for status).</p>\n<p>I remember the conversation that followed vividly:</p>\n<p>Me: &#8220;Hi, I&#8217;m calling about my flight from Boston to Seattle on October 3rd. Do you see it?&#8221;</p>\n<p>Agent: &#8220;Yes. What can I do for you?&#8221;</p>\n<p>Me: &#8220;Okay, here&#8217;s the situation: I am staring right this very moment at my computer screen, and on it is a FRONT ROW ticket for Bruce Springsteen on Broadway ON OPENING NIGHT, and I have 6 minutes and 8 seconds to decide whether to buy it. Do you understand? BRUCE SPRINGSTEEN, FRONT ROW, OPENING NIGHT!&#8221;</p>\n<p>Agent: &#8220;Yes, sir.&#8221; (nervous laughter)</p>\n<p>Me: &#8220;Okay, so the <em>only</em> way I can do this is if I can change that flight on the 3rd, and I know this is a lot to ask, but is there any way you can please, please, <em>please</em> change that flight from the 3rd to the 4th, and out of JFK instead of Boston, and also please don&#8217;t charge me a change fee, and also please don&#8217;t charge me a difference in fare, because the Springsteen ticket is <em>really</em> expensive, and this is the only way I can make it work, and I realize that I&#8217;m asking a lot, and I don&#8217;t expect you to say yes, but I have to ask. So. Please?&#8221;</p>\n<p>Agent: (laughter, pleasant this time) &#8220;Let me see what I can do. Do you mind holding?&#8221;</p>\n<p>Me: &#8220;No problem, as long as you can get back to me within 5 minutes and 20 seconds or else it&#8217;s moot.&#8221;</p>\n<p>Agent: &#8220;Let me see what I can do. I&#8217;ll be right back.&#8221;</p>\n<p>And I waited.</p>\n<p>And waited.</p>\n<p>With only 1 minute and 17 seconds on the clock, the agent came back and said the most wonderful words a stranger has ever said to me: &#8220;Okay, sir. You&#8217;re all set. You&#8217;re now flying out of JFK on the 4th. No additional fare or fee collection required this time. Enjoy the show, and thanks for your continued loyalty.&#8221;</p>\n<p>I was so shocked, I almost didn&#8217;t click the purchase button in time. <em>Almost</em>.</p>\n<p>Seconds later, after profuse thanks and praise and promised loyalty forever to Delta (I don&#8217;t do ads on this site, but I will freely admit that I love my airline), I had a confirmed seat for opening night at <em>Springsteen on Broadway</em>&#8211;and it was only one week away.</p>\n<p><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" data-attachment-id=\"5221\" data-permalink=\"https://estreetshuffle.com/index.php/2018/10/03/where-the-man-was-broadway-october-3-2017/ticket/#main\" data-orig-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/ticket.jpg?fit=752%2C314&amp;ssl=1\" data-orig-size=\"752,314\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"ticket\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/ticket.jpg?fit=300%2C125&amp;ssl=1\" data-large-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/ticket.jpg?fit=752%2C314&amp;ssl=1\" class=\" wp-image-5221 aligncenter\" src=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/ticket-300x125.jpg?resize=758%2C315\" alt=\"\" width=\"758\" height=\"315\" srcset=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/ticket.jpg?resize=300%2C125&amp;ssl=1 300w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/ticket.jpg?w=752&amp;ssl=1 752w\" sizes=\"auto, (max-width: 758px) 100vw, 758px\" /></p>\n<p>The first thing you notice&#8211;the first thing <em>everyone</em> notices&#8211;when you walk into the Walter Kerr Theater, is that the place is <em>tiny</em>. Every seat is a good seat, but even with that in mind, I was shocked at just how close I was. There was no space between the front row and the stage&#8211;here&#8217;s the view from my seat, taken with no zoom:</p>\n<p><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" data-attachment-id=\"5225\" data-permalink=\"https://estreetshuffle.com/index.php/2018/10/03/where-the-man-was-broadway-october-3-2017/22222015_10155106466221158_4780947566061749221_n/#main\" data-orig-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/22222015_10155106466221158_4780947566061749221_n.jpg?fit=752%2C960&amp;ssl=1\" data-orig-size=\"752,960\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"22222015_10155106466221158_4780947566061749221_n\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/22222015_10155106466221158_4780947566061749221_n.jpg?fit=235%2C300&amp;ssl=1\" data-large-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/22222015_10155106466221158_4780947566061749221_n.jpg?fit=752%2C960&amp;ssl=1\" class=\" wp-image-5225 aligncenter\" src=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/22222015_10155106466221158_4780947566061749221_n-235x300.jpg?resize=758%2C967\" alt=\"\" width=\"758\" height=\"967\" srcset=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/22222015_10155106466221158_4780947566061749221_n.jpg?resize=235%2C300&amp;ssl=1 235w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/22222015_10155106466221158_4780947566061749221_n.jpg?w=752&amp;ssl=1 752w\" sizes=\"auto, (max-width: 758px) 100vw, 758px\" /></p>\n<p><em>That&#8217;s </em>how close I was to Bruce. And I almost got kicked out of the theater for taking that photo, because on opening night, they were super strict about the new photos rule, even well before showtime. They also stressed to us as we walked in that if we left our seats for any reason during the performance, we&#8217;d have to watch the remainder of the show from the back of the theater.</p>\n<p>Needless to say, I did not visit the bar that night.</p>\n<p>There were a lot of strict rules that night that have since been eased or removed altogether, and none of us present had any idea what to expect from the evening, so we dutifully obeyed. (Most of us, anyway&#8211;the poor bouncers were kept busy constantly chasing away amateur photographers.)</p>\n<p>Shortly before showtime, Steve Van Zandt walked in and sat a couple of rows behind me. And not far behind him was Matt Lauer and his entourage. If there were any other notables in attendance, I didn&#8217;t spot them.</p>\n<p>I didn&#8217;t have much time to look&#8211;because the first surprise of the night was the prompt 8pm &#8220;curtain&#8221; for the never-on-time Bruce. Suddenly, we were off&#8230;</p>\n<p>And now, my original review of Night One of <em>Springsteen on Broadway, </em>originally posted in the wee hours of October 4, 2017.</p>\n<p><strong>*** SPOILERS FOLLOW***</strong></p>\n<div class=\"postbody\">\n<div class=\"content\">\n<p>This was no concert. Don&#8217;t expect surprises; don&#8217;t expect tributes to dearly departed artists. This is a set piece. It may evolve&#8211;Bruce may decide that a song doesn&#8217;t underscore a story as well as a different one might and therefore replace it&#8211;but I don&#8217;t expect change for the sake of variety.</p>\n<p>It <em>felt</em> like a theater piece. Bruce barely acknowledged the audience, performing his stories as an actor delivering a monologue would. His deliveries were polished, considered, and inflected. I wondered at times if he had worked with an acting coach&#8211;he sounded very different telling these stories than he has in tours past.</p>\n<p>The lights went down right at 8pm; Bruce walked out with no fanfare and dedicated the show to Tom Petty and then immediately launched into a monologue that painted a picture of what was to come. He spoke in the style and voice that he used in his book; certain passages were lifted verbatim from the book, in fact, and others were so much in that voice that you could be forgiven for not knowing when he was reciting the book and when he was expanding on it.</p>\n<p>It was immediately clear&#8211;even before the first song&#8211;that this was going to be <em>Born to Run: The Musical.</em></p>\n<p>That said, to me at least it did not feel nostalgic at all&#8211;the songs were in service of the story, and even old chestnuts sounded new and had deeper meaning when connected to his life&#8217;s narrative.</p>\n<p>He played continuously, providing his own instrumental soundtrack for his stories, and when he sang, he wove together verse, chorus, and prose within each song. If you were there for the music, you might have found that frustrating&#8211;but this show is less for fans of Bruce&#8217;s music and more for fans of the man himself. If you&#8217;ve ever wanted insight into the artist and his muses, this felt as close to authenticity as you are ever likely to get.</p>\n<p>There are some very light and funny moments&#8211;almost all self-deprecating&#8211;but most of the stories and songs are emotionally deep and cutting. (My favorite funny: early in the show, Bruce acknowledged, &#8220;I have never done an honest day&#8217;s work in my life. And yet: it&#8217;s the only thing I write about.&#8221;)</p>\n<p>The first five songs comprised one long narrative flow&#8211;a first act, if you will, covering his childhood and coming of age. &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/08/13/roll-of-the-dice-my-fathers-house/\">My Father&#8217;s House</a>&#8221; just shredded me. I wept openly. It&#8217;s always been one of my favorite songs of his, and I&#8217;ve never heard it live. The narrative about his dad that he wove around it made it even more heart-breaking than it already is. The absolute highest highlight of the show, IMO.</p>\n<p>&#8220;<a href=\"http://estreetshuffle.com/index.php/2018/07/04/roll-of-the-dice-the-promised-land/\">The Promised Land</a>&#8221; through &#8220;<a href=\"http://estreetshuffle.com/index.php/2018/11/19/roll-of-the-dice-tenth-avenue-freeze-out/\">Tenth Avenue Freeze-Out</a>&#8221; were a leap forward in time to the band years. Although I loved the performance of &#8220;<a href=\"http://estreetshuffle.com/index.php/2019/09/21/roll-of-the-dice-born-in-the-u-s-a/\">Born in the U.S.A</a>.&#8221; sandwiched in between &#8220;The Promised Land&#8221; and &#8220;Tenth Avenue Freeze-Out,&#8221; it felt forced to me from a narrative perspective. It was a vignette (tied to the story of how he met Kovic) that didn&#8217;t seem connected to the rest of the tale. Probably it was to illustrate where his social concern and activism originated from, but I felt like I had to infer that rather than feel or sense it.</p>\n<p>I loved the interlude with Patti. Seeing the two of them sing to each other songs that obviously hold so much meaning to them as a couple&#8211;when you&#8217;re that close in a room that small, with just their two voices and two guitars&#8211;I felt almost an intruder. They were singing to each other rather than to us, and it was absolutely a highlight of the show.</p>\n<p>&#8220;<a href=\"http://estreetshuffle.com/index.php/2019/10/17/roll-of-the-dice-the-ghost-of-tom-joad/\">The Ghost of Tom Joad</a>&#8221; through &#8220;<a href=\"http://estreetshuffle.com/index.php/2018/01/05/roll-of-the-dice-land-of-hope-and-dreams/\">Land of Hope and Dreams</a>&#8221; represented the final act&#8211;less about Bruce&#8217;s life and more about the issues he cares about. My one and only half-complaint about the &#8220;set list&#8221; is that I thought &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/12/25/roll-of-the-dice-dancing-in-the-dark/\">Dancing in the Dark</a>&#8221; was very, very out of place. I absolutely loved the arrangement (the same as at <a href=\"http://estreetshuffle.com/index.php/2018/09/30/where-the-band-was-toronto-september-30-2017/\">Invictus</a> the other night), but it was just strange sandwiching it in after GOTJ and &#8220;<a href=\"http://estreetshuffle.com/index.php/2020/03/21/roll-of-the-dice-long-walk-home/\">Long Walk Home</a>&#8221; and before LOHAD. I honestly don&#8217;t know why he even has it in the show. Even his &#8220;Put on your dancing shoes!&#8221; lead-in was just weird in that setting. If it weren&#8217;t for the fact that I loved the seamless transition from Dancing to LOHAD, I&#8217;d advise him to drop it. I&#8217;d prefer a fuller LOHAD to the combined Dancing/LOHAD.</p>\n<p>LOHAD itself&#8211;wow. I may be biased, as it&#8217;s my favorite song of his, but the power he brought was incredible. Somehow, he summoned the band, and that abbreviated version felt for two minutes or so like an ESB encore. So powerful.</p>\n<p>&#8220;Born to Run&#8221; was gorgeous&#8211;very much the Tunnel arrangement, but with the &#8220;The Promised Land&#8221; heartbeat outro (minus the abrupt twang&#8211;just a graceful fadeout). Maybe it was just me, but I felt like at the end of the song, everyone was singing (softly) along with the &#8220;woah oh ohs.&#8221; Bruce asked for the audience to be lit up for that last song (felt like an audible decision, but maybe not) so that he could see who he had been performing to.</p>\n<p>No encore, just bows, and a hasty exit&#8211;lights were up within seconds.</p>\n<p><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" data-attachment-id=\"5218\" data-permalink=\"https://estreetshuffle.com/index.php/2018/10/03/where-the-man-was-broadway-october-3-2017/file-20/#main\" data-orig-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/file-20-e1538497668334.jpeg?fit=768%2C1024&amp;ssl=1\" data-orig-size=\"768,1024\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;2.8&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;iPhone 7 Plus&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;1507068418&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;6.6&quot;,&quot;iso&quot;:&quot;400&quot;,&quot;shutter_speed&quot;:&quot;0.02&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;6&quot;}\" data-image-title=\"file-20\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/file-20-e1538497668334.jpeg?fit=225%2C300&amp;ssl=1\" data-large-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/file-20-e1538497668334.jpeg?fit=758%2C1011&amp;ssl=1\" class=\" wp-image-5218 aligncenter\" src=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/file-20-e1538497668334-225x300.jpeg?resize=758%2C1011\" alt=\"\" width=\"758\" height=\"1011\" srcset=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/file-20-e1538497668334.jpeg?resize=225%2C300&amp;ssl=1 225w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/file-20-e1538497668334.jpeg?w=768&amp;ssl=1 768w\" sizes=\"auto, (max-width: 758px) 100vw, 758px\" /></p>\n<p>I loved every moment of the experience. I was fortunate enough to score a front row seat right in front of Bruce&#8217;s piano bench in the drop last week, and while I don&#8217;t regret for a moment spending the money, I certainly think I would have been just as satisfied with any other seat on the main floor (I wasn&#8217;t able to check out the view upstairs, so I&#8217;ll let others comment on that).</p>\n<p>One last note re: the (presumably) unchanging nature of the set list&#8211;I have tickets for later in the run that I was intending to sell after scoring the great ticket for last night. I&#8217;m not going to do that now. I want to see this show again. I don&#8217;t care if it&#8217;s exactly the same as it was last night, with seats that aren&#8217;t as good&#8211;that experience was so powerful for me, the content so moving&#8230; like a great play, I could see it again and again.</p>\n<p>I was skeptical going into this&#8211;I thought it was an overpriced acoustic tour and that I&#8217;d end up having enjoyed myself but feeling vastly overcharged. I don&#8217;t feel that way at all. I&#8217;ve not seen anything quite like this before, and I can&#8217;t wait to see it again.</p>\n<p>I hope you get a chance to enjoy it, too.</p>\n</div>\n</div>\n<dl class=\"postprofile\"></dl>\n<div class=\"text_exposed_show\">\n<div></div>\n</div>\n", "protected": false}, "excerpt": {"rendered": "<p>I was lucky to be in the front row for Springsteen on Broadway on opening night. Here&#8217;s how it all went down.</p>\n", "protected": false}, "author": 1, "featured_media": 5223, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [152], "tags": [1790, 273], "class_list": ["post-4719", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-where-the-band-was", "tag-delta-airlines", "tag-springsteen-on-broadway"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/36068045030_62bee7f893_z.jpg?fit=568%2C640&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-1e7", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 580, "url": "https://estreetshuffle.com/index.php/2018/02/05/editors-note-avoiding-springsteen-on-broadway-spoilers/", "url_meta": {"origin": 4719, "position": 0}, "title": "Editor&#8217;s Note: Avoiding Springsteen on Broadway spoilers", "author": "Ken", "date": "February 5, 2018", "format": false, "excerpt": "There shall be no Springsteen on Broadway spoilers on this blog.", "rel": "", "context": "In \"Springsteen on Broadway\"", "block_context": {"text": "Springsteen on Broadway", "link": "https://estreetshuffle.com/index.php/tag/springsteen-on-broadway/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/sob.jpg?fit=305%2C225&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 28296, "url": "https://estreetshuffle.com/index.php/2021/06/28/bloggers-note-broadway-review-and-vacation-notice/", "url_meta": {"origin": 4719, "position": 1}, "title": "Blogger&#8217;s Note: Broadway Review and Vacation Notice", "author": "Ken", "date": "June 28, 2021", "format": false, "excerpt": "My first-hand report from Re-opening Night of Springsteen on Broadway, and my first vacation in over 1,270 days.", "rel": "", "context": "In \"Springsteen on Broadway\"", "block_context": {"text": "Springsteen on Broadway", "link": "https://estreetshuffle.com/index.php/tag/springsteen-on-broadway/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/take-a-vacation.jpg?fit=1200%2C800&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/take-a-vacation.jpg?fit=1200%2C800&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/take-a-vacation.jpg?fit=1200%2C800&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/take-a-vacation.jpg?fit=1200%2C800&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/take-a-vacation.jpg?fit=1200%2C800&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 4624, "url": "https://estreetshuffle.com/index.php/2018/09/30/where-the-band-was-toronto-september-30-2017/", "url_meta": {"origin": 4719, "position": 2}, "title": "Where the Band Was: Toronto, September 30, 2017", "author": "Ken", "date": "September 30, 2018", "format": false, "excerpt": "Bruce makes an unusual appearance at the Invictus Games closing ceremony, playing a short acoustic set and joining Bryan Adams for two rockers.", "rel": "", "context": "In &quot;Where the Band Was&quot;", "block_context": {"text": "Where the Band Was", "link": "https://estreetshuffle.com/index.php/category/where-the-band-was/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/09/invictus-e1538086794500.jpg?fit=500%2C510&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 13620, "url": "https://estreetshuffle.com/index.php/2019/10/28/matr-bruce-springsteen-and-the-shots-funky-broadway/", "url_meta": {"origin": 4719, "position": 3}, "title": "MatR: Bruce Springsteen and The Shots: Funky Broadway", "author": "Ken", "date": "October 28, 2019", "format": false, "excerpt": "One time only: Bruce joins short-lived Stone Pony house band The Shots for a cover of Wilson Pickett's hit, \"Funky Broadway.\"", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/10/funky.jpg?fit=500%2C500&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 59508, "url": "https://estreetshuffle.com/index.php/2025/08/31/kingdom-of-days-august-31-2/", "url_meta": {"origin": 4719, "position": 4}, "title": "Kingdom of Days: August 31", "author": "Ken", "date": "August 31, 2025", "format": false, "excerpt": "This date's highlights are almost all New Jersey-based: from archival footage of The Doors at Convention Hall in '68 (Bruce was there) to a Bruce-and-Steve reunion in '85 to the closing night of the ten-night Giants Stadium stand in '03.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/08/20030831_6_front.jpg?fit=808%2C688&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/08/20030831_6_front.jpg?fit=808%2C688&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/08/20030831_6_front.jpg?fit=808%2C688&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/08/20030831_6_front.jpg?fit=808%2C688&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 55846, "url": "https://estreetshuffle.com/index.php/2025/02/03/kingdom-of-days-february-3-2/", "url_meta": {"origin": 4719, "position": 5}, "title": "February 3", "author": "Ken", "date": "February 3, 2025", "format": false, "excerpt": "On this date: Springsteen on Broadway wraps up its winter run, and Max's Kansas City makes the opening act the closers, too.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2024/02/2023-02-03-atlanta.webp?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2024/02/2023-02-03-atlanta.webp?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2024/02/2023-02-03-atlanta.webp?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2024/02/2023-02-03-atlanta.webp?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2024/02/2023-02-03-atlanta.webp?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/4719", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=4719"}], "version-history": [{"count": 14, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/4719/revisions"}], "predecessor-version": [{"id": 38029, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/4719/revisions/38029"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/5223"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=4719"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=4719"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=4719"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}