{"uuid": "69599c6c-0926-4e92-a17a-1c175dd20d63", "id": 16557, "date": "2020-03-28T05:00:00", "date_gmt": "2020-03-28T12:00:00", "guid": {"rendered": "http://estreetshuffle.com/?p=16557"}, "modified": "2024-01-02T11:51:39", "modified_gmt": "2024-01-02T19:51:39", "slug": "roll-of-the-dice-western-stars", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2020/03/28/roll-of-the-dice-western-stars/", "title": {"rendered": "Roll of the Dice: Western Stars"}, "content": {"rendered": "<p>For Bruce Springsteen, all roads lead west.</p>\n<p>His fondness for cinema, his fascination with the American west, his reckoning with age and remembrance of glory days&#8211;all those avenues converge in the land of sunsets and arrive at &#8220;Western Stars.&#8221;</p>\n<p>&#8220;Western Stars&#8221; is magnificent. It&#8217;s also inevitable. Bruce&#8217;s songwriting has been building toward this ever since &#8220;<a href=\"http://estreetshuffle.com/index.php/2018/07/04/roll-of-the-dice-the-promised-land/\">The Promised Land</a>&#8221; in 1978 and barreling at full speed since <a href=\"https://estreetshuffle.com/index.php/2023/06/03/album-companion-the-ghost-of-tom-joad/\"><em>The Ghost of Tom Joad</em> </a>in 1995.</p>\n<p>By the time he arrived at his 2005 masterpiece, &#8220;<a href=\"https://estreetshuffle.com/index.php/2020/05/21/roll-of-the-dice-reno/\">Reno</a>&#8220;&#8211;a song that has so many parallels to &#8220;Western Stars&#8221; that they&#8217;re practically siblings (an essay for another day)&#8211;we knew we&#8217;d clearly been introduced to a more mature, introspective Bruce Springsteen who was coming to terms with having more sunrises behind him than ahead of him.</p>\n<p>It&#8217;s not much of a stretch to call <em>Western Stars</em> Bruce&#8217;s magnum opus and its title track one of Bruce&#8217;s finest songs. We&#8217;ll take a close look at it, but to do it right, we <em>really</em> have to take a look at it.</p>\n<p>In general, I&#8217;m not a huge fan of on-the-nose music videos. If all you&#8217;re doing is literally illustrating the song, why bother? Our imaginations can do that just fine on our own.</p>\n<p>But &#8220;Western Stars&#8221; isn&#8217;t an ordinary song. Like &#8220;Thunder Road&#8221; and &#8220;<a href=\"http://estreetshuffle.com/index.php/2019/01/22/roll-of-the-dice-downbound-train/\">Downbound Train</a>&#8220;, &#8220;Western Stars&#8221; earns its cinematic label&#8211;it just <em>sounds</em> like a movie. Heck, it&#8217;s virtually a musical score.</p>\n<p>In fact, &#8220;Western Stars&#8221; is such an evocative song that there&#8217;s almost no point in watching its official video&#8211;odds are the movie we visualize when we hear the song is even more vivid than Thom Zimny&#8217;s wonderful five-minute film. And yet, the video is beautifully filmed and features some of Bruce&#8217;s very best acting. I find myself unable to separate the song from the video; whenever I listen to &#8220;Western Stars,&#8221; I see it as well.</p>\n<p>Let&#8217;s watch together.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Western Stars (Official Video)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/_IXzAAKrsFE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Both lyrically and musically, &#8220;Western Stars&#8221; is (somewhat paradoxically) both meditation and celebration.</p>\n<p>I&#8217;ve heard many critics voice the opinion that the song&#8217;s protagonist is depressed, almost grieving for his lost vitality. But I hear the opposite: a song of acceptance, of satisfaction and pride in a life well-lived and contentment with where his journey has brought him.</p>\n<p>The narrator of &#8220;Western Stars&#8221; knows his days of glory are behind him, but he refuses to ride off into the sunset. Like many of Bruce&#8217;s songs, the theme of &#8220;Western Stars&#8221; can be found in a single line, the song&#8217;s finest: &#8220;These days there ain&#8217;t no more&#8230; now there&#8217;s just again.&#8221;</p>\n<p>&#8220;Western Stars&#8221; is at it&#8217;s core an acknowledgement of the essence of old age: a series of endless <em>agains, </em>endless, that is, until it ends.</p>\n<p>Let&#8217;s take a closer listen.</p>\n<p>Like any good movie score, the music sets the scene for us before Bruce sings his first word. The first thing we notice is the brooding, introspective pedal steel, while Bruce sits lost in thought and memory. When the vocals enter, the first line is so brilliantly meta that it can&#8217;t possibly be unintentional:</p>\n<p style=\"padding-left: 40px;\"><em>I wake up in the morning, just glad my boots are on</em><br />\n<em>Instead of empty in the whispering grasses</em><br />\n<em>Down the Five at Forest Lawn</em></p>\n<p>The first line of &#8220;Western Stars&#8221; mirrors the opening line of Bruce&#8217;s greatest hit:</p>\n<p style=\"padding-left: 40px;\"><em>I get up in the evenin&#8217;, and I ain&#8217;t got nothin&#8217; to say</em></p>\n<p>In 1984, Bruce&#8217;s &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/12/25/roll-of-the-dice-dancing-in-the-dark/\">Dancing in the Dark</a>&#8221; narrator bristled and seethed with frustration at his lack of forward momentum. He was tired&#8211;tired and bored with himself.</p>\n<p>Our &#8220;Western Stars&#8221; protagonist, by contrast, is simply happy to be alive. It&#8217;s implied that he&#8217;s lost many friends already: Forest Lawn is a famous Los Angeles cemetery, known as the final resting place for many of the stars of the Golden Age of Hollywood. The &#8220;down the Five&#8221; reference is more than a colorful geographical detail&#8211;it&#8217;s a reminder of how the modern age (Interstate 5, which runs past Forest Lawn) has imprinted itself over the remnants of the past. It&#8217;s also a bit of clever foreshadowing&#8211;we&#8217;ll refer back to this later in the song.</p>\n<p>Meanwhile, the &#8220;Dancing in the Dark parallel continues&#8211;like his 1984 counterpart, the Bruce of 2019 could use just a little help:</p>\n<p style=\"padding-left: 40px;\"><em>On the set the makeup girl brings me two raw eggs and a shot of gin</em><br />\n<em>Then I give it all up for that little blue pill</em><br />\n<em>That promises to bring it all back to you again</em></p>\n<p>This passage is a clever wink (at his age, he can&#8217;t start a fire without a spark), but it&#8217;s also the emergence of the key theme of &#8220;Western Stars&#8221;: you don&#8217;t have to surrender your vitality just because you&#8217;re old.</p>\n<p>Bruce keeps his impishly clever streak going through the first chorus:</p>\n<p style=\"padding-left: 40px;\"><em>Ride me down easy, ride me down easy, friend</em><br />\n<em>Tonight the western stars are shining bright again</em></p>\n<p>I guess that make-up girl brought him more than breakfast. Ride me down easy, indeed.</p>\n<p>The first verse of &#8220;Western Stars&#8221; is introspective. It&#8217;s about our narrator&#8217;s refusal to surrender his youthful vigor. The second verse, though, is outward facing&#8211;as our Viagra-powered hero feels his potency returning, so does the natural environment of his surroundings reassert its dominion over modern society:</p>\n<p style=\"padding-left: 40px;\"><em>Here in the canyons above Sunset, the desert don&#8217;t give up the fight</em><br />\n<em>A coyote with someone&#8217;s Chihuahua in its teeth skitters &#8216;cross my veranda in the night</em><br />\n<em>Some lost sheep from Oklahoma sips her mojito down at the whiskey bar</em><br />\n<em>Smiles and says she thinks she remembers me from that commercial with the credit card</em></p>\n<p>There&#8217;s so much to admire in this verse, starting with the callback to the first verse: The interstate may have laid claim to the city, but in the canyons, the desert has not yet surrendered, and someone&#8217;s poor pet dog is no match for a wild coyote.</p>\n<p>Bruce makes it clear from the &#8220;lost sheep&#8221; metaphor that our protagonist identifies with the coyotes. The action may happen off screen, but it&#8217;s obvious by implication that the flirtatious girl with the mojito is going to be his second sexual partner of the day.</p>\n<p>This verse ranks among the best Bruce has ever written&#8211;clever, colorful, subtle, and incisive. If it doesn&#8217;t get the accolades it deserves, that&#8217;s probably because it&#8217;s immediately followed by one of Bruce&#8217;s best lines ever:</p>\n<p style=\"padding-left: 40px;\"><em>Hell these days there ain&#8217;t no more, now there&#8217;s just again</em><br />\n<em>Tonight the western stars are shining bright again</em></p>\n<p>And there it is: the song in one line. When do you know you&#8217;re old? When there&#8217;s no more <em>new</em>, when your days are just a series of <em>again</em>. And if Bruce had left the line hanging, we might hear that line as profoundly depressing. But he doesn&#8217;t&#8211;he follows it up with the song&#8217;s refrain and makes it clear that <em>again</em> is just fine if your inner fire still burns.</p>\n<p>Until this point in the song, the camera stays in tight focus on Bruce, lost in his inner world. But as we approach this key line, the lens starts to widen. We see a band behind Bruce, we see the valley in front of him, and the orchestra begins to swell as the musical landscape opens to match the lyrical and cinematic ones.</p>\n<p style=\"padding-left: 40px;\"><em>Some days I take my El Camino, throw my saddle in and go</em><br />\n<em>East to the desert where the charros, they still ride and rope</em><br />\n<em>Our American brothers cross the wire and bring the old ways with them</em><br />\n<em>Tonight the western stars are shining bright again</em></p>\n<p>I&#8217;m going to decline to discuss charreada here, because it&#8217;s controversial enough to distract from the topic at hand. If you&#8217;re morally opposed to it, feel free to interpret the charros reference as an example of a flawed protagonist out of touch with modern mores; if you&#8217;re pro-charreada, you can interpret this verse as a celebration of a tradition that like the narrator himself may have faded but refuses to go gently into the good night.</p>\n<p>As the orchestra swells and blooms, there&#8217;s a lovely shot of Bruce noticing his cowboy hat on the seat beside him. He picks it up (but does not put it on) and surrenders to memory during the instrumental bridge that follows.</p>\n<p>(It&#8217;s worth noting, at this point, that the video appears to have been filmed on the same day as <em>Western Stars, </em>the movie. In addition to Bruce&#8217;s barn obviously serving as the bar in the video, Bruce is wearing the same outfit in both films. I don&#8217;t think it&#8217;s the same performance in both, however, because the video takes pains to show Patti in the audience rather than on stage&#8211;an artistic choice, I believe, in service of maintaining the illusion of the narrator is a lonely figure lost in his own introspection.)</p>\n<p>We return to the bar now, as our western star spins another tale of yesteryear.</p>\n<p style=\"padding-left: 40px;\"><em>Once I was shot by John Wayne, yeah it was towards the end</em><br />\n<em>That one scene&#8217;s bought me a thousand drinks, set me up and I&#8217;ll tell it for you, friend</em></p>\n<p>I love Bruce&#8217;s acting during this passage: there&#8217;s a world-weariness on display as he tells the John Wayne story for what must be the thousandth time, and yet when he offers to tell it again in exchange for a drink, there&#8217;s a wry smile too&#8211;he&#8217;s a bit of a raconteur, and he knows how to use it to his advantage.</p>\n<p>As we enter the final chorus, we reach my favorite moment in the video. When Bruce sings &#8220;bright again&#8221; in the second line below, his eyes widen and Zimny&#8217;s camera lens catches a flare of light behind Bruce that underscores the moment. An instant later, Bruce sets his truck in motion, his eyes leaving the behind the rear view mirror as he focuses forward, and he places his hat&#8211;the symbol of his glory days&#8211;firmly on his head. It&#8217;s a terrific few seconds of storytelling.</p>\n<p style=\"padding-left: 40px;\"><em>Here&#8217;s to the cowboys, riders in the whirlwind</em><br />\n<em>Tonight the western stars are shining bright again</em><br />\n<em>And the western stars are shining bright again</em></p>\n<p>He&#8217;s still not going anywhere in particular; there&#8217;s no <em>more</em> to drive to. But he&#8217;s at least in motion, at least living his <em>again</em>. One last time, Bruce suggests the present as unable to erase the timeless elements of this particular place (and person):</p>\n<p style=\"padding-left: 40px;\"><em>Tonight the riders on Sunset are smothered in the Santa Ana winds</em><br />\n<em>And the western stars are shining bright again</em><br />\n<em>Come on and ride me down easy, ride me down easy, friend</em><br />\n<em>&#8216;Cause tonight the western stars are shining bright again</em></p>\n<p>&#8220;Ride me down easy&#8221; is a reference to the Billy Joe Shaver-penned song by the same name&#8211;another song about satisfaction at the twilight of a life well-lived (adding more credence to the argument that &#8220;Western Stars&#8221; is a song of contentment rather than a song of resignation. From Shaver&#8217;s song:</p>\n<div class=\"ujudUb\" style=\"padding-left: 40px;\"><em>It&#8217;s been a good month of Sundays and a guitar to go</em><br />\n<em>Had a tall drink of yesterday&#8217;s wine</em><br />\n<em>Left a lot of good friends some sheep&#8217;s in the wind</em><br />\n<em>And satisfied women behind.</em></div>\n<div class=\"ujudUb\" style=\"padding-left: 40px;\"><em>Ride me down easy Lord, ride me on down</em><br />\n<em>Leave word in the dust where I lay</em><br />\n<em>Say I&#8217;m easy, come easy go</em><br />\n<em>And easy to love when I stay.</em></div>\n<p>Bruce leaves us at the place where we began: <em>Again</em>. Another morning, another day to be grateful to be alive.</p>\n<p style=\"padding-left: 40px;\"><em>I woke up this morning, just glad my boots were on&#8230;</em></p>\n<p>In the film for <em>Western Stars</em>, Bruce introduced the title track like this:</p>\n<p style=\"padding-left: 40px;\"><em>&#8220;Western Stars&#8221; is the heart of the record. It was my reference point when I was searching for who my character was and where he, I, was headed. You&#8217;ve got a fading Western film star watching the world change around him, watching it pass him by&#8230; He&#8217;s the oldest guy in the room, but he&#8217;s still got an inner compass that doesn&#8217;t allow him to bullshit himself. He knows exactly who he is, what he&#8217;s done, the good, the bad and the ugly of it. It&#8217;s his small redemption. And he&#8217;s made a relative peace with himself. He&#8217;s losing old friends quickly, a lot of empty boots. But he wakes up in the morning, glad that his are still on.</em></p>\n<p>It&#8217;s the opposite of a Freudian slip: Bruce intentionally pauses to let us know that he views the narrator of &#8220;Western Stars&#8221; as a proxy for himself.  He knows he&#8217;s a symbol of the past, not the present, and while he&#8217;s far from creatively done, he recognizes that he&#8217;s fading into the cultural background. (It&#8217;s not the first time he&#8217;s addressed this in song&#8211;see &#8220;<a href=\"http://estreetshuffle.com/index.php/2019/02/17/roll-of-the-dice-girls-in-their-summer-clothes/\">Girls in Their Summer Clothes.</a>&#8220;)</p>\n<p>But he still wakes up every morning to do what he loves most.</p>\n<p>Let&#8217;s all be thankful that his boots are still firmly on.</p>\n<hr />\n<p>&#8220;Western Stars&#8221; is one of Bruce&#8217;s newest songs, and he hasn&#8217;t toured behind the album for which it serves as the title track. He&#8217;s performed it live at least once, though. We know because it was captured on film and audio for the film <em>Western Stars. </em></p>\n<p>You can listen to the live recording below, but I honestly think you&#8217;re better off listening to the studio version another time: the studio version is more lush, Bruce&#8217;s vocals more pure, and the arrangement identical (both tracks are the same length, to the second). <em>Western Stars</em> is perhaps the only album in Bruce&#8217;s catalog that can&#8217;t be improved upon live.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Western Stars (Film Version - Official Audio)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/WjOIf_Z1c1M?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Bonus:</strong> Here&#8217;s a promotional clip from the movie, <em>Western Stars</em>. It&#8217;s only a partial performance of the title track, but it&#8217;s enough for us to recognize that both the film and the video were probably shot at or around the same time.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Western Stars (From The Film Western Stars)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/GBRPo6lQRBg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Western Stars<br />\nRecorded:</strong> Unknown<br />\n<strong>Released: </strong><em>Western Stars </em>(2019)<br />\n<strong>First performed:</strong> April 2019 (Colts Neck, NJ)<br />\n<strong>Last performed:</strong> April 2019 (Colts Neck, NJ)</p>\n<p>Looking for your favorite Bruce song? Check our <a href=\"http://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">full index</a>. New entries every week!</p>\n", "protected": false}, "excerpt": {"rendered": "<p>&#8220;Western Stars&#8221; is Bruce&#8217;s magnum opus&#8211;a gorgeously cinematic, metatextual commentary on his life&#8217;s work and journey.</p>\n", "protected": false}, "author": 1, "featured_media": 17355, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [2416], "class_list": ["post-16557", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-western-stars"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/western-1.jpg?fit=1500%2C1500&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-4j3", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 25933, "url": "https://estreetshuffle.com/index.php/2021/04/10/roll-of-the-dice-there-goes-my-miracle/", "url_meta": {"origin": 16557, "position": 0}, "title": "Roll of the Dice: There Goes My Miracle", "author": "Ken", "date": "April 10, 2021", "format": false, "excerpt": "The second single from Western Stars is a standout, from Bruce's Orbisonian vocals to his anti-thematic lyrics.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/miracle.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/miracle.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/miracle.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/miracle.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/miracle.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 15625, "url": "https://estreetshuffle.com/index.php/2020/01/26/roll-of-the-dice-chasin-wild-horses/", "url_meta": {"origin": 16557, "position": 1}, "title": "Roll of the Dice: Chasin&#8217; Wild Horses", "author": "Ken", "date": "January 26, 2020", "format": false, "excerpt": "Poignant, elegiac, and ironic, \"Chasin' Wild Horses\" is the perfect centerpiece for Bruce's finest album. It demands and rewards careful listening and inspection.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/01/wildhorses.jpg?fit=1200%2C800&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/01/wildhorses.jpg?fit=1200%2C800&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/01/wildhorses.jpg?fit=1200%2C800&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/01/wildhorses.jpg?fit=1200%2C800&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/01/wildhorses.jpg?fit=1200%2C800&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 18295, "url": "https://estreetshuffle.com/index.php/2020/05/25/roll-of-the-dice-tucson-train/", "url_meta": {"origin": 16557, "position": 2}, "title": "Roll of the Dice: Tucson Train", "author": "Ken", "date": "May 25, 2020", "format": false, "excerpt": "The third single off Western Stars is one of Bruce's most hopeful, optimistic, and joyous songs--a masterpiece of a pop song that ranks among his very best.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/tucson.jpg?fit=1200%2C669&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/tucson.jpg?fit=1200%2C669&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/tucson.jpg?fit=1200%2C669&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/tucson.jpg?fit=1200%2C669&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/tucson.jpg?fit=1200%2C669&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 23950, "url": "https://estreetshuffle.com/index.php/2021/01/17/roll-of-the-dice-drive-fast-the-stuntman/", "url_meta": {"origin": 16557, "position": 3}, "title": "Roll of the Dice: Drive Fast (The Stuntman)", "author": "Ken", "date": "January 17, 2021", "format": false, "excerpt": "My favorite song on Western Stars is arguably the most romantic and (literally) cinematic song in Bruce's entire catalog.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 35382, "url": "https://estreetshuffle.com/index.php/2022/06/09/roll-of-the-dice-somewhere-north-of-nashville/", "url_meta": {"origin": 16557, "position": 4}, "title": "Roll of the Dice: Somewhere North of Nashville", "author": "Ken", "date": "June 9, 2022", "format": false, "excerpt": "The shortest song on Western Stars is also the most poignant, a two-minute character study in loss and regret.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/06/nashville.jpg?fit=1200%2C750&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/06/nashville.jpg?fit=1200%2C750&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/06/nashville.jpg?fit=1200%2C750&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/06/nashville.jpg?fit=1200%2C750&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/06/nashville.jpg?fit=1200%2C750&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 21256, "url": "https://estreetshuffle.com/index.php/2020/09/16/roll-of-the-dice-evacuation-of-the-west/", "url_meta": {"origin": 16557, "position": 5}, "title": "Roll of the Dice: Evacuation of the West", "author": "Ken", "date": "September 16, 2020", "format": false, "excerpt": "Part spaghetti western, part Mad Max, part War of the Worlds, \"Evacuation of the West\" is a brilliant, cinematic, fully realized E Street Band outtake that cries out for an official release.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/cowboysaliens.jpg?fit=1072%2C1047&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/cowboysaliens.jpg?fit=1072%2C1047&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/cowboysaliens.jpg?fit=1072%2C1047&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/cowboysaliens.jpg?fit=1072%2C1047&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/cowboysaliens.jpg?fit=1072%2C1047&ssl=1&resize=1050%2C600 3x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/16557", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=16557"}], "version-history": [{"count": 20, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/16557/revisions"}], "predecessor-version": [{"id": 47549, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/16557/revisions/47549"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/17355"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=16557"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=16557"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=16557"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}