{"id": 28857, "date": "2021-08-13T05:20:00", "date_gmt": "2021-08-13T12:20:00", "guid": {"rendered": "https://estreetshuffle.com/?p=28857"}, "modified": "2025-01-06T20:47:10", "modified_gmt": "2025-01-07T04:47:10", "slug": "roll-of-the-dice-my-fathers-house", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2021/08/13/roll-of-the-dice-my-fathers-house/", "title": {"rendered": "Roll of the Dice: My Father&#8217;s House"}, "content": {"rendered": "<p>My dad died today.</p>\n<p>He passed away peacefully in his sleep after a swift and vicious stealth attack from bile duct cancer that he didn&#8217;t even know he had a month ago.</p>\n<p>My dad died, and &#8220;My Father&#8217;s House&#8221; has been lodged in my brain all day, although not for the reason you might think if you&#8217;re familiar with the song.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - My Father&#039;s House (Springsteen on Broadway - Official Audio)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/0ZsVLKGpKKQ?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>My relationship with my father was not like Bruce&#8217;s with his own. My dad wasn&#8217;t my hero, and he certainly wasn&#8217;t my foe.</p>\n<p>He was just my dad. He had deep flaws (as do we all), and he had amazing virtues (as do we all). And one of the latter was his ability to recognize and reckon with the former.</p>\n<p>He wasn&#8217;t a great father at the outset, mostly absent, irritable and pre-occupied. My parents&#8217; fights were frequent and furious, and it was almost a relief when they divorced as I entered my teen years.</p>\n<p>But when he re-married shortly thereafter and I gained a weekend step-mom, -brother, and -sister who I learned to love as deeply as my own, he recognized the opportunity for a do-over. He softened, learned to laugh at himself, and took joy in the family he and my stepmom cobbled together. Year by year, he grew into his role, and I grew into mine.</p>\n<p>One summer day when I was in high school, he called my mom&#8217;s house (where I lived during the week), and asked me if I wanted to spend the day with him. It was the first time in my life that he&#8217;d ever done that: spontaneously asked to spend a full day, just him and me.</p>\n<p>We drove to the Old City and spent the day walking the cobblestoned streets and the riverfront, just talking. He took me to one of his favorite pizza places that I&#8217;d never heard of, and we had ice cream. Mostly, we just talked about anything and everything. That day stretched on forever, in the best way. I didn&#8217;t want it to end.</p>\n<p>We never had another day quite like that one. We rarely had the time, and our family was large enough that we were almost never alone. I was almost grown, and before long I&#8217;d move across the country to start my own family.</p>\n<p>But that day meant everything to me. Even at the time, I knew it was a turning point in our relationship, which had previously been one more of familial obligation rather than genuine connection.</p>\n<p>I cried tears of release and relief that night, and I listened to&nbsp;<em>Nebraska&nbsp;</em>in the dark of my room, waiting for &#8220;My Father&#8217;s House&#8221; near the end of the album.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"My Father&#039;s House\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/jj673EsRslk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>I was far too young and too close to my own daddy issues to understand or relate to Bruce&#8217;s history with his father. But even on first listen a couple of years earlier, I recognized &#8220;My Father&#8217;s House&#8221; instantly for what it was, for what Bruce meant it to be: an intervention.</p>\n<p>I understood the warning Bruce was sending me: our loved ones won&#8217;t be here forever. Maybe we can&#8217;t break the ties that bind, but we can slip them.&nbsp;<em>You walk too far, you walk away</em>.</p>\n<p>I had been gradually walking away, but on that day the ties tautened.</p>\n<p>&#8220;My Father&#8217;s House&#8221; terrified me like no other song before or since.&nbsp;It&#8217;s easy to understand why: the song itself is crafted around a nightmare.</p>\n<p style=\"padding-left: 40px\"><em>Last night I dreamed that I was a child</em><br />\n<em>Out where the pines grow wild and tall</em><br />\n<em>I was trying to make it home through the forest</em><br />\n<em>Before the darkness falls</em></p>\n<p style=\"padding-left: 40px\"><em>I heard the wind rustling through the trees</em><br />\n<em>And ghostly voices rose from the fields</em><br />\n<em>I ran with my heart pounding down that broken path</em><br />\n<em>With the devil snapping at my heels</em></p>\n<p style=\"padding-left: 40px\"><em>I broke through the trees and there in the night</em><br />\n<em>My father&#8217;s house stood shining hard and bright</em><br />\n<em>The branches and brambles tore my clothes and scratched my arms</em><br />\n<em>But I ran till I fell shaking in his arms</em></p>\n<p>Bruce had already written &#8220;<a href=\"https://estreetshuffle.com/index.php/2019/01/22/roll-of-the-dice-downbound-train/\">Downbound Train</a>&#8221; by this point, which features a remarkably similar and equally powerful dream sequence. But as brilliantly cinematic as it is, the dream in &#8220;Downbound Train&#8221; is just a narrative device; the dream that opens &#8220;My Father&#8217;s House&#8221; by contrast is deeply symbolic.</p>\n<p>The dream takes place at night, in the darkness&#8211;a metaphor for the scary and dangerous world of adulthood. For most of us, our parents serve not only as our caretakers and teachers, but also our role models and moral guides. The narrator&#8217;s father&#8217;s house represents a place of innocence, guidance, acceptance, forgiveness, and unconditional love (whether or not those things characterized his childhood home in the waking world).</p>\n<p>Our narrator&#8217;s desperation to reach his father&#8217;s house &#8220;before the darkness falls&#8221; suggests at the outset that in the waking world, adulthood has severed his relationship with his father. But it also suggests that he&#8217;s gone down a path he&#8217;s not proud of&#8211;that he&#8217;s made decisions he regrets&#8211;and his father&#8217;s house represents not just forgiveness and reconciliation but also redemption. Note the references to the &#8220;broken path,&#8221; the devil at his heels, and the brambles that tear at him as he reaches toward his father&#8217;s house. These are the cries of a son lacking his father&#8217;s guidance.</p>\n<p>But the song gets even scarier when the narrator awakens:</p>\n<p style=\"padding-left: 40px\"><em>I awoke and I imagined the hard things that pulled us apart</em><br />\n<em>Will never again, sir, tear us from each other&#8217;s hearts</em><br />\n<em>I got dressed and to that house I did ride</em><br />\n<em>From out on the road I could see its windows shining in light</em></p>\n<p style=\"padding-left: 40px\"><em>I walked up the steps and stood on the porch</em><br />\n<em>A woman I didn&#8217;t recognize came and spoke to me through a chained door</em><br />\n<em>I told her my story and who I&#8217;d come for</em><br />\n<em>She said &#8220;I&#8217;m sorry son but no one by that name lives here anymore&#8221;</em></p>\n<p>These two verses are, I think, the saddest and most anguished in Bruce&#8217;s entire catalog.</p>\n<p>The son wakes and resolves to repair his relationship with his father, but it&#8217;s too late&#8211;he&#8217;s gone. His father has moved, or perhaps he&#8217;s even dead. The fact that either possibility could be true without his son learning sooner and more directly tells us all we need to know about just how distanced they&#8217;d become. The chained door is a beautifully cruel touch: it allows our narrator to peek inside at the redemption and healing he so craves while denying him admittance.</p>\n<p>The final verse is a stark warning:</p>\n<p style=\"padding-left: 40px\"><em>My father&#8217;s house shines hard and bright</em><br />\n<em>It stands like a beacon calling me in the night</em><br />\n<em>Calling and calling so cold and alone</em><br />\n<em>Shining &#8216;cross this dark highway where our sins lie unatoned</em></p>\n<p>&#8220;My Father&#8217;s House&#8221; haunted me as a teen, replaying in my mind every time I found myself growing sullen or rebellious towards my father (which admittedly was not an infrequent occurrence). We never had a lot in common, but we were able to find games we enjoyed playing and rare topics we enjoyed discussing.</p>\n<p>As the first-born child, I was too old to fully benefit as he gradually grew into a great father, but when I became a father myself he was the source of wisdom, support, and encouragement that I needed. We bonded in our love for our roles as parents.</p>\n<p>Time passed, and we both grew older. Fifteen years ago, my father suffered an almost fatal injury that we were certain wasn&#8217;t going to be an &#8220;almost.&#8221; We gathered at his bedside to say goodbye, but he battled back to us, although not without some lasting damage and effects.</p>\n<p>Similar scenes played out with frightening frequency over the next decade and a half, and each time we thought we&#8217;d said goodbye, my father cheated death. We laughed about it, joked about it, and came to actually believe it: our father had nine lives. Death wasn&#8217;t strong enough to claim him.</p>\n<p>It took pieces of him, though: his kidneys, his faculties, his mobility. Last week, he hosted a belated wedding party for my daughter and son-in-law (they married during the pandemic without distant family in attendance), and unless you knew it took four hours of dialysis and two grown men to lift him from his car or chair to his walker, you wouldn&#8217;t suspect it from his joy of living and his stubborn refusal to let anything stop him. It was a week ago, and at the time we thought he still had a year to live.</p>\n<p>I took pieces of him, too. Especially in the last decade or so, little bits of my dad&#8217;s personality have found their way into me. His sense of humor made the leap first&#8211;my kids were quick to point that out. His impatience with delayed gratification came, too, along with perhaps a bit too much of his tendency to overwork, and a healthy dose of his willingness to drop everything at a moment&#8217;s notice when someone needs help.</p>\n<p>Three days after the wedding party, my brother and I took him to the emergency room, where he was admitted for the cancer that had spread at a speed we couldn&#8217;t wrap our heads around. Eight days later, he was gone.</p>\n<p>I spent this last week by his bedside, and he spent it mostly reminiscing. He told stories I&#8217;d never heard before of people I only knew as names on our family tree. During a moment of silence, I asked him to tell me about the best day in his life. He pondered the question for a minute, and then simply answered, &#8220;your bar mitzvah.&#8221;</p>\n<p>That made me laugh, because it was a religious ritual I resisted fiercely at the time. I wanted no part of it, and we fought constantly during my thirteenth year over my determination to sabotage it. I asked him why, and he said it was &#8220;a beautiful affair&#8221; with the family all around us, and I told him I&#8217;d take his word for it. I honestly had no recollection of it forty years later.</p>\n<p>He asked me what the best day of my life was, and in what turned out to be the last substantive conversation I&#8217;d ever have with my dad, I lied. I told him it was the day I became a father, and he nodded approvingly.</p>\n<p>I&#8217;d never once spoken of how meaningful that day we spent together was, and although it had been on my mind all week and I&#8217;d fully intended to share it, in that moment I decided to be selfish. Part of me ached to know why he chose that particular day all those summers ago to make that connection with me, but a bigger part of me hoped he&#8217;d have no idea what I was talking about. It would mean a lot if he made a conscious choice to have a relationship with his son; it would mean even more if he thought we&#8217;d always had one.</p>\n<p>At the very end, he told me I was the leader of our family now, and I promised to look after them all. I thanked him for everything he&#8217;d taught me both through example and counter-example, and he smiled weakly, and told me he was proud of me for sorting out one from the other.</p>\n<p>Today, as I listened to his friends and family share stories about him, I realized just how much more of him there is in me than I&#8217;d ever allowed myself to realize. Tonight, in a moment of grace, I embraced it.</p>\n<p>I unchained a door in my heart, welcomed all the wonderful traits and idiosyncrasies that made him my dad, and invited them to find a nook and make themselves comfortable.</p>\n<p>I am my father&#8217;s house now, and as long as I&#8217;m here, he has a home.</p>\n<p><strong>Donald Stephen Rosen</strong><br />\n<strong>December 23, 1942 &#8211; August 12, 2021</strong></p>\n<p>(I&#8217;m going to take a short break while I join my family in remembering my father. I&#8217;ll be back in a week.)</p>\n<p><strong>My Father&#8217;s House<br />\nRecorded:</strong> May 25, 1982<br />\n<strong>Released:</strong>&nbsp;<em>Nebraska&nbsp;</em>(1982),&nbsp;<em>Chapter and Verse</em> (2016)<br />\n<strong>First performed:</strong> July 26, 1984 (Toronto, ON)<br />\n<strong>Last performed:</strong> September 4, 2021 (New York City, NY)</p>\n<p>Looking for your favorite Bruce song? Check our full index&nbsp;<a href=\"https://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">here</a>. New entries every week!</p>\n<p>&nbsp;</p>\n", "protected": false}, "excerpt": {"rendered": "<p>In memory of Donald Stephen Rosen (December 23, 1942 &#8211; August 12, 2021)</p>\n", "protected": false}, "author": 1, "featured_media": 28894, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [1090, 54], "class_list": ["post-28857", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-my-fathers-house", "tag-nebraska"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/08/dad.jpg?fit=716%2C580&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-7vr", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 10316, "url": "https://estreetshuffle.com/index.php/2019/06/13/roll-of-the-dice-used-cars/", "url_meta": {"origin": 28857, "position": 0}, "title": "Roll of the Dice: Used Cars", "author": "Ken", "date": "June 13, 2019", "format": false, "excerpt": "\"Used Cars\" is one of Bruce's most honestly autobiographical songs. Beneath its vignette veneer lies powerful, nuanced themes of shame and alienation. Let's explore and listen to rare performances inside.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/06/RoadhouseUsedCars.gif?fit=500%2C375&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 31751, "url": "https://estreetshuffle.com/index.php/2011/01/13/roll-of-the-dice-border-guard/", "url_meta": {"origin": 28857, "position": 1}, "title": "Border Guard", "author": "Ken", "date": "January 13, 2011", "format": false, "excerpt": "Bruce earliest song about the California border may hold deeper meaning than a casual listen might reveal.", "rel": "", "context": "In &quot;Greetings&quot;", "block_context": {"text": "Greetings", "link": "https://estreetshuffle.com/index.php/category/greetings/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/12/border-scaled.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/12/border-scaled.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/12/border-scaled.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/12/border-scaled.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/12/border-scaled.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 35690, "url": "https://estreetshuffle.com/index.php/2022/06/19/roll-of-the-dice-long-time-comin/", "url_meta": {"origin": 28857, "position": 2}, "title": "Roll of the Dice: Long Time Comin&#8217;", "author": "Ken", "date": "June 19, 2022", "format": false, "excerpt": "The final chapter in Bruce's father-and-son songwriting.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/06/camping.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/06/camping.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/06/camping.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/06/camping.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/06/camping.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 11635, "url": "https://estreetshuffle.com/index.php/2019/08/10/cover-me-ben-harper-my-fathers-house/", "url_meta": {"origin": 28857, "position": 3}, "title": "Cover Me, Ben Harper: My Father&#8217;s House", "author": "Ken", "date": "August 10, 2019", "format": false, "excerpt": "Thanks to a pro-shot filmed appearance in a French radio studio, we can finally see and hear Ben Harper's *complete* cover of \"My Father's House.\"", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/08/various-my-city-of-ruins.jpg?fit=520%2C520&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 36967, "url": "https://estreetshuffle.com/index.php/2022/08/12/roll-of-the-dice-wrecking-ball/", "url_meta": {"origin": 28857, "position": 4}, "title": "Roll of the Dice: Wrecking Ball", "author": "Ken", "date": "August 12, 2022", "format": false, "excerpt": "A farewell to an aging stadium became a life-affirming title track.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/wball.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/wball.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/wball.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/wball.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/wball.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 5306, "url": "https://estreetshuffle.com/index.php/2018/10/31/roll-of-the-dice-factory/", "url_meta": {"origin": 28857, "position": 5}, "title": "Roll of the Dice: Factory", "author": "Ken", "date": "October 31, 2018", "format": false, "excerpt": "\"Factory\" ranks among the best of Bruce's early song-writing, with lyrical economy and an instrumental track both spare and ornate--it's a marvel of restraint and emotional bravery.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/10/factory.jpg?fit=400%2C400&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/28857", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=28857"}], "version-history": [{"count": 21, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/28857/revisions"}], "predecessor-version": [{"id": 55680, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/28857/revisions/55680"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/28894"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=28857"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=28857"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=28857"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}