{"id": 30616, "date": "2021-11-04T05:00:00", "date_gmt": "2021-11-04T12:00:00", "guid": {"rendered": "https://estreetshuffle.com/?p=30616"}, "modified": "2023-01-03T06:41:05", "modified_gmt": "2023-01-03T14:41:05", "slug": "two-faces-western-stars", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2021/11/04/two-faces-western-stars/", "title": {"rendered": "Two Faces: Western Stars"}, "content": {"rendered": "<div class=\"su-box su-box-style-default\" id=\"\" style=\"border-color:#000000;border-radius:3px;\"><div class=\"su-box-title\" style=\"background-color:#333333;color:#FFFFFF;border-top-left-radius:1px;border-top-right-radius:1px\">Editor's Note</div><div class=\"su-box-content su-u-clearfix su-u-trim\" style=\"border-bottom-left-radius:1px;border-bottom-right-radius:1px\">\n<p><span style=\"font-size: 12pt;\"><strong><em>Editor&#8217;s Note:</em></strong></span> <span style=\"font-size: 16px;\"><i><span style=\"font-size: 16px;\">For four years, I&#8217;ve been working my way through Bruce&#8217;s catalog, song by song, day by day. I&#8217;ve had some great guest-writers along the way, but always in the &#8220;Where the Band Was&#8221; series. When it comes to analyzing Bruce&#8217;s songs, I&#8217;ve held the Roll of the Dice series with a pretty tight grip.</span></i></span></p>\n<p><span style=\"font-size: 16px;\"><i>But then I met Katy Crane. Katy caught my interest from the very first of a string of deeply insightful comments in response to my Roll of the Dice articles, featuring provocative takes, surprising connections, broad musical knowledge, and a writer&#8217;s voice I only aspire to.</i></span></p>\n<p><span style=\"font-size: 16px;\"><i>We usually found ourselves in agreement about a particular song, but my favorite days were the ones where Katy would provide counter-takes so persuasively written and backed up that I couldn&#8217;t help but see a song I thought I knew in a brand new light.</i></span></p>\n<p><span style=\"font-size: 16px;\"><i>So what do you do when you discover a reader whose comments deserve a &#8220;Hold my beer&#8221; subject line? Well&#8230; I hold her beer.</i></span></p>\n<p><span style=\"font-size: 16px;\"><i>Meet Katy Crane, a writer and teacher from interior Alaska. She recently moved from a small town to a big city and dealt with the culture shock by becoming an obsessive Springsteen fan. Her favorite Springsteen album is <em>Nebraska, </em>and she thinks &#8220;<a href=\"https://estreetshuffle.com/index.php/2018/02/02/roll-of-the-dice-crush-on-you/\">Crush on You</a>&#8221; is a good song and &#8220;Jungleland&#8221; is overrated. </i></span></p>\n<p><span style=\"font-size: 16px;\"><i>Katy makes her first of what I fervently hope will be many appearances here today, in a new series we&#8217;re calling <strong>Two Faces</strong>, featuring alternative interpretations to the ones I&#8217;ve put forward in the Roll of the Dice series.</i></span></p>\n<p><span style=\"font-size: 16px;\"><i>Take it away, Katy!</i></span></p>\n</div></div>\n<p>&nbsp;</p>\n<p><em>I am become a name;<br />\n</em><em>For always roaming with a hungry heart<br />\n</em><em>Much have I seen and known<br />\n</em><em>                                                       &#8212; Tennyson, “Ulysses”</em></p>\n<p><em>Push off, and sitting well in order smite<br />\n</em><em>The sounding furrows; for my purpose holds<br />\n</em><em>To sail beyond the sunset, and the baths<br />\n</em><em>Of all the western stars, until I die.<br />\n</em>                                                       &#8212; Tennyson, “Ulysses” (toward the end)</p>\n<hr />\n<p>“Western Stars” is a song about someone living in the past: a portrait of an aging, washed-up star of Hollywood Westerns, who still hangs on to enough shreds of fame to keep him in commercials and free drinks. That much we can all agree on. (And by “we” I mean me, Ken, and Bruce Springsteen, who weighed in on the meaning of the song in his <em>Western Stars</em> feature film.)</p>\n<p>Where opinions get divided, though, is on the question of how we’re supposed to feel about it. Is the song, as Springsteen suggests in the film, an admiring portrait of someone who may be past his prime but still knows who he is? Or is it something darker, more akin to “Glory Days,” a portrait of someone taking refuge from the present in an idealized dream of the past?</p>\n<p>Ken has already written a great <a href=\"https://estreetshuffle.com/index.php/2020/03/28/roll-of-the-dice-western-stars/\">analysis of the song from the first viewpoint</a>, the optimistic one. And now he’s very kindly offered me the chance to present the opposite take: “Western Stars” as a day in the life of a depressed and lonely alcoholic.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Western Stars (Official Video)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/_IXzAAKrsFE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Ken points out that “Western Stars” has much the same beginning as “Dancing in the Dark.” And like “<a href=\"https://estreetshuffle.com/index.php/2021/12/25/roll-of-the-dice-dancing-in-the-dark/\">Dancing in the Dark</a>,” it slips something by you. It plays with what you think you know, what you think you’re hearing.</p>\n<p>The first time you hear the lyric “I get up in the evening,” there’s a little jolt of surprise, of a cliché being overturned. Only on a second listen do you hear the line as the literal truth: the daily grind of a character who works nights, goes to bed in the morning, gets up after dark.</p>\n<p>“Western Stars” has a similarly slippery beginning. “I wake up in the morning,” Bruce tells us, “just glad my boots are on.” And because his character doesn’t see anything odd about waking up with his boots on, it’s easy to miss what a weird image this is. It’s easy to hear it as a metaphor for waking up in one piece, ready to greet another day. But stop a moment and think about it literally, as a character detail, and the whole song changes.</p>\n<p>In real life, who wakes up with their boots on? Someone who passed out fully clothed the night before, that’s who. Who wakes up in the morning <em>glad</em> their boots are on? Someone who passes out with their boots on so often that they&#8217;ve come to think of it as normal.</p>\n<p>And with that, a part of the story snaps into focus. This is a character who wakes up hung over and spends the day getting progressively drunker, to finally pass out and do it all again the next day. And we’re about to follow him through his day, find out how and why he got here. (Think of it as the Springsteen version of <em>The Hangover</em> or <em>Dude, Where’s My El Camino?</em>)</p>\n<p>First stop, the set of a Viagra commercial.</p>\n<p style=\"padding-left: 40px;\"><em>On the set, the makeup girl brings me two raw eggs and a shot of gin<br />\nThen I give it all up for that little blue pill<br />\nThat promises to bring it all back to you again.</em></p>\n<p>The long-suffering makeup girl brings our star his first drink of the day, a combined breakfast and hangover cure. And then he goes out on the set and shills for Viagra. There’s some cynicism in that last line; he knows he’s selling false promises &#8211; of youth, romance, second chances &#8211; along with the pills.</p>\n<p>The chorus comes in:</p>\n<p style=\"padding-left: 40px;\"><em>Ride me down easy, ride me down easy, friend<br />\nTonight the western stars are shining bright again.</em></p>\n<p>This is a patchwork chorus, assembled from the classics. The opening line comes from Billy Joe Shaver’s 1973 song “Ride Me Down Easy,” a song that envisions God as a jockey, a rider taking a horse for a gentle ride after a long and tiring race.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Waylon Jennings - Ride Me Down Easy\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/7XS3IE3ktJ8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>The phrase “western stars” has a double, or even a triple meaning; the stars that hang over the American West (reminiscent of Woody Guthrie’s “California Stars,” a painfully nostalgic late-career song, released posthumously), the vanished stars of Hollywood Westerns, and lastly, the Tennyson poem “Ulysses,” the same portrait of Odysseus in old age that gave us the title “<a href=\"https://estreetshuffle.com/index.php/2022/12/21/roll-of-the-dice-hungry-heart/\">Hungry Heart</a>.”</p>\n<p>In other words, there is a staggering amount of Past packed into that chorus. And yet, with the strings rising gently behind it, it sounds hopeful. The singer sounds as if he expects the past to return, the western stars to resurrect themselves, as if he’s just waiting for everything to come back to life.</p>\n<p>Next stop, the canyons above Sunset, where the song begins to feel cinematic. The camera pans out to show us the Hollywood of classic noir: a violent place where the veneer of civilization is thin. We watch a coyote carrying off a chihuahua: a predator with its completely outmatched prey. A similar scene plays out at the Whiskey Bar, where the narrator chats up “a lost sheep from Oklahoma,” &#8211; another prey animal &#8211; who is out of place enough to order a mojito and young enough to know him only as the actor from a commercial.</p>\n<p>Mellowed by whiskey and flirtation, the narrator falls into a reverie about the one part of his life that he still loves: the days when he goes rodeo riding out in the desert. Yet even here, there’s an overwhelming sense of nostalgia.</p>\n<p style=\"padding-left: 40px;\"><em>East to the desert where the charros, they still ride and rope<br />\nOur American brothers cross the wire and bring the old ways with them.</em></p>\n<p>This is another way of trying to relive the past, then: different from Viagra but just as tempting.</p>\n<p>Up till now, the musical backing has been restrained.  But now, as the drinks and the reminiscence take effect, the orchestra surges in behind Bruce. The strings swell, swoopy and syrupy and nostalgic. The chorus returns, stronger and more triumphant than before, driving us toward the end of the night, toward whatever it is that the singer is chasing.</p>\n<p>And then we’re back at the bar, and it’s time for another drink. “Once I was shot by John Wayne,” the singer tells us, conversationally, and we can see him turning toward us on his barstool. “Yeah, it was toward the end.” One of several lines that ring through the song like the tolling of a bell: <em>Yeah, it was toward the end. These days there ain’t no more. Bring it all back to you again. </em></p>\n<p>Now we know who the “friend” of the chorus is: it’s us. We’re the anonymous stranger buying this man drinks while he tells his John Wayne story for the thousandth time. This is what “ride me down easy” means; this is what the singer is asking of us.</p>\n<p>He’s not at home in the present, where he’s a washed-up actor, an old man hawking pills and credit cards. He lives his real life in a Western movie that’s playing out in his mind. But he needs a way into that movie; he needs the alcohol to cushion things; he needs an audience. The word “friend” here is grimly ironic: his “friend” is always a stranger, someone to whom his story is new.</p>\n<p>So we buy him drinks, and he toasts “the cowboys &#8211; riders in the whirlwind,” and the strings get ever swoopier as he slides further into his dream. The line between life and the movies disappears; he’s no longer just an actor; now he’s also the cowboy, the hero, the guy riding up on a horse in a cloud of dust. And as he drifts away from reality and takes refuge in his mind, his mind rewards him with a last glorious vision: the riders on Sunset, “smothered in the Santa Ana winds.”</p>\n<p>The orchestra crashes back in, the strings swoop and soar, dramatic and stirring. He’s reliving his glory days, and we’re right there with him, caught up in the sudden beauty of his vision. This is what he’s been chasing all day. This is what it means for the Western stars to be shining bright.</p>\n<p>But then the day ends. Our hero passes out. The music drops to almost nothing, the vision fades, and we’re left back where we started.</p>\n<p><em>I woke up this morning, just glad my boots were on.</em></p>\n<p>&nbsp;</p>\n", "protected": false}, "excerpt": {"rendered": "<p>Introducing guest-blogger Katy Crane in her first of hopefully many appearances. Today she offers a counter-take to my interpretation of &#8220;Western Stars.&#8221;</p>\n", "protected": false}, "author": 1, "featured_media": 30670, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3326], "tags": [2416], "class_list": ["post-30616", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-two-faces", "tag-western-stars"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/11/f23405-20190425-bruce-springsteen-western-stars.jpg?fit=2000%2C2000&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-7XO", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 7341, "url": "https://estreetshuffle.com/index.php/2019/01/26/bloggers-note-check-out-our-new-album-by-album-index/", "url_meta": {"origin": 30616, "position": 0}, "title": "Blogger&#8217;s Note: Check out our new Album-by-Album index", "author": "Ken", "date": "January 26, 2019", "format": false, "excerpt": "We now have an Album-by-Album Index for the Roll of the Dice series! Check it out and see if we've covered your favorite song yet.", "rel": "", "context": "In \"Index\"", "block_context": {"text": "Index", "link": "https://estreetshuffle.com/index.php/tag/index/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/albums.jpg?fit=1024%2C683&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/albums.jpg?fit=1024%2C683&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/albums.jpg?fit=1024%2C683&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/01/albums.jpg?fit=1024%2C683&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 18295, "url": "https://estreetshuffle.com/index.php/2020/05/25/roll-of-the-dice-tucson-train/", "url_meta": {"origin": 30616, "position": 1}, "title": "Roll of the Dice: Tucson Train", "author": "Ken", "date": "May 25, 2020", "format": false, "excerpt": "The third single off Western Stars is one of Bruce's most hopeful, optimistic, and joyous songs--a masterpiece of a pop song that ranks among his very best.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/tucson.jpg?fit=1200%2C669&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/tucson.jpg?fit=1200%2C669&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/tucson.jpg?fit=1200%2C669&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/tucson.jpg?fit=1200%2C669&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/tucson.jpg?fit=1200%2C669&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 16557, "url": "https://estreetshuffle.com/index.php/2020/03/28/roll-of-the-dice-western-stars/", "url_meta": {"origin": 30616, "position": 2}, "title": "Roll of the Dice: Western Stars", "author": "Ken", "date": "March 28, 2020", "format": false, "excerpt": "\"Western Stars\" is Bruce's magnum opus--a gorgeously cinematic, metatextual commentary on his life's work and journey.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/western-1.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/western-1.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/western-1.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/western-1.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/03/western-1.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 34887, "url": "https://estreetshuffle.com/index.php/1987/01/08/roll-of-the-dice-two-faces/", "url_meta": {"origin": 30616, "position": 3}, "title": "Two Faces", "author": "Ken", "date": "January 8, 1987", "format": false, "excerpt": "A 1960s doo-wop break-up song inspired one of Bruce's most openly confessional songs about his depressive struggles.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/twofaces.jpg?fit=1200%2C954&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/twofaces.jpg?fit=1200%2C954&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/twofaces.jpg?fit=1200%2C954&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/twofaces.jpg?fit=1200%2C954&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/twofaces.jpg?fit=1200%2C954&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 408, "url": "https://estreetshuffle.com/index.php/2018/01/25/editors-note-30-days-out/", "url_meta": {"origin": 30616, "position": 4}, "title": "Editor&#8217;s Note: 30 Days Out", "author": "Ken", "date": "January 25, 2018", "format": false, "excerpt": "In which I take a deep breath, answer questions, and say \"thanks!\"", "rel": "", "context": "Similar post", "block_context": {"text": "Similar post", "link": ""}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/calendar.jpg?fit=612%2C612&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/calendar.jpg?fit=612%2C612&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/calendar.jpg?fit=612%2C612&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 23950, "url": "https://estreetshuffle.com/index.php/2021/01/17/roll-of-the-dice-drive-fast-the-stuntman/", "url_meta": {"origin": 30616, "position": 5}, "title": "Roll of the Dice: Drive Fast (The Stuntman)", "author": "Ken", "date": "January 17, 2021", "format": false, "excerpt": "My favorite song on Western Stars is arguably the most romantic and (literally) cinematic song in Bruce's entire catalog.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/30616", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=30616"}], "version-history": [{"count": 12, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/30616/revisions"}], "predecessor-version": [{"id": 40578, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/30616/revisions/40578"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/30670"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=30616"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=30616"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=30616"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}