{"id": 32949, "date": "2022-07-03T05:00:00", "date_gmt": "2022-07-03T12:00:00", "guid": {"rendered": "https://estreetshuffle.com/?p=32949"}, "modified": "2024-01-03T15:52:14", "modified_gmt": "2024-01-03T23:52:14", "slug": "roll-of-the-dice-adam-raised-a-cain", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2022/07/03/roll-of-the-dice-adam-raised-a-cain/", "title": {"rendered": "Roll of the Dice: Adam Raised a Cain"}, "content": {"rendered": "<blockquote><p><span style=\"font-size: 14pt;\">&#8220;I guess there&#8217;s just a certain amount of good and bad you get from your parents, and I just got the bad.&#8221;</span></p>\n<p>&nbsp;</p>\n<p><span style=\"font-size: 14pt;\">&#8220;That&#8217;s not true. Cal! Listen to me: you can make of yourself anything you want. It&#8217;s up to you. A man has a choice.&#8221;</span></p>\n<p>&nbsp;</p>\n<p><span style=\"font-size: 14pt;\">&#8212; Cal and Adam, </span><span style=\"font-size: 14pt;\"><em>East of Eden</em></span><span style=\"font-size: 14pt;\"> (1955)</span></p></blockquote>\n<p>In 1955, <em>East of Eden </em>swept its way through a host of prestigious awards and nominations. Directed by the great Elia Kazan, based loosely on one section of John Steinbeck&#8217;s novel of the same name, and featuring James Dean&#8217;s debut screen performance, <em>East of Eden </em>won the Best Motion Picture (Drama) Golden Globe that year along with nominations for multiple Academy Awards (including a Best Supporting Actress win for Jo Van Fleet) and was eventually inducted into the National Film Registry.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"East of Eden (1995) Official Trailer - James Dean Movie HD\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/IqVoIQ5UsT8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div>\n<p><em>East of Eden</em> is an of-sorts retelling of the Cain and Abel story. In the film, two brothers named Cal and Aron stand in for their alliterative biblical counterparts. Each vies for the love of their father Adam (who seems to represent both the biblical Adam and God), but only the younger Aaron seems to have Adam&#8217;s affection and respect.</p>\n<p>No one is directly murdered in <em>East of Eden; </em>its layered plot concentrates more on the emotional chasm between Adam and Cal and the emotional damage caused by the loss of the boys&#8217; mother, whom the brothers believed had died at a young age. Cal discovers that his mother is still alive, however, and working as a madam in a brothel.</p>\n<p>Seeking to hurt his brother after a particularly nasty fight, Cal introduces Aron to their fallen mother without warning or context, and the brutally sudden disillusionment traumatizes Aron so much that he enlists in the Great War and ships off, presumably to die in battle. (In a roundabout way, Cal fulfils the role of Cain by setting in motion the events that lead to his brother&#8217;s death.)</p>\n<p>If all of this seems like extraneous backstory for Bruce Springsteen&#8217;s earliest father/son song, trust me: it&#8217;s not. Because if you try to reconcile &#8220;Adam Raised a Cain&#8221; with the biblical story instead of the 1955 film, you&#8217;ll be left scratching your head.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Adam Raised a Cain\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/PRRd78fqmIg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div>\n<p>There&#8217;s no sibling rivalry in &#8220;Adam Raised a Cain.&#8221; There&#8217;s not even the mention of the existence of a brother. The narrator commits no sin, much less murder. If anything, someone familiar with only the Bible might wonder why Bruce didn&#8217;t name his song &#8220;Adam Raised an Adam.&#8221;</p>\n<p>If you&#8217;ve seen the film, though, it&#8217;s easy to understand why it resonated so strongly with Bruce. There&#8217;s  a whole lot more going on in <em>East of Eden </em>than what I summarized above, but neither the main plot nor the subplots seem to have made a lasting impression on him. What did linger was Cal&#8217;s lack of self-worth, his resentment toward his father, and the emotional gulf that had grown between them.</p>\n<p>Despite lacking fraternal siblings, Bruce (like Cal) felt emotionally estranged from his father, desperately seeking his approval but always feeling like he&#8217;d fallen short. And while Cal&#8217;s growing sense of self-unworth seems to derive more from his discovery about his mother, even at the time of writing Bruce seems to have recognized that he&#8217;d inherited some of his father&#8217;s darker traits.</p>\n<p>All of this informed &#8220;Adam Raised a Cain,&#8221; the first in a years-long series of songwriting as therapy that begins with an attempt to untangle what we inherit from our parents from what we determine for ourselves, and that ends in &#8220;<a href=\"https://estreetshuffle.com/index.php/2022/06/19/roll-of-the-dice-long-time-comin/\">Long Time Comin&#8217;</a>&#8221; with an epiphanic pledge and plea to his children to never tie that knot.</p>\n<p>When Bruce recorded &#8220;Adam Raised a Cain,&#8221; he was a month or two shy of his 28th birthday and still very close to the situation he&#8217;d written about. On its surface, &#8220;Adam Raised a Cain&#8221; reads like recognition and rebellion: Bruce spends the first verse establishing the bond between son and father, employing Biblical imagery to imply a timeless generational cycle that&#8217;s impossible to break.</p>\n<p style=\"padding-left: 40px;\"><em>In the summer that I was baptized, my father held me to his side</em><br />\n<em>As they put me to the water, he said how on that day I cried</em><br />\n<em>We were prisoners of love, a love in chains</em><br />\n<em>He was standing in the door, I was standing in the rain</em><br />\n<em>With the same hot blood burning in our veins</em><br />\n<em>Adam raised a Cain</em></p>\n<p>There&#8217;s a closeness and an intimacy suggested in the first three lines, offset by distance and alienation in the final three. Through it all, our narrator rages&#8211;from his moment of baptism to his exile in the elements while his father looks on from warm safety.</p>\n<p>Bruce is subtly illustrating his narrator&#8217;s desire for his father&#8217;s acceptance if not approval, but it&#8217;s unclear whether his father remains in the doorway in invitation or forbiddance. Is the father rejecting the son, or is the son too proud to accept his father&#8217;s shelter? <em>With the same hot blood burning in our veins, </em>Bruce suggests that both are true.</p>\n<p>In the second verse, we gain more insight into our narrator&#8217;s state of mind.</p>\n<p style=\"padding-left: 40px;\"><em>All of the old faces ask you why you&#8217;re back</em><br />\n<em>They fit you with position and the keys to your daddy&#8217;s Cadillac</em><br />\n<em>In the darkness of your room your mother calls you by your true name</em><br />\n<em>You remember the faces, the places, the names</em><br />\n<em>You know it&#8217;s never over, it&#8217;s relentless as the rain</em><br />\n<em>Adam raised a Cain</em></p>\n<p>Although Bruce wouldn&#8217;t release the song until his next album, our narrator had already had his &#8220;<a href=\"https://estreetshuffle.com/index.php/2022/03/14/roll-of-the-dice-independence-day/\">Independence Day.</a>&#8221; He&#8217;d left home to make his way in the world, only to return home (presumably in failure) and take up the life and the work of his father, a life he&#8217;d desperately tried to avoid. &#8220;Adam Raised a Cain&#8221; works as a direct sequel to &#8220;Independence Day&#8221; and our appreciation of one is heightened by an understanding of the other. (In fact, &#8220;Independence Day&#8221; was actually written and recorded <em>before</em> &#8220;Adam Raised a Cain,&#8221; and had he included both on <em><a href=\"https://estreetshuffle.com/index.php/2022/07/05/album-companion-darkness-on-the-edge-of-town/\">Darkness on the Edge of Town</a>, </em>each would likely have offset the emotional impact of the other.)</p>\n<p>There&#8217;s a line in this verse that tends to slip by unnoticed but is quite significant: <em>In the darkness of your room your mother calls you by your true name.</em> In religion, mysticism, and speculative fiction, the concept of <em>true name</em> refers to the power of a word to capture a thing&#8217;s essence so strongly that it becomes a more powerful symbol of the thing than its given name.</p>\n<p>To know and to speak someone&#8217;s true name gives the speaker power over its owner. As Ursula K. Le Guin once wrote, &#8220;The name is the thing, and the true name is the true thing. To speak the name is to control the thing.&#8221;</p>\n<p>To figure out someone&#8217;s true name, you must completely understand them. With this one line, Bruce reveals that his mother sees him and groks him&#8211;perhaps even beyond his own self-awareness&#8211;and as such exercises a power over him, suggesting that as much as &#8220;Adam Raised a Cain&#8221; is about a father/son relationship, our narrator&#8217;s return may be in large part due to his mother&#8217;s off-screen influence. In fact, in an early outtake of the song from late 1977, Bruce sings an altered version of this verse which shines a little more light on his mother&#8217;s insight:</p>\n<p style=\"padding-left: 40px;\"><em>Well in the darkness of your own room your mother calls you by your true name</em><br />\n<em>She knows you didn&#8217;t come back to join their little game</em><br />\n<em>You remember the faces, you remember the names</em></p>\n<audio class=\"wp-audio-shortcode\" id=\"audio-32949-7\" preload=\"none\" style=\"width: 100%;\" controls=\"controls\"><source type=\"audio/mpeg\" src=\"https://estreetshuffle.com/wp-content/uploads/2022/05/Bruce-Springsteen-02-Adam-Raised-A-Cain.mp3?_=7\" /><a href=\"https://estreetshuffle.com/wp-content/uploads/2022/05/Bruce-Springsteen-02-Adam-Raised-A-Cain.mp3\">https://estreetshuffle.com/wp-content/uploads/2022/05/Bruce-Springsteen-02-Adam-Raised-A-Cain.mp3</a></audio>\n<p>The irony of &#8220;Adam Raised a Cain&#8221; comes in the third verse, in which our narrator resents his father for blaming others for his own metaphorical imprisonment. (He changed another line in the outtake version above: a reference to his father haunting &#8220;these empty rooms rattling these chains,&#8221; which might have been a little too on-the-nose.)</p>\n<p>But of course, blaming others for his own situation is exactly what our narrator is doing in this verse as well.</p>\n<p style=\"padding-left: 40px;\"><em>In the Bible, mamma, Cain slew Abel and east of Eden, mamma, he was cast</em><br />\n<em>You&#8217;re born into this life paying for the sins of somebody else&#8217;s past</em><br />\n<em>Well Daddy worked his whole life for nothing but the pain</em><br />\n<em>Now he walks these empty rooms looking for something to blame</em><br />\n<em>But you inherit the sins, you inherit the flames</em><br />\n<em>Adam raised a Cain</em></p>\n<p style=\"padding-left: 40px;\"><em>Lost but not forgotten from the dark heart of a dream</em><br />\n<em>Adam raised a Cain</em></p>\n<p>From a traditional biblical point of view, this verse is the most problematic to analyze, because it suggests that our narrator is guilty of a mortal sin and exiled accordingly. Our narrator isn&#8217;t comparing himself to Cain in deed, however&#8211;instead, he&#8217;s empathizing with Cain&#8217;s exile and estrangement from his family.</p>\n<p>This is where the link between &#8220;Adam Raised a Cain&#8221; and &#8220;Independence Day&#8221; is most apparent. In both songs, the son recognizes the toll of the father&#8217;s life and the danger it poses to the son if he remains. But while the narrator of the latter song is empathetic and tender, the narrator of &#8220;Adam Raised a Cain&#8221; is trapped and frustrated by his failure to break away.</p>\n<p>Back in his home town and reunited with his family, our narrator is forced to constantly grapple at close range with his father&#8217;s demons to prevent them from becoming his own. It&#8217;s ironic that our narrator feels emotionally outcast, exiled, and lost (but not forgotten), given that physically at least he&#8217;s returned home. But that&#8217;s another of the themes at work in both &#8220;Adam Raised a Cain&#8221; and &#8220;Independence Day&#8221; &#8212; sometimes it takes physical distance to create emotional closeness (and vice versa).</p>\n<p>So far we&#8217;ve devoted our discussion to exploring Bruce&#8217;s themes and lyrics, but &#8220;Adam Raised a Cain&#8221; stands out for its music, too. Featuring one of his most blistering guitar solos on record, an ominous organ-driven stomp of a riff, and call-and-response backing vocals that sound more haunting than haunted, this is a song that sounds unlike any other in his catalog except for album-mate &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/11/06/roll-of-the-dice-streets-of-fire/\">Streets of Fire</a>.&#8221;</p>\n<p>In <em>Bruce</em>, author Peter Ames Carlin revealed how Bruce described the sound he was looking for to mixer Chuck Plotkin:  &#8220;a movie scene showing two young lovers sharing a picnic in a sunlit park. The sun would be shining, the grass would be emerald, the ducks paddled across the pond before them. Then the camera would zoom out to reveal, just behind them, a human corpse lying in the bushes behind them. <em>Aiieee! </em>&#8216;This song,&#8217; Bruce told Plotkin, &#8216;is the dead body.'&#8221;</p>\n<p>Plotkin obliged by digitally (yes, digitally, even in 1977) shifting Roy Bittan&#8217;s piano out of tune. Combined with some (probably) intentionally drunken-sounding background vocals and Steven Van Zandt&#8217;s insistence on heavy guitars, &#8220;Adam Raised a Cain&#8221; sounds sinister, portentous, and doomed.</p>\n<p>One might argue (or at least I would) that Bruce and team overshot the mark a bit; to my ears &#8220;Adam Raised a Cain&#8221; sounds more like an experiment with punk and metal rather than a comfortable fit for the band, an impression that live full-band performances have never corrected.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Adam Raised A Cain (Live at the Roxy Theatre, W. Hollywood, CA - July 1978)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/_46bdgXrLjg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Adam Raised A Cain - 22 May 1988, Madison Square Garden\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/wG2pr5iu_WM?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Adam Raised a Cain (NYC 27-06-2000)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/nkyTHbsOamE?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div>\n<p>Because &#8220;Adam Raised a Cain&#8221; is a song about emotional imprisonment and estrangement, for me it works best when performed acoustically, the artist standing alone without support. Bruce seems to recognize this too, performing it this way many times over the years, frequently infusing it into his acoustic tours and sets.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Adam Raised a Cain - Bruce Springsteen (live at Stockholm Olympic Stadium 1993)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/QP5vfdgmYEw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Adam Raised a Cain (Live at St. Rose of Lima School, Freehold, NJ - 11/08/1996)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/hxEHu-z_xMw?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div>\n<p>It&#8217;s rare that a full-band performance of &#8220;Adam Raised a Cain&#8221; works for me, but there are certainly notable exceptions. One was Bruce&#8217;s Seeger Sessions Tour arrangement, which combines the best of his acoustic arrangement with the underrated power and artistry of the Sessions Band.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen with The SSB - Adam Raised A Cain\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/oh4pznAPHkg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div>\n<p>The other is a jaw-droppingly intense performance before an empty Paramount Theater in Asbury Park, recorded for <em>The Promise: The Darkness on the Edge of Town Story</em> in 2009. Maybe it was the screaming-into-the-void effect of the silent, darkened theater that elicited what is perhaps the E Street Band&#8217;s most ferocious performance of the song, but whatever the inspiration the result is one of the most powerful pieces of performance video ever captured of Bruce and the band.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Adam Raised a Cain (Live at The Paramount Theatre 2009)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/Qi2TGTIXj0s?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe></div>\n<p>&#8220;Adam Raised a Cain&#8221; was regularly featured in Bruce&#8217;s set lists throughout the Darkness Tour but disappeared for a decade after that. Once it returned in a horn-powered arrangement in the Tunnel of Love Express Tour, it would never miss one of Bruce&#8217;s tours again, no matter which (if any) band was behind him.</p>\n<p>When Bruce and the band hit the road again next year, odds are very, very high that &#8220;Adam&#8221; will be with them, too.</p>\n<p><strong>Adam Raised a Cain<br />\nRecorded:</strong> February 15-17, 1978<br />\n<strong>Released:</strong> <em>Darkness on the Edge of Town </em>(1978)<br />\n<strong>First performed:</strong> May 23, 1978 (Buffalo, NY)<br />\n<strong>Last performed:</strong> February 9, 2017 (Sydney, Australia)</p>\n<p>Looking for your favorite Bruce song? Check our full index <a href=\"https://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">here</a>. New entries every week!</p>\n", "protected": false}, "excerpt": {"rendered": "<p>Bruce&#8217;s first officially released father/song features the singer and the band at peak fury and ferocity.</p>\n", "protected": false}, "author": 1, "featured_media": 35110, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [583, 299], "class_list": ["post-32949", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-adam-raised-a-cain", "tag-darkness-on-the-edge-of-town"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/05/easteden.jpg?fit=1500%2C1173&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-8zr", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 7981, "url": "https://estreetshuffle.com/index.php/2019/02/24/cover-me-sandra-stephens-adam-raised-a-cain/", "url_meta": {"origin": 32949, "position": 0}, "title": "Cover Me, Sandra Stephens: Adam Raised a Cain", "author": "Ken", "date": "February 24, 2019", "format": false, "excerpt": "Sandra Stephens and Lanny Cordola's simmering, smoky, wonderful cover of \"Adam Raised a Cain\" dials back the fury and dials up the foreboding. One of my favorite Springsteen covers without question.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/02/tribute.jpg?fit=474%2C474&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 9594, "url": "https://estreetshuffle.com/index.php/2019/05/06/roll-of-the-dice-gave-it-a-name/", "url_meta": {"origin": 32949, "position": 1}, "title": "Roll of the Dice: Gave it a Name", "author": "Ken", "date": "May 6, 2019", "format": false, "excerpt": "Easily a candidate for Bruce's most obscure officially released song, \"Gave It a Name\" is a quiet but powerful commentary on the sins we wrestle with and pass down rather than defeat.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/05/o-GUILT-SHAME-facebook-POST.png?fit=640%2C434&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/05/o-GUILT-SHAME-facebook-POST.png?fit=640%2C434&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/05/o-GUILT-SHAME-facebook-POST.png?fit=640%2C434&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 9625, "url": "https://estreetshuffle.com/index.php/2019/05/19/cover-me-sarah-hepburn-adam-raised-a-cain/", "url_meta": {"origin": 32949, "position": 2}, "title": "Cover Me, Sarah Hepburn: Adam Raised a Cain", "author": "Ken", "date": "May 19, 2019", "format": false, "excerpt": "I’m not sure where it came from, but Sarah Hepburn’s brooding cover of “Adam Raised a Cain” is wonderful regardless.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/05/sarahhep.jpg?fit=500%2C500&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 2775, "url": "https://estreetshuffle.com/index.php/2018/06/26/cover-me-drive-by-truckers-adam-raised-a-cain/", "url_meta": {"origin": 32949, "position": 3}, "title": "Cover Me, Drive-By Truckers: Adam Raised a Cain", "author": "Ken", "date": "June 26, 2018", "format": false, "excerpt": "Alt-country band Drive-by Truckers proves their rock bona fides whenever they cover this classic from Darkness on the Edge of Town.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/06/dbtruckers-e1529240957556.jpg?fit=500%2C333&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 30157, "url": "https://estreetshuffle.com/index.php/2021/10/09/cover-me-alabama-shakes-adam-raised-a-cain/", "url_meta": {"origin": 32949, "position": 4}, "title": "Cover Me, Alabama Shakes: Adam Raised a Cain", "author": "Ken", "date": "October 9, 2021", "format": false, "excerpt": "Ladies and gentlemen, the definitive performance of \"Adam Raised a Cain.\" And it's not by Bruce.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/Alabama.png?fit=1200%2C684&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/Alabama.png?fit=1200%2C684&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/Alabama.png?fit=1200%2C684&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/Alabama.png?fit=1200%2C684&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/10/Alabama.png?fit=1200%2C684&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 3216, "url": "https://estreetshuffle.com/index.php/1987/01/06/roll-of-the-dice-walk-like-a-man/", "url_meta": {"origin": 32949, "position": 5}, "title": "Walk Like a Man", "author": "Ken", "date": "January 6, 1987", "format": false, "excerpt": "\"Walk Like a Man\" is the conclusion to Bruce's \"Daddy Trilogy,\" an underplayed and under-recognized masterpiece of songwriting.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/07/footsteps.jpg?fit=1024%2C1024&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/07/footsteps.jpg?fit=1024%2C1024&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/07/footsteps.jpg?fit=1024%2C1024&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/07/footsteps.jpg?fit=1024%2C1024&ssl=1&resize=700%2C400 2x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/32949", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=32949"}], "version-history": [{"count": 29, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/32949/revisions"}], "predecessor-version": [{"id": 40611, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/32949/revisions/40611"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/35110"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=32949"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=32949"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=32949"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}