{"id": 7412, "date": "2019-02-17T05:00:47", "date_gmt": "2019-02-17T13:00:47", "guid": {"rendered": "http://estreetshuffle.com/?p=7412"}, "modified": "2020-12-08T07:55:10", "modified_gmt": "2020-12-08T15:55:10", "slug": "roll-of-the-dice-girls-in-their-summer-clothes", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2019/02/17/roll-of-the-dice-girls-in-their-summer-clothes/", "title": {"rendered": "Roll of the Dice: Girls in Their Summer Clothes"}, "content": {"rendered": "<blockquote><p><span style=\"font-size: 14pt;\">&#8220;I didn&#8217;t even know I was up for a Grammy! I opened the newspaper on Monday and saw that I had won, and thought, &#8216;Well, that&#8217;s great!'&#8221;  <em>&#8211;Bruce Springsteen, MTV News, February 10, 2009</em></span></p></blockquote>\n<p>Coming from any other artist, under any other circumstances, that line might sound just a bit too coy.</p>\n<p>But Bruce Springsteen had been having quite the month: four weeks earlier, he picked up a Golden Globe Award for his new song, &#8220;<a href=\"https://estreetshuffle.com/index.php/2020/10/31/roll-of-the-dice-the-wrestler/\">The Wrestler</a>.&#8221; Three weeks earlier, he performed at newly elected President Obama&#8217;s inauguration. Two weeks earlier, he released his new album, <em>Working on a Dream </em>and filmed the video for &#8220;The Wrestler.&#8221; And of course one week prior, he performed before the eyes of the world at the half-time show for Super Bowl XLIII.</p>\n<p>So it&#8217;s completely plausible that Bruce didn&#8217;t realize that he&#8217;d been nominated for a Grammy (much less won one) for a song he&#8217;d released a year-and-a-half ago and that just barely cracked the Billboard Hot 100 at #95.</p>\n<p>But win it he did, beating out Radiohead, Coldplay, Deathcab for Cutie, and Kings of Leon to win the &#8220;Best Rock Song&#8221; award for a composition that&#8217;s pure pop confection.</p>\n<p>It was a well-deserved win: &#8220;Girls in Their Summer Clothes&#8221; was not only the best rock song of that year; it&#8217;s one of Bruce&#8217;s best songs <em>ever</em>.</p>\n<p>It certainly has my vote for Bruce&#8217;s best 21st century song, so bear with me&#8211;I&#8217;m gonna wax rhapsodic on this one.</p>\n<p>Let&#8217;s start by listening to it, but put your headphones on first: &#8220;Girls in Their Summer Clothes&#8221; is a wall-of-sound masterpiece that&#8217;s best experienced immersively.</p>\n<p>Also: I&#8217;m going to focus on the &#8220;winter mix&#8221; for this essay, not the album version. The winter mix was released as a single four months after the <em>Magic </em>album debuted; it&#8217;s brighter than the original, dialing up the background percussion and glockenspiel. But more importantly, it presents Bruce&#8217;s vocals as a single track rather than the double-tracked album version. Bruce delivers one of his best modern vocal performances on this song, and the winter mix lets us better hear the purity of Bruce&#8217;s original performance.</p>\n<p>Okay, let&#8217;s go:</p>\n<div id=\"v-NX1uEPta-1\" class=\"video-player\"><iframe title='VideoPress Video Player' aria-label='VideoPress Video Player' width='758' height='426' src='https://videopress.com/embed/NX1uEPta?hd=1&amp;cover=1&amp;loop=0&amp;autoPlay=0&amp;permalink=1&amp;muted=0&amp;controls=1&amp;playsinline=0&amp;useAverageColor=0&amp;preloadContent=metadata' frameborder='0' allowfullscreen data-resize-to-parent=\"true\" allow='clipboard-write'></iframe><script data-jetpack-boost=\"ignore\" src='https://s0.wp.com/wp-content/plugins/video/assets/js/next/videopress-iframe.js'></script></div>\n<blockquote><p><span style=\"font-size: 14pt;\">You know that song Bruce wrote, &#8220;Girls in Their Summer Clothes?&#8221; I heard that song and said, &#8220;This song should be on the radio, why is that not all over the radio?&#8221; I spoke to somebody recently, a Bruce fan, and I said, &#8220;Do you know this song? It is the most insightful song about aging. It is a song of experience, actually.&#8221; And they said, &#8220;No, I don&#8217;t know that.&#8221; So these songs, they can slip through the cracks of culture. <em>&#8212; Bono, Rolling Stone Magazine, January 2018</em></span></p></blockquote>\n<p>&#8220;Girls in Their Summer Clothes&#8221; was recorded during the <em>Magic </em>sessions, but both in sound and theme, it was really the first track recorded for <em>Working on a Dream, </em>an album that&#8217;s lyrically all about growing old while musically celebrating the romance of youth. Had Bruce held the song back from <em>Magic</em> and featured it as the lead single from his next album instead, I have no doubt that both the single and the album would have received the attention and esteem they deserve.</p>\n<p>It&#8217;s impossible to discuss (much less appreciate) the beauty of &#8220;Girls in Their Summer Clothes&#8221; without noting the significance of age and time&#8211;both of the character and the singer.</p>\n<p>Let&#8217;s try an experiment. Put your headphones back on, take a few minutes, and listen to &#8220;Born to Run,&#8221; recorded and released more than three decades before &#8220;Girls in Their Summer Clothes.&#8221; Listen to it as if for the first time&#8211;pay full attention to the wall of sound and the vitality of the vocals, particularly in the glockenspiel-punctuated bridge.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Born to Run\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/z_XiRS8eF8w?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Now go back and do the same thing with &#8220;Girls in Their Summer Clothes,&#8221; and realize: <em>that&#8217;s the same singer. </em></p>\n<p>The similarity of sound between the songs only underscores the toll that age and life experience takes on all of us. &#8220;Born to Run&#8221; bristles and bursts with youthful energy and defiance; &#8220;Girls in Their Summer Clothes&#8221; is a world-weary song of acceptance&#8211;but with a flickering spark of vitality that occasionally peeks through and suggests to us: <em>that&#8217;s the same character</em>.</p>\n<p>Although I&#8217;ve never seen him comment on it, I have no doubt that Bruce very much had his breakthrough album on his mind when he wrote this song. It&#8217;s not just the music and production that&#8217;s a callback to 1975&#8211;the lyrics are laden with the echoes of Bruce&#8217;s songwriting youth:</p>\n<p style=\"padding-left: 30px;\"><em>Well, the streetlights shine down on Blessing Avenue</em><br />\n<em>Lovers they walk by, holding hands two by two</em><br />\n<em>A breeze crosses the porch, bicycle spokes spin &#8217;round</em><br />\n<em>Jacket&#8217;s on, I&#8217;m out the door, tonight I&#8217;m gonna burn this town down</em></p>\n<p>Our story begins at the very same place as the opening track of <em>Born to Run: </em>on the front porch. Notice the breeze that Bruce deliberately notes is crossing the porch&#8211;he leaves it to us to imagine a dress waving or swaying.</p>\n<p>Bruce employs the same cinematic technique here that he used in &#8220;Thunder Road,&#8221; and there&#8217;s no doubt in my mind that it&#8217;s intentional. Entranced by the magic that is the Summer Evening, lured by visions of romance, our hero puts on his jacket and is out the door. Does the screen door slam behind him?</p>\n<p style=\"padding-left: 30px;\"><em>And the girls in their summer clothes<br />\nin the cool of the evening light</em><br />\n<em>The girls in their summer clothes<br />\npass me by</em></p>\n<p>And here in the chorus, we have one of the many wry devices Bruce employs in this song: three lines of soaring melody that lift us up before the fourth line dashes our hopes as it descends back to earth.</p>\n<p>This is the heart of the song: the singer&#8217;s realization that he&#8217;s no longer an actor but rather a spectator in his own story. Young at heart but old in body, he&#8217;s unnoticed&#8211;or worse, dismissed&#8211;by the girls who catch his eye. We realize, at this point, that this is the reason for his keen eye for detail&#8211;observing is all that&#8217;s left to him:</p>\n<p style=\"padding-left: 30px;\"><em>A kid&#8217;s rubber ball smacks off the gutter &#8216;neath the lamp light</em><br />\n<em>Big bank clock chimes off go the sleepy front porch lights</em><br />\n<em>Downtown the stores alight as the evening&#8217;s underway</em></p>\n<p>And yet&#8230; he can&#8217;t quite shake that optimism:</p>\n<p style=\"padding-left: 30px;\"><em>Things been a little tight but I know they&#8217;re gonna turn my way</em></p>\n<p>Or is it bravado? Is he trying to convince us or himself? Because he still can&#8217;t help but notice:</p>\n<p style=\"padding-left: 30px;\"><em>&#8230;the girls in their summer clothes in the cool of the evening light</em><br />\n<em>The girls in their summer clothes pass me by&#8230;</em></p>\n<p>And now, that bridge&#8230; oh, that bridge. Go ahead, listen to it again, just to hear the full E Street Band in all their glory. There may be no better 21st-century studio recording that captures the E Street sound better than this.</p>\n<p style=\"padding-left: 30px;\"><em>Frankie&#8217;s Diner&#8217;s an old friend on the edge of town</em><br />\n<em>The neon sign spinning round like a cross over the lost and found</em><br />\n<em>The fluorescent lights flick above Pop&#8217;s Grill</em><br />\n<em>Shaniqua brings a coffee and asks, &#8220;fill?&#8221;</em><br />\n<em>And says, &#8220;penny for your thoughts now my boy, Bill&#8221;</em></p>\n<p>Okay, let&#8217;s talk about Shaniqua for a moment. If you&#8217;re like me, the first time you heard &#8220;Girls in Their Summer Clothes,&#8221; you just about fell out of your chair at that line. <em>Shaniqua?</em> What happened to Mary? Was Janey busy that day?</p>\n<p>Shaniqua is such an un-Springsteenian name to encounter in a song that it honestly kicked me out of the song like an ejector seat the first time I heard it.</p>\n<p>Bruce never does anything without a reason, though, so why this particular choice? My answer: because it&#8217;s the furthest removed from Mary that he could come up with. This isn&#8217;t the world of Bruce&#8217;s youth anymore, and this is Bruce&#8217;s way of telling us, jolting us with a shock of foreign-ness.</p>\n<p>That&#8217;s not to say that Frankie&#8217;s Diner and Blessing Avenue aren&#8217;t more diverse places now (they may well be); or that today&#8217;s popular names are different than yesterday&#8217;s (they are). The main thing that Bruce is driving home here is that even if the stage of our younger days endures (there&#8217;s a reason Bruce takes a beat to introduce it as an old friend), there&#8217;s a new troupe of actors commanding the audience&#8217;s attention.</p>\n<p>Whether we overtly realize it or not, the warm, nostalgic &#8220;Born to Run&#8221; sound of &#8220;Girls in Their Summer Clothes&#8221; and the lyrical callbacks to &#8220;Thunder Road&#8221; condition us to expect to see Mary at the diner. Wendy, maybe. But definitely not Shaniqua. And the fact that she addresses the singer as Bill, a name we&#8217;d expect to encounter in a classic Springsteen song, drives home the dawning alienation of the singer from the world in which he now finds himself.</p>\n<p>That bridge is <em>devastatingly</em> effective in its subtlety, even moreso than the overt chorus, but we barely have a chance to realize it (especially in the overly literal video) before Max barrel-rolls us into the final verse:</p>\n<p style=\"padding-left: 30px;\"><em>She went away, she cut me like a knife</em><br />\n<em>Hello beautiful thing, maybe you could save my life</em><br />\n<em>In just a glance down here on Magic Street</em><br />\n<em>Love&#8217;s a fool&#8217;s dance, I ain&#8217;t got much sense but I still got my feet</em></p>\n<p>There&#8217;s so much to love in these four lines. Just from a storytelling perspective, look how much information and context we suddenly receive:</p>\n<ul>\n<li>Line 1: The singer is alone, but he wasn&#8217;t always. He had the girl, but she left him and it devastated him.</li>\n<li>Lines 2-3: He&#8217;s not just out on the street trying to recapture his youth, he&#8217;s looking for connection, for the admiration and affection of a young woman who with just a moment of eye contact can validate him and affirm his existence (&#8220;save my life&#8221;) in this new world where he doesn&#8217;t belong. It&#8217;s a pickup line, sure, but it&#8217;s more than that: it&#8217;s a genuine plea of desperation masked in bravado.</li>\n<li>Line 4: This is one of Bruce&#8217;s very best lines. Anyone could come up with the love-as-a-dance metaphor. Carrying it through an admission that confesses both self-awareness and quixotic  confidence&#8211;that&#8217;s the work of a masterful songwriter.</li>\n</ul>\n<p>Oh, and just in case you&#8217;re skeptical about my argument that Bruce is deliberately and lyrically contrasting &#8220;Girls in Their Summer Clothes&#8221; with &#8220;Thunder Road&#8221; throughout the song, take note of those last two lines before the last chorus:</p>\n<p style=\"padding-left: 30px;\"><em>In just a glance down here on Magic <strong>Street</strong></em><br />\n<em>Love&#8217;s a fool&#8217;s dance, I ain&#8217;t got much sense but I still got my <strong>feet</strong></em></p>\n<p>&#8230;and compare it with the last two lines of &#8220;Thunder Road&#8221; before its final coda:</p>\n<p style=\"padding-left: 30px;\"><em>They scream your name at night in the <strong>street</strong></em><br />\n<em>Your graduation gown lies in rags at their <strong>feet</strong></em></p>\n<p>Well played, Bruce. Well played.</p>\n<p>Bruce gives us one final chorus, but the song actually fades out on a wordless verse. Another deliberate touch, this is: the singer&#8217;s story continues as it fades away into the background, much like the singer himself.</p>\n<p>The video drives this home even harder, with the girls now waving goodbye as the song fades out. My favorite moment is the final little girl who sticks her tongue out at Bruce in an innocent tease. It&#8217;s cute, but it&#8217;s also savage:</p>\n<p><em>This world belongs to me,</em> she&#8217;s saying, <em>and my story is just starting while yours ends.</em></p>\n<hr />\n<p>Bruce played &#8220;Girls in Their Summer Clothes&#8221; regularly throughout the Magic Tour, almost always as the opening encore. I always felt that was an odd placement, but then again it would have been sorely out of place in the heavily political setlists of that tour.</p>\n<p>Which is why it&#8217;s all the more surprising that Bruce only played it four times during the <em>Working on a Dream</em> Tour, where it would have been right at home. But that tour was one of Bruce&#8217;s least cohesive, a rare example (so rare, I&#8217;m not sure there&#8217;s any other) of Bruce being out of step with the times.</p>\n<p>He had the misfortune of releasing a lush, nostalgic pop album at the outset of a sudden, dire economic crash, and Bruce found himself torn from the outset of the tour, unable to reconcile his serious populist material with the album&#8217;s more reflective meditation on aging. He chose to optimize for the former, squeezing out room and opportunity for gems like &#8220;Girls in Their Summer Clothes.&#8221;</p>\n<p>Perhaps that&#8217;s for the better anyway, as none of his full-band performances have ever come close to equaling the perfection of the studio recording.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen 3-16-08 Girls in Their Summer Clothes\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/-7698h1Qto8?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>In the decade since the Working on a Dream Tour, Bruce has managed to find a few rare opportunities to play the song that earned him his last Grammy for songwriting, and the most recent time was my favorite.</p>\n<p>By request (my thanks to the fan who made the sign), Bruce played an impromptu version of &#8220;Girls in Their Summer Clothes&#8221; on his acoustic guitar, and for the first time on stage, the sadness and self-awareness at the heart of the song shone through.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"&quot;Girls in Their Summer Clothes&quot; - Bruce Springsteen, Perth Arena (7 Feb 2014)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/U-OzuuZ-Fg0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>If we&#8217;re fortunate enough to get at least one more solo acoustic tour, this is one song that I hope becomes a setlist staple. It&#8217;s too beautiful to ignore, and it&#8217;s one song that Bruce can only grow into, never out of.</p>\n<p><strong>Girls in Their Summer Clothes<br />\nRecorded: </strong>March-May 2007<br />\n<strong>Released: </strong><em>Magic </em>(2007), <em>Girls in Their Summer Clothes </em>(2008, winter mix)<br />\n<strong>First performed: </strong>September 24, 2007 (Asbury Park, NJ)<br />\n<strong>Last performed: </strong>February 7, 2014 (Perth, Australia)</p>\n<p>Looking for your favorite Bruce song? Check our <a href=\"http://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">full index</a>. New entries every week!</p>\n", "protected": false}, "excerpt": {"rendered": "<p>It won Bruce a Grammy he didn&#8217;t even know he was nominated for. It&#8217;s full of hidden callbacks to &#8220;Thunder Road&#8221; and echoes of &#8220;Born to Run.&#8221; It&#8217;s my favorite 21st-century Springsteen song, and it mystifies Bono with its relative obscurity. Listen to &#8220;Girls in Their Summer Clothes&#8221; like you&#8217;ve never heard it before inside.</p>\n", "protected": false}, "author": 1, "featured_media": 7767, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [1477, 380], "class_list": ["post-7412", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-girls-in-their-summer-clothes", "tag-magic"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/02/girlsintheirsummerclothes_single.jpg?fit=800%2C800&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-1Vy", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 27895, "url": "https://estreetshuffle.com/index.php/2021/06/13/roll-of-the-dice-ive-got-to-have-you-baby/", "url_meta": {"origin": 7412, "position": 0}, "title": "Roll of the Dice: I Got to Have You, Baby", "author": "Ken", "date": "June 13, 2021", "format": false, "excerpt": "Let's listen on the Bruce Springsteen Band's 1972 rehearsal sessions and their loose, fun performance of a lost Springsteen original.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/gottahve.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/gottahve.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/gottahve.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/gottahve.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/06/gottahve.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 22143, "url": "https://estreetshuffle.com/index.php/2020/10/31/roll-of-the-dice-the-wrestler/", "url_meta": {"origin": 7412, "position": 1}, "title": "Roll of the Dice: The Wrestler", "author": "Ken", "date": "October 31, 2020", "format": false, "excerpt": "A gift to an old friend became the award-winning title song for one of the best films of 2008 and one of the most deeply empathic songs in Bruce's catalog.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/wrestlerspringsteinsong.jpg?fit=658%2C658&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/wrestlerspringsteinsong.jpg?fit=658%2C658&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/10/wrestlerspringsteinsong.jpg?fit=658%2C658&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 596, "url": "https://estreetshuffle.com/index.php/2018/02/09/roll-of-the-dice-forward/", "url_meta": {"origin": 7412, "position": 2}, "title": "Roll of the Dice: Forward!", "author": "Ken", "date": "February 9, 2018", "format": false, "excerpt": "Be careful what you wish for when you ask Bruce Springsteen to write your campaign song.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/forward.jpg?fit=1200%2C945&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/forward.jpg?fit=1200%2C945&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/forward.jpg?fit=1200%2C945&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/forward.jpg?fit=1200%2C945&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/02/forward.jpg?fit=1200%2C945&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 26260, "url": "https://estreetshuffle.com/index.php/2021/04/20/roll-of-the-dice-all-i-want-to-do-is-dance/", "url_meta": {"origin": 7412, "position": 3}, "title": "Roll of the Dice: All I Want to Do Is Dance", "author": "Ken", "date": "April 20, 2021", "format": false, "excerpt": "From way back in The Bruce Springsteen Band era, \"All I Want to Do Is Dance\" is Bruce at his poppiest.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/wannadance.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/wannadance.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/wannadance.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/wannadance.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/04/wannadance.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 22587, "url": "https://estreetshuffle.com/index.php/2020/11/07/roll-of-the-dice-you-dont-leave-me-no-choice/", "url_meta": {"origin": 7412, "position": 4}, "title": "Roll of the Dice: You Don&#8217;t Leave Me No Choice", "author": "Ken", "date": "November 7, 2020", "format": false, "excerpt": "Bruce Springsteen Band backing vocalist Barbara Dinkins takes the lead on her original wronged-woman scorcher, but Bruce turns in a scorching performance of his own.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/11/nochoice.jpeg?fit=1200%2C800&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/11/nochoice.jpeg?fit=1200%2C800&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/11/nochoice.jpeg?fit=1200%2C800&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/11/nochoice.jpeg?fit=1200%2C800&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/11/nochoice.jpeg?fit=1200%2C800&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 7288, "url": "https://estreetshuffle.com/index.php/2019/02/01/roll-of-the-dice-mr-jones/", "url_meta": {"origin": 7412, "position": 5}, "title": "Roll of the Dice: Mr. Jones", "author": "Ken", "date": "February 1, 2019", "format": false, "excerpt": "Take a listen to \"Mr. Jones,\" the earliest known recording of Bruce Springsteen performing an original composition live on stage.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/02/mrjones.jpg?fit=960%2C862&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/02/mrjones.jpg?fit=960%2C862&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/02/mrjones.jpg?fit=960%2C862&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/02/mrjones.jpg?fit=960%2C862&ssl=1&resize=700%2C400 2x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/7412", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=7412"}], "version-history": [{"count": 16, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/7412/revisions"}], "predecessor-version": [{"id": 23649, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/7412/revisions/23649"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/7767"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=7412"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=7412"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=7412"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}