{"uuid": "b7de1224-753d-49ae-99c4-0c71b6c5600e", "id": 21118, "date": "2020-09-30T05:00:00", "date_gmt": "2020-09-30T12:00:00", "guid": {"rendered": "http://estreetshuffle.com/?p=21118"}, "modified": "2023-01-01T17:54:26", "modified_gmt": "2023-01-02T01:54:26", "slug": "roll-of-the-dice-moonlight-motel", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2020/09/30/roll-of-the-dice-moonlight-motel/", "title": {"rendered": "Roll of the Dice: Moonlight Motel"}, "content": {"rendered": "<p>Please excuse me for a moment while I get something out of my system:</p>\n<p style=\"padding-left: 40px;\"><em>There are only two shots poured in &#8220;Moonlight Motel.&#8221; <strong>Two!</strong></em></p>\n<p style=\"padding-left: 40px;\"><em>I don&#8217;t give a darn whether Mary&#8217;s dress waves or sways (it&#8217;s an extraneous detail that matters not one whit to &#8220;Thunder Road&#8221;), but it drives me absolutely nuts every time I read a review of &#8220;Moonlight Motel&#8221; that mentions a third shot poured out in the parking lot.</em></p>\n<p style=\"padding-left: 40px;\"><em>If you see three shots in your mind when you listen to &#8220;Moonlight Motel,&#8221; you are missing the magic of its deep symbolism.</em></p>\n<p>Okay, we can proceed now.</p>\n<p>Today marks one thousand days for me&#8211;one thousand <em>consecutive</em> days&#8211;of daily Springsteen blogging. I don&#8217;t think I&#8217;ve <em>ever</em> done anything for a thousand days in a row before that isn&#8217;t an involuntary or life-sustaining biological function, but for a thousand days in a row I&#8217;ve been writing my way through every song Bruce Springsteen has ever released, recorded, covered, and even discarded, never knowing what I&#8217;ll be writing about next until my randomizer reveals it to me.</p>\n<p>So for my 1,000th daily-versary present, I&#8217;m allowing myself a dealer&#8217;s choice (my first since <a href=\"http://estreetshuffle.com/index.php/2018/01/05/roll-of-the-dice-land-of-hope-and-dreams/\">Day 1</a>) and writing about a song I&#8217;ve been champing at the bit to discuss since I first heard it on <a href=\"http://estreetshuffle.com/index.php/2020/06/14/kingdom-of-days-june-14/\">Day 526</a>.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Moonlight Motel (Official Audio)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/paFUBjeTcZY?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>I try not to make too many absolute value statements, but I&#8217;m going to make one now:</p>\n<p>Lyrically speaking, &#8220;Moonlight Motel&#8221; is Bruce Springsteen&#8217;s best song.</p>\n<p>It&#8217;s not my favorite song in his catalog. Heck, it&#8217;s not even my favorite song on <em>Western Stars. </em>It&#8217;s not the song I want to hear most, next, or even at all in concert. There are songs scattered across Bruce&#8217;s catalog (although not many) that surpass &#8220;Moonlight Motel&#8221; in gestalt, but if we simply focus on the poetry of &#8220;Moonlight Motel,&#8221; it stands head and shoulders above every other song in Bruce&#8217;s catalog.</p>\n<p>&#8220;Moonlight Motel&#8221; is <em>dripping</em> in symbolism. Every line, every phrase, every detail is significant on at least two levels, and sometimes more. Both in sound and content, it is unique. For an artist notorious for cross-pollinating his lyrics and music, &#8220;Moonlight Motel&#8221; sounds like no other song in Bruce&#8217;s catalog. It stands alone, expertly crafted and perfectly sequenced at the end of an album that&#8217;s all about the late stages of life&#8217;s journey.</p>\n<p><em>Western Stars</em> begins with characters who are propelled ever-forward (&#8220;<a href=\"https://estreetshuffle.com/index.php/2021/05/22/roll-of-the-dice-hitch-hikin/\">Hitch Hikin&#8217;,</a>&#8221; &#8220;<a href=\"https://estreetshuffle.com/index.php/2022/01/29/roll-of-the-dice-the-wayfarer/\">The Wayfarer</a>,&#8221; and <a href=\"http://estreetshuffle.com/index.php/2020/05/25/roll-of-the-dice-tucson-train/\">Tucscon Train</a>&#8220;), arcs toward characters rooted in place (whether at peace in &#8220;<a href=\"http://estreetshuffle.com/index.php/2020/03/28/roll-of-the-dice-western-stars/\">Western Stars</a>&#8221; or restless in &#8220;<a href=\"http://estreetshuffle.com/index.php/2020/01/26/roll-of-the-dice-chasin-wild-horses/\">Chasin&#8217; Wild Horses</a>&#8220;), and then bends toward characters for whom loss and regret keeps them focused backward (&#8220;Sundown&#8221; through &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/04/10/roll-of-the-dice-there-goes-my-miracle/\">There Goes My Miracle</a>&#8220;). The album ends with two characters <em>almost</em> ready to move forward, but first they need to allow themselves to accept new light and love and let go of old ones.</p>\n<p>Today we&#8217;re going to take a long, loving, line-by-line look at &#8220;Moonlight Motel,&#8221; the period at the end of <em>Western Stars&#8217; </em>sentence.</p>\n<p>The first thing we need to establish is the song&#8217;s central metaphor. Bruce employs classic literary symbolism throughout &#8220;Moonlight Motel,&#8221; beginning with the very first line:</p>\n<p style=\"padding-left: 40px;\"><em>There&#8217;s a place on a blank stretch of road</em><br />\n<em>Where nobody travels and nobody goes</em></p>\n<p>In literature, the road is the symbol of life&#8217;s journey. Late in life, our narrator is both literally and figuratively on an empty stretch of road.</p>\n<p>(The road motif winds its way through the entire <em>Western Stars </em>album; almost every song features a character learning how to live and love far from their emotional home.)</p>\n<p>The Moonlight Motel is the set location of the narrator&#8217;s one great life-long romance, but it&#8217;s also a metaphor for the narrator&#8217;s heart. By locating the motel on a blank stretch of road where nobody travels or goes, Bruce tells us that our narrator&#8217;s emotional life is vacant. At least in the romantic sense, he is alone.</p>\n<p style=\"padding-left: 40px;\"><em>And the desk man says these days &#8217;round here</em><br />\n<em>Well, two young folks could probably up and disappear</em></p>\n<p>There&#8217;s a lot going on in this couplet. In its most literal sense, it&#8217;s a knowing wink from the attendant of a motel where the only guests are secretive couples rendezvousing far away from any place they&#8217;d be recognized. But as we&#8217;ll shortly learn, the motel is no longer open for business, which means that Bruce introduces the desk man both as a memory and as a personification of the narrator&#8217;s inner voice.</p>\n<p>As memory, the desk man takes us back to the narrator&#8217;s youth and young love; as metaphor, however, he gives us our first clue that the motel might one day welcome new guests. Even though our unnamed narrator is late in life, new love makes us all young again. Perhaps our protagonist isn&#8217;t as alone as we might think.</p>\n<p style=\"padding-left: 40px;\"><em>Into rustling sheets, a sleepy corner room into the musty smell</em><br />\n<em>Of wilted flowers and lazy afternoon hours at the Moonlight Motel</em></p>\n<p>Bruce wastes not a single word in &#8220;Moonlight Motel.&#8221; The motel is sleepy and musty from disuse, telling us that the narrator has been without his love for some time now. Likewise, wilted flowers are a classic literary symbol of grief and sadness, telling us that he still hasn&#8217;t gotten over his loss.</p>\n<p>However, the sheets rustle, evoking the image of entwined lovers but also restless sleepers. In other words, there are signs of life. And the fact that it&#8217;s only late afternoon tells us that there&#8217;s still life left in the day before the long onset of evening.</p>\n<p>Still, the motel is in a state of disrepair and abandonment that is both literal and figurative:</p>\n<p style=\"padding-left: 40px;\"><em>Now the pool&#8217;s filled with empty, eight-foot deep</em><br />\n<em>Got dandelions growin&#8217; up through the cracks in the concrete</em></p>\n<p>I think this may be my favorite couplet in the entire song. The pool, of course, represents the narrator&#8217;s heart. As an image it evokes a well or a reservoir&#8211;in this case an empty, deep void. But a motel&#8217;s pool is also its social center, the place where connections are made between guests otherwise isolated in their own rooms.</p>\n<p>What makes the image perfect, though, is the classic symbol of emotional healing: the dandelion.</p>\n<p><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" data-attachment-id=\"21707\" data-permalink=\"https://estreetshuffle.com/index.php/2020/09/30/roll-of-the-dice-moonlight-motel/dandelion/#main\" data-orig-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/dandelion.jpeg?fit=1200%2C627&amp;ssl=1\" data-orig-size=\"1200,627\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"dandelion\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/dandelion.jpeg?fit=300%2C157&amp;ssl=1\" data-large-file=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/dandelion.jpeg?fit=758%2C396&amp;ssl=1\" class=\"alignnone wp-image-21707\" src=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/dandelion-300x157.jpeg?resize=758%2C397\" alt=\"\" width=\"758\" height=\"397\" srcset=\"https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/dandelion.jpeg?resize=300%2C157&amp;ssl=1 300w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/dandelion.jpeg?resize=1024%2C535&amp;ssl=1 1024w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/dandelion.jpeg?resize=768%2C401&amp;ssl=1 768w, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/dandelion.jpeg?w=1200&amp;ssl=1 1200w\" sizes=\"auto, (max-width: 758px) 100vw, 758px\" /></p>\n<p>The dandelions poking their way through the concrete are both a literal example of the resort&#8217;s disrepair as well as a metaphorical sign that the resilience of life and love are chipping away at the hard concrete exterior our narrator has constructed around his heart. Sheer brilliance.</p>\n<p style=\"padding-left: 40px;\"><em>Chain-link fence half-rusted away</em><br />\n<em>Got a sign says &#8220;Children, be careful how you play&#8221;</em></p>\n<p>Long-time readers know that I often point out: when it comes to songwriting, Bruce doesn&#8217;t do anything by accident. He could have chosen from countless ways to illustrate the decrepitude of the hotel, but he chose a fence&#8211;a barrier.</p>\n<p>The half-rusted away fence is an ingeniously ironic metaphor, because while it literally underscores the neglect of the hotel, it also serves as a sign of healing: like the cracks in the concrete pool, the fence that has protected the narrator&#8217;s heart since the loss of his love is starting to erode as well.</p>\n<p>The warning: <em>children, be careful how you play</em>. It&#8217;s a reminder that young love feels playful at first. But it&#8217;s also a caution: love does indeed have consequences, even though they may lie down the road a ways. Our narrator is opening himself up to the possibility of new love while cautioning himself to take it slow&#8230; and to remember that sooner or later, love almost always leads to loss.</p>\n<p style=\"padding-left: 40px;\"><em>Your lipstick taste and your whispered secret I promised I&#8217;d never tell</em><br />\n<em>A half-drunk beer and your breath in my ear at the Moonlight Motel</em></p>\n<p>Another brilliant couplet: the combination of intensely intimate details (her taste, her breath), the sense of romantic intoxication (the beer), and the whispered secret he promised he wouldn&#8217;t tell&#8211;and <em>still</em> doesn&#8217;t even to us, demonstrating his fidelity to her even now.</p>\n<p style=\"padding-left: 40px;\"><em>Well then it&#8217;s bills and kids and kids and bills and the ringing of the bell</em><br />\n<em>Across the valley floor through the dusty screen door of the Moonlight Motel</em></p>\n<p>The bridge in &#8220;Moonlight Motel&#8221; is literally just that:  a bridge that spans the years, taking us rapidly from the past to the present through all of the ordinary routine that wears away at the sheen of romance and adventure.</p>\n<p>Bruce didn&#8217;t have to recycle the cycle of child-rearing and bill-paying, but doing so drives home both of the main, unrelenting responsibilities that erode the romance between married couples (and the inclusion of kids does indeed imply that the lost love is the narrator&#8217;s wife). Reversing the order, though, is a bit of clever wordplay that both subverts our internal rhyme expectations while setting up a nice alliterative pairing of &#8220;bills&#8221; and &#8220;bell.&#8221; It&#8217;s a small touch, but one I admire a lot.</p>\n<p>Oh, and that bell: it represents the intrusion of others on the intimacy of a home and relationship. It&#8217;s not enough to have to focus one&#8217;s energy on making a living and raising a family, there&#8217;s all the other social interactions and responsibilities we accumulate during our daily lives.</p>\n<p>Bruce has the ringing of the bell echo across the valley floor, a bit of poetic license, but one that conveys a sense of distance not just literal (between the couple&#8217;s home and their motel love nest)  but figurative as well&#8211;a romance so far gone that it seems almost impossible to travel back to.</p>\n<p>And because we&#8217;ve established that no detail is extraneous, we must pause at the screen door.</p>\n<p><em>The screen door.</em></p>\n<p>The words that open one of Bruce&#8217;s greatest songs of vibrant and vital youth.</p>\n<p>I&#8217;ve never seen anyone put the question to Bruce, but there&#8217;s no doubt in my mind that this is an intentional callback to &#8220;Thunder Road.&#8221; Perhaps not literal, although it isn&#8217;t hard to imagine that our narrator and Mary pulled out of town to win, stopped at the Moonlight Motel (hey, they had to spend the night <em>somewhere</em>), and that after a long journey together, he now finds himself alone staring back at the path they traveled together.</p>\n<p>But it&#8217;s at least an intentional thematic bookend, meant to show how time and tide teach us the fallacy of love without consequence. (As Bruce put it nightly on the 2016 River Tour when introducing &#8220;<a href=\"https://estreetshuffle.com/index.php/2022/04/22/roll-of-the-dice-i-wanna-marry-you/\">I Wanna Marry You</a>,&#8221; it&#8217;s &#8220;the kind that doesn&#8217;t exist.&#8221;)</p>\n<p>The screen door.</p>\n<p>It&#8217;s dusty now, meaning it&#8217;s been a long time since Mary (or anyone) opened it.</p>\n<p style=\"padding-left: 40px;\"><em>Last night I dreamed of you my lover</em><br />\n<em>And the wind blew through the window and blew off the covers</em></p>\n<p>We&#8217;re in the present now, literally today, with our narrator waking from a dream from last night. The wind is yet another classic element of symbolism. In religion, it represents the spirit; in literature, it represents impending change. In &#8220;Moonlight Motel,&#8221; it represents both.</p>\n<p>The wind is the spirit of our narrator&#8217;s lost love, visiting her beloved and blowing off the cocoon he&#8217;s created around himself to protect him from another loss that might someday stem from a new love.</p>\n<p style=\"padding-left: 40px;\"><em>Of my lonely bed, I woke to something you said</em><br />\n<em>That it&#8217;s better to have loved, yeah, it&#8217;s better to have loved</em></p>\n<p>In the annals of the greatest lines Bruce ever wrote, we&#8217;d be hard-pressed to find any that pack more of an emotional punch than these. There&#8217;s so much being communicated in his wife&#8217;s spiritual visitation: her reminder that they are fortunate to have had whatever time together life blessed them with is also her benediction and encouragement for him to love again.</p>\n<p>And the fact that he can&#8217;t even finish Tennyson&#8217;s great line (&#8220;&#8217;tis better to have loved and lost than never to have loved at all&#8221;) both reinforces the important part of his beloved&#8217;s message while making it clear just how painful her loss remains to him to this day.</p>\n<p>I tear up at this line every single time I hear it.</p>\n<p style=\"padding-left: 40px;\"><em>As I drove there was a chill in the breeze and the leaves tumbled from the sky and fell</em><br />\n<em>On the road so black as I backtracked to the Moonlight Motel</em></p>\n<p>This couplet is pretty obvious. The chill in the air and the falling leaves symbolize the passage of time and the lateness of life. With his wife&#8217;s words still echoing in his head, he travels both in distance and time to continue their conversation.</p>\n<p style=\"padding-left: 40px;\"><em>She was boarded up and gone like an old summer song, nothing but an empty shell</em><br />\n<em>I pulled in and stopped into my old spot&#8230;</em></p>\n<p>When he arrives at the motel, it&#8217;s shuttered and abandoned, and the comparison to a summer song is in stark contrast with the approaching autumn. Yet he pulls into a parking spot&#8211;and not just any spot, but his <em>old spot,</em> which tells us that this isn&#8217;t the first time he&#8217;s made this journey over the years.</p>\n<p>We notice, too, that Bruce doesn&#8217;t complete the couplet. He sets up the rhyme with &#8220;shell,&#8221; but he doesn&#8217;t land it. Why? For two reasons: as a storytelling device, it subverts our expectations and holds us in suspense for the final couplet to come. But more importantly, it represents a new tentativeness on the part of the narrator, and a pattern being broken. It&#8217;s one last subtle hint from the songwriter that &#8220;Moonlight Motel&#8221; is a song of hope and healing rather than regret. (Although longtime Springsteen fans already know to expect a hopeful song at the end of his albums.)</p>\n<p>Now about those shots&#8230;</p>\n<p style=\"padding-left: 40px;\"><em>I pulled a bottle of Jack out of a paper bag, poured one for me and one for you as well</em><br />\n<em>Then it was one more shot poured out on the parking lot to the Moonlight Motel</em></p>\n<p>This is a powerful, beautiful ending to a gorgeous song&#8211;both because of what it tells us about the past and suggests about the future.</p>\n<p>We are eavesdropping on a ritual, one that has played out again and again over time. Whenever our narrator wants to commune with his late wife, he retreats to the motel, pours a drink for each of them, and settles in for a talk.</p>\n<p>She&#8217;s not really there, however, at least not physically. So the encounter always ends the same way: he drinks his shot and pours hers out in the parking lot. (He has to be able to drive home, after all.)</p>\n<p>He&#8217;s done this many times before.</p>\n<p>What&#8217;s significant about this time isn&#8217;t the pouring of the shot. It&#8217;s not the brand of whiskey, the paper bag, or any other detail Bruce provides. In this sublime closing couplet, the key detail is what&#8217;s <em>not </em>included: there&#8217;s no conversation.</p>\n<p>This is why Bruce broke the rhyme scheme in the couplet just prior&#8211;the narrator has realized it&#8217;s time to let his wife go and to move forward. He doesn&#8217;t have the conversation he came there to have. He simply toasts her memory and completes the ritual one last time by pouring hers out. One more shot, one <em>last</em> shot poured out on the parking lot.</p>\n<p>The spilled shot is also one last bit of symbolism. Spilling liquid is a symbol of release, of letting something go and of opening oneself up to something new&#8211;which is exactly what our narrator is about to do.</p>\n<p>That&#8217;s why I get worked up at the suggestion that there&#8217;s a third shot, as if the narrator were somehow toasting the motel rather than releasing his lost love and moving forward toward a new one. It&#8217;s a reduction that robs the song of its healing closure.</p>\n<p>&#8220;Moonlight Motel&#8221; reminds us that no matter how far down the road we&#8217;ve burned, as long as there&#8217;s road left, there&#8217;s life and love left&#8211;if we allow ourselves to embrace it. That&#8217;s <em>Western Stars </em> in a nutshell, which makes &#8220;Moonlight Motel&#8221; the perfect capstone to what I expect will remain Bruce&#8217;s crowning artistic achievement.</p>\n<hr />\n<p><strong>Bonus: </strong>Bruce hasn&#8217;t performed &#8220;Moonlight Motel&#8221; in public (yet), but of course he included it in the filmed version of <em>Western Stars</em>. Honestly, the song gains nothing from its live performance, and in fact I&#8217;d argue the additional orchestration detracts slightly from the power of the lyrics.</p>\n<p>Bruce&#8217;s vocals are more gruff in the filmed version as well. Some might like that, but I&#8217;m not among them. I include the soundtrack version here for completeness, but recommend sticking with the original.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - Moonlight Motel (Film Version - Official Audio)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/k3N6IxnkW1k?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>Moonlight Motel<br />\nRecorded:</strong> Unknown<br />\n<strong>Released: </strong><em>Western Stars</em> (2019)<br />\n<strong>First performed:</strong> April 2019<br />\n<strong>Last performed:</strong> April 2019</p>\n<p>Looking for your favorite Bruce song? Check our <a href=\"http://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">full index</a>. New entries every week!</p>\n", "protected": false}, "excerpt": {"rendered": "<p>Dripping in symbolism and gorgeous imagery, &#8220;Moonlight Motel&#8221; is lyrically Bruce Springsteen&#8217;s best song. Full stop.</p>\n", "protected": false}, "author": 1, "featured_media": 21531, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [2528, 2416], "class_list": ["post-21118", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-moonlight-motel", "tag-western-stars"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/09/moonlight.jpg?fit=1024%2C651&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-5uC", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 14140, "url": "https://estreetshuffle.com/index.php/2019/11/07/cover-me-reflekter-moonlight-motel/", "url_meta": {"origin": 21118, "position": 0}, "title": "Cover Me, Reflekter: Moonlight Motel", "author": "Ken", "date": "November 7, 2019", "format": false, "excerpt": "James Gooch's acoustic cover of \"Moonlight Motel\" is the first Western Stars cover I've featured on this blog, and it's bound to be a controversial one. You'll understand why when you listen to it.", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/11/moonlight.jpg?fit=1200%2C675&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/11/moonlight.jpg?fit=1200%2C675&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/11/moonlight.jpg?fit=1200%2C675&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/11/moonlight.jpg?fit=1200%2C675&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/11/moonlight.jpg?fit=1200%2C675&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 16363, "url": "https://estreetshuffle.com/index.php/2020/02/24/cover-me-barney-bentall-and-the-cariboo-express-moonlight-motel/", "url_meta": {"origin": 21118, "position": 1}, "title": "Cover Me, Barney Bentall and the Cariboo Express: Moonlight Motel", "author": "Ken", "date": "February 24, 2020", "format": false, "excerpt": "From November 2019, Barney Bentall and the Cariboo Express gift us with their superb cover of Bruce's instant classic, \"Moonlight Motel.\"", "rel": "", "context": "In &quot;Cover Me&quot;", "block_context": {"text": "Cover Me", "link": "https://estreetshuffle.com/index.php/category/cover-me/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/BBTOURsizedown.jpg?fit=874%2C847&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/BBTOURsizedown.jpg?fit=874%2C847&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/BBTOURsizedown.jpg?fit=874%2C847&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/BBTOURsizedown.jpg?fit=874%2C847&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 19178, "url": "https://estreetshuffle.com/index.php/2020/07/08/roll-of-the-dice-summer-night/", "url_meta": {"origin": 21118, "position": 2}, "title": "Roll of the Dice: Summer Night", "author": "Ken", "date": "July 8, 2020", "format": false, "excerpt": "\"Summer Night\" is one for the completists--a Nebraska-era home demo with a lovely melody but mostly bluffed lyrics.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/07/summernight.jpg?fit=500%2C500&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 55973, "url": "https://estreetshuffle.com/index.php/2025/02/22/kingdom-of-days-february-22-2/", "url_meta": {"origin": 21118, "position": 3}, "title": "February 22", "author": "Ken", "date": "February 22, 2025", "format": false, "excerpt": "Bruce's parents marry, Steel Mill records in the studio, and Bruce and the band play a fun Australian winery show. Plus: Friday Night Videos airs a private reel on Bruce.", "rel": "", "context": "In &quot;Kingdom of Days&quot;", "block_context": {"text": "Kingdom of Days", "link": "https://estreetshuffle.com/index.php/category/kingdom-of-days/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/hunter.jpg?fit=1024%2C1024&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/hunter.jpg?fit=1024%2C1024&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/hunter.jpg?fit=1024%2C1024&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/02/hunter.jpg?fit=1024%2C1024&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 23950, "url": "https://estreetshuffle.com/index.php/2021/01/17/roll-of-the-dice-drive-fast-the-stuntman/", "url_meta": {"origin": 21118, "position": 4}, "title": "Roll of the Dice: Drive Fast (The Stuntman)", "author": "Ken", "date": "January 17, 2021", "format": false, "excerpt": "My favorite song on Western Stars is arguably the most romantic and (literally) cinematic song in Bruce's entire catalog.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/01/stunt.jpg?fit=1200%2C1200&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 25808, "url": "https://estreetshuffle.com/index.php/2021/05/22/roll-of-the-dice-hitch-hikin/", "url_meta": {"origin": 21118, "position": 5}, "title": "Roll of the Dice: Hitch Hikin&#8217;", "author": "Ken", "date": "May 22, 2021", "format": false, "excerpt": "Western Stars is a travelogue, and it opens with a song that's all about the ride.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/05/hitch.png?fit=1200%2C795&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/05/hitch.png?fit=1200%2C795&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/05/hitch.png?fit=1200%2C795&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/05/hitch.png?fit=1200%2C795&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/05/hitch.png?fit=1200%2C795&ssl=1&resize=1050%2C600 3x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/21118", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=21118"}], "version-history": [{"count": 27, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/21118/revisions"}], "predecessor-version": [{"id": 40484, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/21118/revisions/40484"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/21531"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=21118"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=21118"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=21118"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}