{"uuid": "5d56b2b1-231e-4035-803b-25d4c812a065", "id": 24353, "date": "2021-03-04T05:00:00", "date_gmt": "2021-03-04T13:00:00", "guid": {"rendered": "https://estreetshuffle.com/?p=24353"}, "modified": "2024-01-02T16:14:03", "modified_gmt": "2024-01-03T00:14:03", "slug": "roll-of-the-dice-the-river", "status": "publish", "type": "post", "link": "https://estreetshuffle.com/index.php/2021/03/04/roll-of-the-dice-the-river/", "title": {"rendered": "Roll of the Dice: The River"}, "content": {"rendered": "<p><em>(<strong>Updated 3/4/2021</strong>: Friend of the blog Steven Semeraro pointed out that while Mary was 17 when they met, the narrator is likely eighteen by implication. I&#8217;ve updated some timing references accordingly.)</em></p>\n<div class=\"ecm0bbzt e5nlhep0 a8c37x1j\">\n<div class=\"kvgmc6g5 cxmmr5t8 oygrvhab hcukyx3x c1et5uql\">\n<div dir=\"auto\">What&#8217;s worse than a lie?</div>\n</div>\n</div>\n<p>That&#8217;s the question that lingers long after &#8220;The River&#8221; fades to black.</p>\n<p>We&#8217;ll answer that question, but we have some ground to cover first.</p>\n<p>We last pulled at this particular thread in last month&#8217;s exploration of &#8220;<a href=\"https://estreetshuffle.com/index.php/2021/02/16/roll-of-the-dice-oh-angelyne/\">Oh Angelyne</a>.&#8221; (I recommend reading or re-reading that one before going any further, because it contains 80% of the backstory for &#8220;The River.&#8221;)</p>\n<p>When we left Bruce, he had just hit upon the missing ingredient in his nascent masterpiece: the metaphor.</p>\n<p>He already had his characters and storyline, and they were very close to the ones featured in &#8220;The River.&#8221; Trapped in a loveless marriage, haunted by the memory of happier days, and frustrated at his lot in life, our narrator feels old before his time and longs for escape in the form of his mistress, Angelyne.</p>\n<p>But then Bruce hit upon inspiration in the guise of the great Hank Williams. Bruce insists that it was Hank&#8217;s &#8220;My Bucket&#8217;s Got a Hole In It&#8221; that provided the final creative spark for &#8220;The River,&#8221; but it&#8217;s at least as likely that he drew from &#8220;Long Gone Lonesome Blues&#8221; as well. Because the first verse of the latter song sounds strikingly familiar:</p>\n<p style=\"padding-left: 40px;\"><em>I went down to the river to watch the fish swim by</em><br />\n<em>But I got to the river so lonesome I wanted to die</em><br />\n<em>And then I jumped in the river, but the doggone river was dry</em></p>\n<p>It wasn&#8217;t the first time Bruce employed a river metaphor in his songwriting&#8211;heck, it wasn&#8217;t even the first time he did so in a song <em>title</em>. But the river metaphor in &#8220;The River&#8221; proved deeper and more pliable than he&#8217;d been able to achieve before, and Bruce knew he was on to something.</p>\n<p>He ditched his original title temptress along with the notion of escape. After all, he realized, if you&#8217;re haunted by the ghost of lost love, the <em>last</em> thing you want to do is escape it. What you <em>really</em> want to do is reclaim it.</p>\n<p>And now we arrive at &#8220;The River&#8221; in its final form.</p>\n<p>If you were a Springsteen fan at the time, you likely not only heard it in advance of its studio debut, you probably also saw it.</p>\n<p>Because believe it or not, Bruce&#8217;s debut performance of &#8220;The River&#8221;&#8211;filmed more than a year before it debuted on the album of the same name&#8211;marked the very first time a live Bruce Springsteen and the E Street Band song ever appeared on film. It was a highlight of <em>No Nukes</em>, a documentary of the famous two-night Musicians United for Safe Energy concert event from September 1979.</p>\n<p>Let&#8217;s watch that powerful performance below, and remember: this was the very first time Bruce had ever performed &#8220;The River&#8221; in public.</p>\n<div id=\"v-14LE1IUk-1\" class=\"video-player\"><iframe title='VideoPress Video Player' aria-label='VideoPress Video Player' width='758' height='568' src='https://videopress.com/embed/14LE1IUk?hd=1&amp;cover=1&amp;loop=0&amp;autoPlay=0&amp;permalink=1&amp;muted=0&amp;controls=1&amp;playsinline=0&amp;useAverageColor=0&amp;preloadContent=metadata' frameborder='0' allowfullscreen data-resize-to-parent=\"true\" allow='clipboard-write'></iframe><script data-jetpack-boost=\"ignore\" src='https://s0.wp.com/wp-content/plugins/video/assets/js/next/videopress-iframe.js'></script></div>\n<p>Bruce had recorded the song not even one month before. He took the band into the studio to record &#8220;The River&#8221; immediately after he finished writing (and re-titling) it in August. It didn&#8217;t take long to settle on a completed take, and for a month or so, &#8220;The River&#8221; was almost the centerpiece of a single-disc album called  <em>The Ties That Bind.</em></p>\n<p>Neither the album nor the track saw the light of day at the time, but more than thirty-five years later, Bruce finally released both as part of his anniversary box set for <em>The River.</em></p>\n<p>Many fans don&#8217;t realize it, but the version of &#8220;The River&#8221; that&#8217;s included on the single-disc version is a different mix. Listen below to the original, unreleased (at the time) take&#8230;</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"The River\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/BjSsFvrrh7g?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>&#8230;and now compare it with the version that was released on <em>The River</em> in late 1980. Among the subtle differences, notice that <em>The Ties That Bind </em>version is brighter, with Max&#8217;s percussion notably higher in the mix. The version on <em>The River</em>, by contrast, is more muted. (It also features harmony overdubs in the outro missing from the earlier version.)</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"The River\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/y7BUXRsTbvI?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Let&#8217;s dig into the song itself. (Either version works fine for this part.)</p>\n<p>The first thing we notice about &#8220;The River&#8221; is its introduction. Bruce does double duty on both acoustic guitar and harmonica in his most cinematic overture since &#8220;Jungleland.&#8221; It&#8217;s rural and rustic and nostalgic, accomplishing more without words than Bruce could accomplish with them.</p>\n<p>We meet our narrator next; he introduces himself to us just like he did in &#8220;Oh Angelyne,&#8221; but he spends less time telling us about himself and introduces us to Mary right away.</p>\n<p style=\"padding-left: 40px;\"><em>I come from down in the valley where mister when you&#8217;re young</em><br />\n<em>They bring you up to do like your daddy done</em><br />\n<em>Me and Mary we met in high school when she was just seventeen</em><br />\n<em>We&#8217;d ride out of that valley down to where the fields were green</em></p>\n<p>Bruce will eventually clue us into his narrator&#8217;s occupation, but he wisely chooses to delay that piece of information. What&#8217;s important in this first verse is that he&#8217;s following in his father&#8217;s footsteps, living someone else&#8217;s life, not his own.</p>\n<p>As for Mary, we never really learn anything about her in either version of the song, but that&#8217;s okay. In &#8220;The River,&#8221; Mary is only important (to us) for what she represents: youth, freedom, love, and promise.</p>\n<p>Before we move on, let&#8217;s take a moment to appreciate how Bruce pauses the song at the end of the verse just long enough for us to understand that our narrator is losing himself in memory. It&#8217;s just one of several subtle but terrifically effective devices in &#8220;The River.&#8221;</p>\n<p>Now we arrive at the chorus, the last element of &#8220;The River&#8221; to take shape. It&#8217;s only two lines, but it completely transforms and elevates the song.</p>\n<p style=\"padding-left: 40px;\"><em>We&#8217;d go down to the river and into the river we&#8217;d dive</em><br />\n<em>Oh down to the river we&#8217;d ride</em></p>\n<p>With this first chorus, Bruce introduces the river as a metaphor for hope and dreams long before he ever wrote about a land of them. Our narrator and Mary swim in that river of dreams. They bathe in it, and they drink deeply from its intoxicating waters.</p>\n<p>Bruce concludes Act I with a healthy dose of reality. Young love leads to lasting consequences, as it often does, and Mary becomes pregnant only months, perhaps a year into their relationship.</p>\n<p style=\"padding-left: 40px;\"><em>Then I got Mary pregnant and man that was all she wrote</em><br />\n<em>And for my nineteenth birthday I got a union card and a wedding coat</em><br />\n<em>We went down to the courthouse and the judge put it all to rest</em><br />\n<em>No wedding day smiles, no walk down the aisle, no flowers no wedding dress</em></p>\n<p style=\"padding-left: 40px;\"><em>That night we went down to the river and into the river we&#8217;d dive</em><br />\n<em>Oh down to the river we did ride</em></p>\n<p>That flash-forward is a small but significant detail. We&#8217;ll circle back around to it, but for now let&#8217;s just note that it&#8217;s important that our young lovers had that time together before adulthood and parenthood laid their claim.</p>\n<p>Immediately, our heroes do the right thing: they marry in a civil ceremony that&#8217;s the complete opposite of the celebration they&#8217;d dreamed of, and whatever our narrator&#8217;s career ambitions were before no longer matter.</p>\n<p>That night, the honeymooners take one last trip to the river together. Well, the last one that Bruce chronicles, at least. There were probably more, but each time the river was a little drier, a little lower, a little more remote. Just like their dreams and promises.</p>\n<p>In Act II, we fast forward again. Bruce doesn&#8217;t tell us how much time has passed, but we get the sense that it&#8217;s been years since their last trip to the river together. Our narrator is an early victim of the newly receding economy, and his inability to provide for his family means what few dreams they&#8217;d managed to hold on to all these years continue to be compromised away.</p>\n<p style=\"padding-left: 40px;\"><em>I got a job working construction for the Johnstown Company</em><br />\n<em>But lately there ain&#8217;t been much work on account of the economy</em><br />\n<em>Now all them things that seemed so important, well mister they vanished right into the air</em><br />\n<em>Now I just act like I don&#8217;t remember, Mary acts like she don&#8217;t care</em></p>\n<p>&#8220;All them things&#8221; is a surprisingly dismissive description for their grand plans together, but we quickly learn their callousness is just an act. He remembers, and she cares.</p>\n<p>What follows next is one of Bruce Springsteen&#8217;s most powerful passages on record.</p>\n<p>Having conditioned us with a standard verse/chorus arrangement, Bruce suddenly breaks the pattern with an extra verse, raising both the key and the emotional stakes.</p>\n<p style=\"padding-left: 40px;\"><em>But I remember us riding in my brother&#8217;s car, her body tan and wet down at the reservoir</em><br />\n<em>At night on them banks I&#8217;d lie awake and pull her close just to feel each breath she&#8217;d take</em><br />\n<em>Now those memories come back to haunt me, they haunt me like a curse</em><br />\n<em>Is a dream a lie if it don&#8217;t come true or is it something worse</em></p>\n<p>A far cry from the prior verse&#8217;s vague descriptions, this last passage is chock full of vivid detail. The contrast tells us something important: our narrator is a man who lives in the past, and the past is so overwhelming to him that his voice cracks with emotion.</p>\n<p>Unable to appreciate his present circumstances, his inner life is more vivid than his outer one. And while his blissful first year with Mary may now be a distant memory, it&#8217;s a memory that hasn&#8217;t even begun to fade.</p>\n<p>And that&#8217;s a curse indeed.</p>\n<p>Which brings us, finally, to the central question of &#8220;The River&#8221;: <em>Is a dream a lie if it don&#8217;t come true, or is it something worse?</em></p>\n<p>What&#8217;s worse than what might have been? Answer: what once was true, but no longer is.</p>\n<p>For that first year, our lovers drank deeply from the river. They lived their dreams, and aspired to more. And then they were careless, and they watched their dreams slip away.</p>\n<p>It wasn&#8217;t a lie, because lies are things told to us by other people. It wasn&#8217;t a broken promise or a betrayal.</p>\n<p>It was simply a mistake, and it cost them everything. That&#8217;s what&#8217;s worse than a lie&#8211;the knowledge that the only one you can blame for your loss is yourself.</p>\n<p>Bruce returns us to one final chorus now, and even before we hear it, we know what&#8217;s coming.</p>\n<p style=\"padding-left: 40px;\"><em>That sends me down to the river, though I know the river is dry</em><br />\n<em>That sends me down to the river tonight</em><br />\n<em>Down to the river, my baby and I</em><br />\n<em>Oh down to the river we ride</em></p>\n<p>It&#8217;s easy to focus on the first two lines, since they drive home the metaphor via the dry river, now empty of hope, dreams and solace.</p>\n<p>But if we dismiss the last two lines as inconsequential, we miss one final, compelling detail: the river may be dry, but our heroes still visit it <em>together&#8211;</em>forever in search of some way to relight the flame that once warmed them.</p>\n<p>It&#8217;s a hauntingly beautiful (and beautifully haunting) finale that stays with us throughout the long, wordless coda.</p>\n<p>By now, after our two-installment examination, it should be clear that like many fans, I consider &#8220;The River&#8221; to rank among Bruce&#8217;s best and most powerful songs.</p>\n<p>So keep that in mind when I add: it&#8217;s also one of his most callow.</p>\n<p>At the age of thirty, Bruce hadn&#8217;t yet come to terms with marriage. As an emerging rock star still on the ascent, marriage and its accompanying responsibilities represented a threat to an itinerant musician  with Peter Pan syndrome. He&#8217;d already seen too many of his former bandmates and cohorts settle down and abandon their own quests for fame.</p>\n<p>As we discussed in &#8220;Oh Angelyne,&#8221; Bruce&#8217;s original inspiration for &#8220;The River&#8221; was the early marriage and subsequent struggles of his younger sister and brother-in-law. <em>Of course</em> he was going to treat that situation as a tragedy.</p>\n<p>I&#8217;m not saying &#8220;The River&#8221; isn&#8217;t a powerful and gorgeously constructed song&#8211;there&#8217;s no question about that. And I&#8217;m not dismissing the emotional impact of giving up on your dreams, whether individual or shared.</p>\n<p>But the idea that our narrator would be so consumed by the loss of young love so many years later strikes me as something only a young songwriter would invent. Adulthood and parenthood may rob us, but they gift us as well, and it takes some maturity and life experience to realize that.</p>\n<p>Bruce accumulated that experience and maturity over the years, and if we flash forward three decades to <em>Working on a Dream</em>, we arrive at an album full of songs more nuanced and more colorful, richer in emotional detail and with shades of appreciation that can only come on the other side of life and love experience. (There&#8217;s no way, for example, that we can imagine Bruce writing something like &#8220;Kingdom of Days&#8221; at age thirty.)</p>\n<p>&#8220;The River&#8221; is a wonderful song that resonated with me powerfully when I first discovered love, and less so with each passing anniversary. My wife and I laugh sometimes about the life we planned for ourselves, a life that never came close to coming true. We might occasionally get a bit wistful about it, but there&#8217;s not a thing we&#8217;d change.</p>\n<p>I suspect Bruce&#8217;s sister and brother-in-law feel the same way.</p>\n<p>Or to put it another way: a dream isn&#8217;t a lie if it don&#8217;t come true, but that doesn&#8217;t mean it has to be something worse. As the songwriter penned on the same album, we grow up&#8230; and dream again.</p>\n<hr />\n<p>&#8220;The River&#8221; is one of Bruce&#8217;s most well-known and well-loved songs. With no less than six official studio releases and four official live releases, it shouldn&#8217;t surprise that it&#8217;s also one of his most-performed songs.</p>\n<p>To date, Bruce has performed &#8220;The River&#8221; in concert a mind-boggling 683 times, which makes it virtually impossible to select just a few to represent his best.</p>\n<p>So instead, I&#8217;ll shine a spotlight on how the song has evolved over the years, starting with its first tour outing in 1980, which featured an extended (and unnecessary) piano introduction.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - The River (The River Tour, Tempe 1980)\" width=\"758\" height=\"426\" src=\"https://www.youtube.com/embed/lc6F47Z6PI4?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>Far more successful was the introduction to Bruce&#8217;s Reunion Tour arrangement. For three gorgeous minutes, first Clarence and then Bruce and Roy conjured the narrator&#8217;s loneliness and let it wash over us. By the time Bruce&#8217;s familiar vocals start, we&#8217;re already mourning our loss.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen &amp; The E Street Band - The River (Live in New York City)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/QHfdYaMksn0?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>&#8220;The River&#8221; has always been a delicate song; when performing it with the E Street Band, Bruce takes care with the arrangement lest the band overpower. But on his solo acoustic tours, Bruce is able to stretch a bit, and this acoustic arrangement from 1996 (accompanied by a mostly unseen Soozie Tyrell) is one of my favorites.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - The River [Freehold November 8, 1996]\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/k-0bLbdSNDs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>&#8220;The River&#8221; was a regular feature on Bruce&#8217;s 2005 acoustic tour as well, but this time he performed at the piano, with a haunting falsetto.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen - The River (Live Milan 07 June 2005)\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/17A12QFVytc?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p>But my favorite arrangement (right up there with the Reunion Tour) is Bruce&#8217;s Irish-influenced arrangement from 2006. &#8220;The River&#8221; never sounded more cinematic.</p>\n<div class=\"jetpack-video-wrapper\"><iframe loading=\"lazy\" title=\"Bruce Springsteen with The Seeger Sessions Band - The River\" width=\"758\" height=\"569\" src=\"https://www.youtube.com/embed/rvxYiudnnKk?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>\n<p><strong>The River<br />\nRecorded:</strong> August 26, 1979 &#8211; April 1980<br />\n<strong>Released: </strong><em>The River </em>(1980), <em>Greatest Hits </em>(1995), <em>The Essential Bruce Springsteen</em> (2003), <em>Chapter and Verse</em> (2016)<br />\n<strong>First performed:</strong> September 21, 1979 (New York City, NY)<br />\n<strong>Last performed:</strong> July 25, 2021 (Monza, Italy)</p>\n<p>Looking for your favorite Bruce song? Check our <a href=\"https://estreetshuffle.com/index.php/roll-of-the-dice-album-by-album/\">full index</a>. New entries every week!</p>\n", "protected": false}, "excerpt": {"rendered": "<p>Into the river we dive, as we appreciate one of Bruce&#8217;s finest and most heartbreaking songs.</p>\n", "protected": false}, "author": 1, "featured_media": 25753, "comment_status": "open", "ping_status": "open", "sticky": false, "template": "", "format": "standard", "meta": {"_monsterinsights_skip_tracking": false, "_monsterinsights_sitenote_active": false, "_monsterinsights_sitenote_note": "", "_monsterinsights_sitenote_category": 0, "jetpack_post_was_ever_published": false, "_jetpack_newsletter_access": "", "_jetpack_dont_email_post_to_subs": false, "_jetpack_newsletter_tier_id": 0, "_jetpack_memberships_contains_paywalled_content": false, "_jetpack_memberships_contains_paid_content": false, "footnotes": "", "jetpack_publicize_message": "", "jetpack_publicize_feature_enabled": true, "jetpack_social_post_already_shared": true, "jetpack_social_options": {"image_generator_settings": {"template": "highway", "default_image_id": 0, "font": "", "enabled": false}, "version": 2}}, "categories": [3], "tags": [467], "class_list": ["post-24353", "post", "type-post", "status-publish", "format-standard", "has-post-thumbnail", "hentry", "category-roll-of-the-dice", "tag-the-river"], "aioseo_notices": [], "jetpack_publicize_connections": [], "jetpack_featured_media_url": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2021/03/river-1.jpg?fit=1280%2C720&ssl=1", "jetpack_sharing_enabled": true, "jetpack_shortlink": "https://wp.me/p9w3Lk-6kN", "jetpack_likes_enabled": true, "jetpack-related-posts": [{"id": 442, "url": "https://estreetshuffle.com/index.php/2018/01/26/roll-of-the-dice-stray-bullet/", "url_meta": {"origin": 24353, "position": 0}, "title": "Roll of the Dice: Stray Bullet", "author": "Ken", "date": "January 26, 2018", "format": false, "excerpt": "\"Stray Bullet\" is a dark and haunting outcast from the River sessions.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/stray-bullet.jpg?fit=1200%2C674&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/stray-bullet.jpg?fit=1200%2C674&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/stray-bullet.jpg?fit=1200%2C674&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/stray-bullet.jpg?fit=1200%2C674&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/01/stray-bullet.jpg?fit=1200%2C674&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 2696, "url": "https://estreetshuffle.com/index.php/2018/06/27/roll-of-the-dice-lady-walking-down-by-the-river/", "url_meta": {"origin": 24353, "position": 1}, "title": "Roll of the Dice: Lady Walking Down by the River", "author": "Ken", "date": "June 27, 2018", "format": false, "excerpt": "Bruce's first published work in a college literary magazine leads to a Steel Mill song that would be recorded forty years later.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/06/a-walk-by-the-river-pierre-andre-brouillet.jpg?fit=900%2C736&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/06/a-walk-by-the-river-pierre-andre-brouillet.jpg?fit=900%2C736&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/06/a-walk-by-the-river-pierre-andre-brouillet.jpg?fit=900%2C736&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/06/a-walk-by-the-river-pierre-andre-brouillet.jpg?fit=900%2C736&ssl=1&resize=700%2C400 2x"}, "classes": []}, {"id": 17942, "url": "https://estreetshuffle.com/index.php/2020/05/13/roll-of-the-dice-down-by-the-river/", "url_meta": {"origin": 24353, "position": 2}, "title": "Roll of the Dice: Sax Song", "author": "Ken", "date": "May 13, 2020", "format": false, "excerpt": "Still missing in action after all these years, \"Down by the River\" is a straight up rocker featuring the E Street Band in all its glory that would have been right at home on The River.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/down-by-river.jpg?fit=600%2C600&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/down-by-river.jpg?fit=600%2C600&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2020/05/down-by-river.jpg?fit=600%2C600&ssl=1&resize=525%2C300 1.5x"}, "classes": []}, {"id": 1282, "url": "https://estreetshuffle.com/index.php/2018/03/29/roll-of-the-dice-baby-come-back/", "url_meta": {"origin": 24353, "position": 3}, "title": "Roll of the Dice: Baby Come Back", "author": "Ken", "date": "March 29, 2018", "format": false, "excerpt": "\"Baby Come Back\" is another unfinished castaway from The River home demo sessions.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2018/03/baby.jpg?fit=480%2C360&ssl=1&resize=350%2C200", "width": 350, "height": 200}, "classes": []}, {"id": 12714, "url": "https://estreetshuffle.com/index.php/2019/09/17/roll-of-the-dice-loves-gonna-be-tonight/", "url_meta": {"origin": 24353, "position": 4}, "title": "Roll of the Dice: Love&#8217;s Gonna Be Tonight", "author": "Ken", "date": "September 17, 2019", "format": false, "excerpt": "Cast off before he ever even finished it, \"Love's Gonna Be Tonight\" is a Buddy Holly homage that might have been right at home on The River.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/09/love-tonight.jpg?fit=1069%2C1104&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/09/love-tonight.jpg?fit=1069%2C1104&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/09/love-tonight.jpg?fit=1069%2C1104&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/09/love-tonight.jpg?fit=1069%2C1104&ssl=1&resize=700%2C400 2x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2019/09/love-tonight.jpg?fit=1069%2C1104&ssl=1&resize=1050%2C600 3x"}, "classes": []}, {"id": 37176, "url": "https://estreetshuffle.com/index.php/2022/08/25/roll-of-the-dice-the-time-that-never-was/", "url_meta": {"origin": 24353, "position": 5}, "title": "Roll of the Dice: The Time That Never Was", "author": "Ken", "date": "August 25, 2022", "format": false, "excerpt": "﻿ A true hidden gem from the Darkness/River era that should have seen an official release long before.", "rel": "", "context": "In &quot;Roll of the Dice&quot;", "block_context": {"text": "Roll of the Dice", "link": "https://estreetshuffle.com/index.php/category/roll-of-the-dice/"}, "img": {"alt_text": "", "src": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/TheTimeThatNeverWas_PRINTREADY_31-3-22.jpg?fit=767%2C679&ssl=1&resize=350%2C200", "width": 350, "height": 200, "srcset": "https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/TheTimeThatNeverWas_PRINTREADY_31-3-22.jpg?fit=767%2C679&ssl=1&resize=350%2C200 1x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/TheTimeThatNeverWas_PRINTREADY_31-3-22.jpg?fit=767%2C679&ssl=1&resize=525%2C300 1.5x, https://i0.wp.com/estreetshuffle.com/wp-content/uploads/2022/08/TheTimeThatNeverWas_PRINTREADY_31-3-22.jpg?fit=767%2C679&ssl=1&resize=700%2C400 2x"}, "classes": []}], "_links": {"self": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/24353", "targetHints": {"allow": ["GET"]}}], "collection": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts"}], "about": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/types/post"}], "author": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/users/1"}], "replies": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/comments?post=24353"}], "version-history": [{"count": 21, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/24353/revisions"}], "predecessor-version": [{"id": 47605, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/posts/24353/revisions/47605"}], "wp:featuredmedia": [{"embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media/25753"}], "wp:attachment": [{"href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/media?parent=24353"}], "wp:term": [{"taxonomy": "category", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/categories?post=24353"}, {"taxonomy": "post_tag", "embeddable": true, "href": "https://estreetshuffle.com/index.php/wp-json/wp/v2/tags?post=24353"}], "curies": [{"name": "wp", "href": "https://api.w.org/{rel}", "templated": true}]}}